<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>


   <title>6.1. &#25991;&#20214;&#31995;&#32479;&#36328;&#36234;</title>
   <meta name="generator" content="Help &amp; Manual" />
   <meta name="keywords" content="" />
   <meta http-equiv="Content-Type" content="text/html; charset=gb2312" />
   <meta http-equiv="Content-Style-Type" content="text/css" />
   <link type="text/css" href="default.css" rel="stylesheet" />
</head>
<body style="margin: 0px 0px 0px 0px; background: #FFFFFF;">


<table width="100%" border="0" cellspacing="0" cellpadding="5" bgcolor="#649CCC">
  <tr valign="middle">
    <td align="left">
      <p class="p_Heading1"><span class="f_Heading1">6.1. &#25991;&#20214;&#31995;&#32479;&#36328;&#36234;</span></p>

    </td>
    <td align="right">
     <span style="font-size: 9pt">
     <a href="introduction.htm">Top</a>&nbsp;
     <a href="new_item38.htm">Previous</a>&nbsp;
     <a href="new_item40.htm">Next</a>
     </span>
    </td>
  </tr>
</table>


<!-- Placeholder for topic body. -->
<table width="100%" border="0" cellspacing="0" cellpadding="5"><tr valign="top"><td align="left">
<p style="line-height: 1.50;">6.1. &#25991;&#20214;&#31995;&#32479;&#36328;&#36234;</p>
<p style="line-height: 1.50;">  &nbsp; &#26080;&#35770;&#20320;&#29992;&#20160;&#20040;&#26041;&#27861;&#20351;&#29992;&#25991;&#20214;&#65292;&#20320;&#37117;&#35201;&#22312;&#26576;&#20010;&#22320;&#26041;&#25351;&#23450;&#25991;&#20214;&#21517;&#12290;&#22312;&#24456;&#22810;&#24773;&#20917;&#19979;&#65292;&#25991;&#20214;&#21517;&#20250;&#20316;&#20026;fopen()&#20989;&#25968;&#30340;&#19968;&#20010;&#21442;&#25968;&#65292;&#21516;&#26102;&#20854;&#23427;&#20989;&#25968;&#20250;&#35843;&#29992;&#23427;&#36820;&#22238;&#30340;&#21477;&#26564;&#65306;</p>
<p style="line-height: 1.50;">  &nbsp; &lt;?php</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; $handle = fopen('/path/to/myfile.txt', 'r');</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; ?&gt;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &#24403;&#20320;&#25226;&#34987;&#27745;&#26579;&#25968;&#25454;&#20316;&#20026;&#25991;&#20214;&#21517;&#30340;&#19968;&#37096;&#20998;&#26102;&#65292;&#28431;&#27934;&#23601;&#20135;&#29983;&#20102;&#65306;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &lt;?php</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; $handle = fopen("/path/to/{$_GET['filename']}.txt", 'r');</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; ?&gt;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &#30001;&#20110;&#22312;&#26412;&#20363;&#20013;&#36335;&#24452;&#21644;&#25991;&#20214;&#21517;&#30340;&#21069;&#21518;&#20004;&#37096;&#20998;&#26080;&#27861;&#30001;&#25915;&#20987;&#32773;&#25152;&#25805;&#32437;&#65292;&#25915;&#20987;&#30340;&#21487;&#33021;&#24615;&#21463;&#21040;&#20102;&#38480;&#21046;&#12290;&#21487;&#26159;&#65292;&#38656;&#35201;&#32039;&#35760;&#30340;&#26159;&#26377;&#20123;&#25915;&#20987;&#20250;&#20351;&#29992;NULL&#65288;&#22312;URL&#20013;&#34920;&#31034;&#20026;%00&#65289;&#26469;&#20351;&#23383;&#31526;&#20018;&#32456;&#27490;&#65292;&#36825;&#26679;&#23601;&#33021;&#32469;&#36807;&#20219;&#20309;&#25991;&#20214;&#25193;&#23637;&#21517;&#30340;&#38480;&#21046;&#12290;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#26368;&#21361;&#38505;&#30340;&#25915;&#20987;&#25163;&#27573;&#26159;&#36890;&#36807;&#20351;&#29992;&#22810;&#20010;../&#26469;&#26041;&#38382;&#19978;&#32423;&#30446;&#24405;&#65292;&#20197;&#36798;&#21040;&#25991;&#20214;&#31995;&#32479;&#36328;&#36234;&#30340;&#30446;&#30340;&#12290;&#20363;&#22914;&#65292;&#24819;&#20687;&#19968;&#19979;filename&#30340;&#20540;&#34987;&#25351;&#23450;&#22914;&#19979;&#65306;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; http://example.org/file.php?file ... nother/path/to/file</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &#19982;&#35768;&#22810;&#25915;&#20987;&#30340;&#24773;&#20917;&#30456;&#21516;&#65292;&#22312;&#26500;&#36896;&#19968;&#20010;&#23383;&#20018;&#26102;&#22914;&#26524;&#20351;&#29992;&#20102;&#34987;&#27745;&#26579;&#25968;&#25454;&#65292;&#23601;&#20250;&#32473;&#25915;&#20987;&#32773;&#20197;&#26426;&#20250;&#26469;&#26356;&#25913;&#36825;&#20010;&#23383;&#20018;&#65292;&#36825;&#26679;&#23601;&#20250;&#36896;&#25104;&#20320;&#30340;&#24212;&#29992;&#20197;&#20320;&#19981;&#24076;&#26395;&#26041;&#24335;&#36816;&#34892;&#12290;&#22914;&#26524;&#20320;&#20859;&#25104;&#20102;&#21482;&#20351;&#29992;&#24050;&#36807;&#28388;&#25968;&#25454;&#26469;&#24314;&#31435;&#21160;&#24577;&#23383;&#20018;&#30340;&#20064;&#24815;&#65292;&#23601;&#21487;&#20197;&#38450;&#27490;&#24456;&#22810;&#31867;&#22411;&#21253;&#25324;&#24456;&#22810;&#20320;&#25152;&#19981;&#29087;&#24713;&#30340;&#28431;&#27934;&#30340;&#20986;&#29616;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &#30001;&#20110;fopen()&#25152;&#35843;&#29992;&#30340;&#25991;&#20214;&#21517;&#21069;&#23548;&#30340;&#38745;&#24577;&#37096;&#20998;&#26159;/path/to&#65292;&#25152;&#20197;&#19978;&#38754;&#30340;&#25915;&#20987;&#20013;&#21521;&#19978;&#36328;&#36234;&#30446;&#24405;&#30340;&#27425;&#25968;&#27604;&#25152;&#38656;&#30340;&#26356;&#22810;&#12290;&#22240;&#20026;&#25915;&#20987;&#32773;&#22312;&#21457;&#36215;&#25915;&#20987;&#21069;&#26080;&#27861;&#23519;&#30475;&#28304;&#30721;&#65292;&#25152;&#20197;&#20856;&#22411;&#30340;&#31574;&#30053;&#26159;&#36807;&#22810;&#27425;&#22320;&#37325;&#22797;../&#23383;&#20018;&#12290;../&#23383;&#20018;&#20351;&#29992;&#22826;&#22810;&#27425;&#24182;&#19981;&#20250;&#30772;&#22351;&#19978;&#38754;&#30340;&#25915;&#20987;&#25928;&#26524;&#65292;&#25152;&#20197;&#25915;&#20987;&#32773;&#27809;&#26377;&#24517;&#35201;&#29468;&#27979;&#30446;&#24405;&#30340;&#28145;&#24230;&#12290;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &#22312;&#19978;&#38754;&#30340;&#25915;&#20987;&#20013;&#20351;fopen()&#35843;&#29992;&#20197;&#20320;&#19981;&#24076;&#26395;&#26041;&#24335;&#36816;&#34892;&#65292;&#23427;&#31616;&#21270;&#21518;&#31561;&#20215;&#20110;&#65306;</p>
<p style="line-height: 1.50;">  &nbsp; &lt;?php</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; $handle = fopen('/another/path/to/file.txt', 'r');</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; ?&gt;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &#22312;&#24847;&#35782;&#21040;&#36825;&#20010;&#38382;&#39064;&#25110;&#36973;&#36935;&#25915;&#20987;&#21518;&#65292;&#24456;&#22810;&#24320;&#21457;&#32773;&#37117;&#20250;&#29359;&#35797;&#22270;&#32416;&#27491;&#28508;&#22312;&#30340;&#24694;&#24847;&#25968;&#25454;&#30340;&#38169;&#35823;&#65292;&#26377;&#26102;&#26681;&#26412;&#19981;&#20250;&#20808;&#23545;&#25968;&#25454;&#36827;&#34892;&#26816;&#26597;&#12290;&#27491;&#22914;&#31532;&#19968;&#31456;&#25152;&#36848;&#65292;&#26368;&#22909;&#30340;&#26041;&#27861;&#25226;&#36807;&#28388;&#30475;&#25104;&#26816;&#26597;&#36807;&#31243;&#65292;&#21516;&#26102;&#36843;&#20351;&#20351;&#29992;&#32773;&#36981;&#20174;&#20320;&#21046;&#23450;&#30340;&#35268;&#21017;&#12290;&#20363;&#22914;&#65292;&#22914;&#26524;&#21512;&#27861;&#30340;&#25991;&#20214;&#21517;&#21482;&#21253;&#21547;&#23383;&#27597;&#65292;&#19979;&#38754;&#30340;&#20195;&#30721;&#33021;&#21152;&#24378;&#36825;&#20010;&#38480;&#21046;&#65306;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &lt;?php</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; $clean = array();</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; if (ctype_alpha($_GET['filename']))</p>
<p style="line-height: 1.50;">  &nbsp; {</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; $clean['filename'] = $_GET['filename'];</p>
<p style="line-height: 1.50;">  &nbsp; }</p>
<p style="line-height: 1.50;">  &nbsp; else</p>
<p style="line-height: 1.50;">  &nbsp; {</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; /* ... */</p>
<p style="line-height: 1.50;">  &nbsp; }</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; $handle = fopen("/path/to/{$clean['filename']}.txt", 'r');</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; ?&gt;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &#24182;&#27809;&#26377;&#24517;&#35201;&#23545;filename&#20540;&#36827;&#34892;&#36716;&#20041;&#65292;&#36825;&#26159;&#22240;&#20026;&#36825;&#20123;&#25968;&#25454;&#20013;&#21482;&#29992;&#22312;PHP&#20989;&#25968;&#20013;&#32780;&#19981;&#20250;&#20256;&#36865;&#21040;&#36828;&#31243;&#31995;&#32479;&#12290;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">basename( )&#20989;&#25968;&#22312;&#26816;&#26597;&#26159;&#21542;&#26377;&#19981;&#24517;&#35201;&#30340;&#36335;&#24452;&#26102;&#38750;&#24120;&#26377;&#29992;&#65306;</p>
<p style="line-height: 1.50;">  &nbsp; &lt;?php</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; $clean = array();</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; if (basename($_GET['filename']) == $_GET['filename'])</p>
<p style="line-height: 1.50;">  &nbsp; {</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; $clean['filename'] = $_GET['filename'];</p>
<p style="line-height: 1.50;">  &nbsp; }</p>
<p style="line-height: 1.50;">  &nbsp; else</p>
<p style="line-height: 1.50;">  &nbsp; {</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; /* ... */</p>
<p style="line-height: 1.50;">  &nbsp; }</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; $handle = fopen("/path/to/{$clean['filename']}.txt", 'r');</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; ?&gt;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &#36825;&#20010;&#27969;&#31243;&#27604;&#21482;&#20801;&#35768;&#25991;&#20214;&#21517;&#26159;&#23383;&#27597;&#30340;&#23433;&#20840;&#24615;&#35201;&#24046;&#20102;&#19968;&#20123;&#65292;&#20294;&#20320;&#19981;&#22826;&#21487;&#33021;&#35201;&#27714;&#37027;&#26679;&#20005;&#26684;&#12290;&#27604;&#36739;&#22909;&#30340;&#28145;&#24230;&#38450;&#33539;&#27969;&#31243;&#26159;&#32508;&#21512;&#19978;&#38754;&#30340;&#20004;&#31181;&#26041;&#27861;&#65292;&#29305;&#21035;&#26159;&#20320;&#22312;&#29992;&#27491;&#21017;&#34920;&#36798;&#24335;&#26816;&#26597;&#20195;&#30721;&#21512;&#27861;&#24615;&#26102;&#65288;&#32780;&#19981;&#26159;&#29992;&#20989;&#25968;ctype_alpha( )&#65289;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &#24403;&#25991;&#20214;&#21517;&#30340;&#25972;&#20010;&#23614;&#37096;&#26159;&#30001;&#26410;&#36807;&#28388;&#25968;&#25454;&#32452;&#25104;&#26102;&#65292;&#19968;&#20010;&#39640;&#21361;&#28431;&#27934;&#23601;&#20135;&#29983;&#20102;&#65306;</p>
<p style="line-height: 1.50;">  &nbsp; &lt;?php</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; $handle = fopen("/path/to/{$_GET['filename']}", 'r');</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; ?&gt;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &#32473;&#20104;&#25915;&#20987;&#32773;&#26356;&#22810;&#30340;&#28789;&#27963;&#24615;&#24847;&#21619;&#30528;&#26356;&#22810;&#30340;&#28431;&#27934;&#12290;&#22312;&#36825;&#20010;&#20363;&#23376;&#20013;&#65292;&#25915;&#20987;&#32773;&#33021;&#25805;&#32437;filename&#21442;&#25968;&#25351;&#21521;&#25991;&#20214;&#31995;&#32479;&#20013;&#30340;&#20219;&#20309;&#25991;&#20214;&#65292;&#32780;&#19981;&#31649;&#36335;&#24452;&#21644;&#25991;&#20214;&#25193;&#23637;&#21517;&#26159;&#20160;&#20040;&#65292;&#36825;&#26159;&#22240;&#20026;&#25991;&#20214;&#25193;&#23637;&#21517;&#26159;$_GET['filename']&#30340;&#19968;&#37096;&#20998;&#12290;&#19968;&#26086;WEB&#26381;&#21153;&#22120;&#20855;&#26377;&#33021;&#35835;&#21462;&#35813;&#25991;&#20214;&#30340;&#26435;&#38480;&#65292;&#22788;&#29702;&#23601;&#20250;&#36716;&#21521;&#36825;&#20010;&#25915;&#20987;&#32773;&#25152;&#25351;&#23450;&#30340;&#25991;&#20214;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &#22914;&#26524;&#36335;&#24452;&#30340;&#21069;&#23548;&#37096;&#20998;&#20351;&#29992;&#20102;&#34987;&#27745;&#26579;&#25968;&#25454;&#30340;&#35805;&#65292;&#36825;&#19968;&#31867;&#30340;&#28431;&#27934;&#20250;&#21464;&#24471;&#29978;&#33267;&#26356;&#21152;&#24222;&#22823;&#12290;&#36825;&#20063;&#26159;&#19979;&#19968;&#33410;&#30340;&#20027;&#39064;&#12290;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<hr noshade size=1 ><p style="line-height: 1.50;">&nbsp;</p>

</td></tr></table>

</body>
</html>
