<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>


   <title>1.3.3. &#36807;&#28388;&#36755;&#20837;</title>
   <meta name="generator" content="Help &amp; Manual" />
   <meta name="keywords" content="" />
   <meta http-equiv="Content-Type" content="text/html; charset=gb2312" />
   <meta http-equiv="Content-Style-Type" content="text/css" />
   <link type="text/css" href="default.css" rel="stylesheet" />
</head>
<body style="margin: 0px 0px 0px 0px; background: #FFFFFF;">


<table width="100%" border="0" cellspacing="0" cellpadding="5" bgcolor="#649CCC">
  <tr valign="middle">
    <td align="left">
      <p class="p_Heading1"><span class="f_Heading1">1.3.3. &#36807;&#28388;&#36755;&#20837;</span></p>

    </td>
    <td align="right">
     <span style="font-size: 9pt">
     <a href="introduction.htm">Top</a>&nbsp;
     <a href="new_item13.htm">Previous</a>&nbsp;
     <a href="new_item15.htm">Next</a>
     </span>
    </td>
  </tr>
</table>


<!-- Placeholder for topic body. -->
<table width="100%" border="0" cellspacing="0" cellpadding="5"><tr valign="top"><td align="left">
<p style="line-height: 1.50;">1.3.3. &#36807;&#28388;&#36755;&#20837;</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; &nbsp;&#36807;&#28388;&#26159;Web&#24212;&#29992;&#23433;&#20840;&#30340;&#22522;&#30784;&#12290;&#23427;&#26159;&#20320;&#39564;&#35777;&#25968;&#25454;&#21512;&#27861;&#24615;&#30340;&#36807;&#31243;&#12290;&#36890;&#36807;&#22312;&#36755;&#20837;&#26102;&#30830;&#35748;&#23545;&#25152;&#26377;&#30340;&#25968;&#25454;&#36827;&#34892;&#36807;&#28388;&#65292;&#20320;&#21487;&#20197;&#36991;&#20813;&#34987;&#27745;&#26579;&#65288;&#26410;&#36807;&#28388;&#65289;&#25968;&#25454;&#22312;&#20320;&#30340;&#31243;&#24207;&#20013;&#34987;&#35823;&#20449;&#21450;&#35823;&#29992;&#12290;&#22823;&#22810;&#25968;&#27969;&#34892;&#30340;PHP&#24212;&#29992;&#30340;&#28431;&#27934;&#26368;&#32456;&#37117;&#26159;&#22240;&#20026;&#27809;&#26377;&#23545;&#36755;&#20837;&#36827;&#34892;&#24688;&#24403;&#36807;&#28388;&#36896;&#25104;&#30340;&#12290;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; &nbsp;&#25105;&#25152;&#25351;&#30340;&#36807;&#28388;&#36755;&#20837;&#26159;&#25351;&#19977;&#20010;&#19981;&#21516;&#30340;&#27493;&#39588;&#65306;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">l &nbsp; &nbsp; &nbsp; &nbsp;&#35782;&#21035;&#36755;&#20837;</p>
<p style="line-height: 1.50;">l &nbsp; &nbsp; &nbsp; &nbsp;&#36807;&#28388;&#36755;&#20837;</p>
<p style="line-height: 1.50;">l &nbsp; &nbsp; &nbsp; &nbsp;&#21306;&#20998;&#24050;&#36807;&#28388;&#21450;&#34987;&#27745;&#26579;&#25968;&#25454;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; &nbsp;&#25226;&#35782;&#21035;&#36755;&#20837;&#20570;&#20026;&#31532;&#19968;&#27493;&#26159;&#22240;&#20026;&#22914;&#26524;&#20320;&#19981;&#30693;&#36947;&#23427;&#26159;&#20160;&#20040;&#65292;&#20320;&#20063;&#23601;&#19981;&#33021;&#27491;&#30830;&#22320;&#36807;&#28388;&#23427;&#12290;&#36755;&#20837;&#26159;&#25351;&#25152;&#26377;&#28304;&#33258;&#22806;&#37096;&#30340;&#25968;&#25454;&#12290;&#20363;&#22914;&#65292;&#25152;&#26377;&#21457;&#33258;&#23458;&#25143;&#31471;&#30340;&#26159;&#36755;&#20837;&#65292;&#20294;&#23458;&#25143;&#31471;&#24182;&#19981;&#26159;&#21807;&#19968;&#30340;&#22806;&#37096;&#25968;&#25454;&#28304;&#65292;&#20854;&#23427;&#22914;&#25968;&#25454;&#24211;&#21644;RSS&#25512;&#36865;&#31561;&#20063;&#26159;&#22806;&#37096;&#25968;&#25454;&#28304;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; &nbsp;&#30001;&#29992;&#25143;&#36755;&#20837;&#30340;&#25968;&#25454;&#38750;&#24120;&#23481;&#26131;&#35782;&#21035;&#65292;PHP&#29992;&#20004;&#20010;&#36229;&#32423;&#20844;&#29992;&#25968;&#32452;$_GET &#21644;$_POST&#26469;&#23384;&#25918;&#29992;&#25143;&#36755;&#20837;&#25968;&#25454;&#12290;&#20854;&#23427;&#30340;&#36755;&#20837;&#35201;&#38590;&#35782;&#21035;&#24471;&#22810;&#65292;&#20363;&#22914;&#65292;$_SERVER&#25968;&#32452;&#20013;&#30340;&#24456;&#22810;&#20803;&#32032;&#26159;&#30001;&#23458;&#25143;&#31471;&#25152;&#25805;&#32437;&#30340;&#12290;&#24120;&#24120;&#24456;&#38590;&#30830;&#35748;$_SERVER&#25968;&#32452;&#20013;&#30340;&#21738;&#20123;&#20803;&#32032;&#32452;&#25104;&#20102;&#36755;&#20837;&#65292;&#25152;&#20197;&#65292;&#26368;&#22909;&#30340;&#26041;&#27861;&#26159;&#25226;&#25972;&#20010;&#25968;&#32452;&#30475;&#25104;&#36755;&#20837;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; &nbsp;&#22312;&#26576;&#20123;&#24773;&#20917;&#19979;&#65292;&#20320;&#25226;&#20160;&#20040;&#20316;&#20026;&#36755;&#20837;&#21462;&#20915;&#20110;&#20320;&#30340;&#35266;&#28857;&#12290;&#20363;&#22914;&#65292;session&#25968;&#25454;&#34987;&#20445;&#23384;&#22312;&#26381;&#21153;&#22120;&#19978;&#65292;&#20320;&#21487;&#33021;&#19981;&#20250;&#35748;&#20026;session&#25968;&#25454;&#26159;&#19968;&#20010;&#22806;&#37096;&#25968;&#25454;&#28304;&#12290;&#22914;&#26524;&#20320;&#25345;&#36825;&#31181;&#35266;&#28857;&#30340;&#35805;&#65292;&#21487;&#20197;&#25226;session&#25968;&#25454;&#30340;&#20445;&#23384;&#20301;&#32622;&#26159;&#22312;&#20320;&#30340;&#36719;&#20214;&#30340;&#20869;&#37096;&#12290;&#24847;&#35782;&#21040;session&#30340;&#20445;&#23384;&#20301;&#32622;&#30340;&#23433;&#20840;&#19982;&#36719;&#20214;&#30340;&#23433;&#20840;&#26159;&#32852;&#31995;&#22312;&#19968;&#36215;&#30340;&#20107;&#23454;&#26159;&#38750;&#24120;&#26126;&#26234;&#30340;&#12290;&#21516;&#26679;&#30340;&#35266;&#28857;&#21487;&#20197;&#25512;&#21450;&#21040;&#25968;&#25454;&#24211;&#65292;&#20320;&#20063;&#21487;&#20197;&#25226;&#23427;&#30475;&#25104;&#20320;&#36719;&#20214;&#30340;&#19968;&#37096;&#20998;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; &nbsp;&#19968;&#33324;&#26469;&#35828;&#65292;&#25226;session&#20445;&#23384;&#20301;&#32622;&#19982;&#25968;&#25454;&#24211;&#30475;&#25104;&#26159;&#36755;&#20837;&#26159;&#26356;&#20026;&#23433;&#20840;&#30340;&#65292;&#21516;&#26102;&#36825;&#20063;&#26159;&#25105;&#22312;&#25152;&#26377;&#37325;&#35201;&#30340;PHP&#24212;&#29992;&#24320;&#21457;&#20013;&#25152;&#25512;&#33616;&#30340;&#26041;&#27861;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; &nbsp;&#19968;&#26086;&#35782;&#21035;&#20102;&#36755;&#20837;&#65292;&#20320;&#23601;&#21487;&#20197;&#36807;&#28388;&#23427;&#20102;&#12290;&#36807;&#28388;&#26159;&#19968;&#20010;&#26377;&#28857;&#27491;&#24335;&#30340;&#26415;&#35821;&#65292;&#23427;&#22312;&#24179;&#26102;&#34920;&#36848;&#20013;&#26377;&#24456;&#22810;&#21516;&#20041;&#35789;&#65292;&#22914;&#39564;&#35777;&#12289;&#28165;&#27905;&#21450;&#20928;&#21270;&#12290;&#23613;&#31649;&#36825;&#20123;&#22823;&#23478;&#24179;&#26102;&#25152;&#29992;&#30340;&#26415;&#35821;&#31245;&#26377;&#19981;&#21516;&#65292;&#20294;&#23427;&#20204;&#37117;&#26159;&#25351;&#30340;&#21516;&#19968;&#20010;&#22788;&#29702;&#65306;&#38450;&#27490;&#38750;&#27861;&#25968;&#25454;&#36827;&#20837;&#20320;&#30340;&#24212;&#29992;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; &nbsp;&#26377;&#24456;&#22810;&#31181;&#26041;&#27861;&#36807;&#28388;&#25968;&#25454;&#65292;&#20854;&#20013;&#26377;&#19968;&#20123;&#23433;&#20840;&#24615;&#36739;&#39640;&#12290;&#26368;&#22909;&#30340;&#26041;&#27861;&#26159;&#25226;&#36807;&#28388;&#30475;&#25104;&#26159;&#19968;&#20010;&#26816;&#26597;&#30340;&#36807;&#31243;&#12290;&#35831;&#19981;&#35201;&#35797;&#22270;&#22909;&#24515;&#22320;&#21435;&#32416;&#27491;&#38750;&#27861;&#25968;&#25454;&#65292;&#35201;&#35753;&#20320;&#30340;&#29992;&#25143;&#25353;&#20320;&#30340;&#35268;&#21017;&#21435;&#20570;&#65292;&#21382;&#21490;&#35777;&#26126;&#20102;&#35797;&#22270;&#32416;&#27491;&#38750;&#27861;&#25968;&#25454;&#24448;&#24448;&#20250;&#23548;&#33268;&#23433;&#20840;&#28431;&#27934;&#12290;&#20363;&#22914;&#65292;&#32771;&#34385;&#19968;&#19979;&#19979;&#38754;&#30340;&#35797;&#22270;&#38450;&#27490;&#30446;&#24405;&#36328;&#36234;&#30340;&#26041;&#27861;&#65288;&#35775;&#38382;&#19978;&#23618;&#30446;&#24405;&#65289;&#12290;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">CODE:</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp;&lt;?php</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; $filename = str_replace('..', '.', $_POST['filename']);</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; ?&gt;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; &nbsp;&#20320;&#33021;&#24819;&#21040;$_POST['filename']&#22914;&#20309;&#21462;&#20540;&#20197;&#20351;$filename&#25104;&#20026;Linux&#31995;&#32479;&#20013;&#29992;&#25143;&#21475;&#20196;&#25991;&#20214;&#30340;&#36335;&#24452;../../etc/passwd&#21527;&#65311;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; &nbsp;&#31572;&#26696;&#24456;&#31616;&#21333;&#65306;</p>
<p style="line-height: 1.50;">  &nbsp; .../.../etc/passwd</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; &nbsp;&#36825;&#20010;&#29305;&#23450;&#30340;&#38169;&#35823;&#21487;&#20197;&#36890;&#36807;&#21453;&#22797;&#26367;&#25442;&#30452;&#33267;&#25214;&#19981;&#21040;&#20026;&#27490;&#65306;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">CODE:</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &lt;?php</p>
<p style="line-height: 1.50;">  &nbsp; $filename = $_POST['filename'];</p>
<p style="line-height: 1.50;">  &nbsp; while (strpos($_POST['filename'], '..') != &nbsp;= FALSE)</p>
<p style="line-height: 1.50;">  &nbsp; {</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; $filename = str_replace('..', '.', $filename);</p>
<p style="line-height: 1.50;">  &nbsp; }</p>
<p style="line-height: 1.50;">  &nbsp; ?&gt;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; &nbsp;&#24403;&#28982;&#65292;&#20989;&#25968;basename( )&#21487;&#20197;&#26367;&#20195;&#19978;&#38754;&#30340;&#25152;&#26377;&#36923;&#36753;&#65292;&#21516;&#26102;&#20063;&#33021;&#26356;&#23433;&#20840;&#22320;&#36798;&#21040;&#30446;&#30340;&#12290;&#19981;&#36807;&#37325;&#35201;&#28857;&#26159;&#22312;&#20110;&#20219;&#20309;&#35797;&#22270;&#32416;&#27491;&#38750;&#27861;&#25968;&#25454;&#30340;&#20030;&#21160;&#37117;&#21487;&#33021;&#23548;&#33268;&#28508;&#22312;&#38169;&#35823;&#24182;&#20801;&#35768;&#38750;&#27861;&#25968;&#25454;&#36890;&#36807;&#12290;&#21482;&#20570;&#26816;&#26597;&#26159;&#19968;&#20010;&#26356;&#23433;&#20840;&#30340;&#36873;&#25321;&#12290;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp;  <span style="font-weight: bold;">&#35793;&#27880;</span>&#65306;&#36825;&#19968;&#28857;&#28145;&#26377;&#20307;&#20250;&#65292;&#22312;&#23454;&#38469;&#39033;&#30446;&#26366;&#32463;&#36935;&#21040;&#36807;&#36825;&#26679;&#19968;&#20214;&#20107;&#65292;&#26159;&#23545;&#19968;&#20010;&#29992;&#25143;&#27880;&#20876;&#21644;&#30331;&#24405;&#31995;&#32479;&#36827;&#34892;&#26356;&#25913;&#65292;&#23458;&#25143;&#24076;&#26395;&#29992;&#25143;&#21517;&#21069;&#21518;&#26377;&#31354;&#26684;&#23601;&#19981;&#33021;&#30331;&#24405;&#65292;&#32467;&#26524;&#20462;&#25913;&#26102;&#23545;&#29992;&#25143;&#30331;&#24405;&#31243;&#24207;&#36827;&#34892;&#20102;&#26356;&#25913;&#65292;&#29992;trim&#65288;&#65289;&#20989;&#25968;&#25226;&#36755;&#20837;&#30340;&#29992;&#25143;&#21517;&#21069;&#21518;&#30340;&#31354;&#26684;&#21435;&#25481;&#20102;&#65288;&#20856;&#22411;&#30340;&#22909;&#24515;&#21150;&#22351;&#20107;&#65289;&#65292;&#20294;&#26159;&#22312;&#27880;&#20876;&#26102;&#23621;&#28982;&#36824;&#26159;&#20801;&#35768;&#21069;&#21518;&#26377;&#31354;&#26684;&#65281;&#32467;&#26524;&#21487;&#24819;&#32780;&#30693;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; &nbsp;&#38500;&#20102;&#25226;&#36807;&#28388;&#20570;&#20026;&#19968;&#20010;&#26816;&#26597;&#36807;&#31243;&#20043;&#22806;&#65292;&#20320;&#36824;&#21487;&#20197;&#22312;&#21487;&#33021;&#26102;&#29992;&#30333;&#21517;&#21333;&#26041;&#27861;&#12290;&#23427;&#26159;&#25351;&#20320;&#38656;&#35201;&#20551;&#23450;&#20320;&#27491;&#22312;&#26816;&#26597;&#30340;&#25968;&#25454;&#26159;&#38750;&#27861;&#30340;&#65292;&#38500;&#38750;&#20320;&#33021;&#35777;&#26126;&#23427;&#26159;&#21512;&#27861;&#30340;&#12290;&#25442;&#32780;&#35328;&#20043;&#65292;&#20320;&#23425;&#21487;&#22312;&#23567;&#24515;&#19978;&#29359;&#38169;&#12290;&#20351;&#29992;&#36825;&#20010;&#26041;&#27861;&#65292;&#19968;&#20010;&#38169;&#35823;&#21482;&#20250;&#23548;&#33268;&#20320;&#25226;&#21512;&#27861;&#30340;&#25968;&#25454;&#24403;&#25104;&#26159;&#38750;&#27861;&#30340;&#12290;&#23613;&#31649;&#19981;&#24819;&#29359;&#20219;&#20309;&#38169;&#35823;&#65292;&#20294;&#36825;&#26679;&#24635;&#27604;&#25226;&#38750;&#27861;&#25968;&#25454;&#24403;&#25104;&#21512;&#27861;&#25968;&#25454;&#35201;&#23433;&#20840;&#24471;&#22810;&#12290;&#36890;&#36807;&#20943;&#36731;&#29359;&#38169;&#24341;&#36215;&#30340;&#25439;&#22833;&#65292;&#20320;&#21487;&#20197;&#25552;&#39640;&#20320;&#30340;&#24212;&#29992;&#30340;&#23433;&#20840;&#24615;&#12290;&#23613;&#31649;&#36825;&#20010;&#24819;&#27861;&#22312;&#29702;&#35770;&#19978;&#26159;&#24456;&#33258;&#28982;&#30340;&#65292;&#20294;&#21382;&#21490;&#35777;&#26126;&#65292;&#36825;&#26159;&#19968;&#20010;&#24456;&#26377;&#20215;&#20540;&#30340;&#26041;&#27861;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; &nbsp;&#22914;&#26524;&#20320;&#33021;&#27491;&#30830;&#21487;&#38752;&#22320;&#35782;&#21035;&#21644;&#36807;&#28388;&#36755;&#20837;&#65292;&#20320;&#30340;&#24037;&#20316;&#23601;&#22522;&#26412;&#23436;&#25104;&#20102;&#12290;&#26368;&#21518;&#19968;&#27493;&#26159;&#20351;&#29992;&#19968;&#20010;&#21629;&#21517;&#32422;&#23450;&#25110;&#20854;&#23427;&#21487;&#20197;&#24110;&#21161;&#20320;&#27491;&#30830;&#21644;&#21487;&#38752;&#22320;&#21306;&#20998;&#24050;&#36807;&#28388;&#21644;&#34987;&#27745;&#26579;&#25968;&#25454;&#30340;&#26041;&#27861;&#12290;&#25105;&#25512;&#33616;&#19968;&#20010;&#27604;&#36739;&#31616;&#21333;&#30340;&#21629;&#21517;&#32422;&#23450;&#65292;&#22240;&#20026;&#23427;&#21487;&#20197;&#21516;&#26102;&#29992;&#22312;&#38754;&#21521;&#36807;&#31243;&#21644;&#38754;&#21521;&#23545;&#35937;&#30340;&#32534;&#31243;&#20013;&#12290;&#25105;&#29992;&#30340;&#21629;&#21517;&#32422;&#23450;&#26159;&#25226;&#25152;&#26377;&#32463;&#36807;&#28388;&#30340;&#25968;&#25454;&#25918;&#20837;&#19968;&#20010;&#21483;$clean&#30340;&#25968;&#25454;&#20013;&#12290;&#20320;&#38656;&#35201;&#29992;&#20004;&#20010;&#37325;&#35201;&#30340;&#27493;&#39588;&#26469;&#38450;&#27490;&#34987;&#27745;&#26579;&#25968;&#25454;&#30340;&#27880;&#20837;&#65306;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">l &nbsp; &nbsp; &nbsp; &nbsp;&#32463;&#24120;&#21021;&#22987;&#21270;$clean&#20026;&#19968;&#20010;&#31354;&#25968;&#32452;&#12290;</p>
<p style="line-height: 1.50;">l &nbsp; &nbsp; &nbsp; &nbsp;&#21152;&#20837;&#26816;&#26597;&#21450;&#38459;&#27490;&#26469;&#33258;&#22806;&#37096;&#25968;&#25454;&#28304;&#30340;&#21464;&#37327;&#21629;&#21517;&#20026;clean&#65292; </p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; &nbsp;&#23454;&#38469;&#19978;&#65292;&#21482;&#26377;&#21021;&#22987;&#21270;&#26159;&#33267;&#20851;&#32039;&#35201;&#30340;&#65292;&#20294;&#26159;&#20859;&#25104;&#36825;&#26679;&#19968;&#20010;&#20064;&#24815;&#20063;&#26159;&#24456;&#22909;&#30340;&#65306;&#25226;&#25152;&#26377;&#21629;&#21517;&#20026;clean&#30340;&#21464;&#37327;&#35748;&#20026;&#26159;&#20320;&#30340;&#24050;&#36807;&#28388;&#25968;&#25454;&#25968;&#32452;&#12290;&#36825;&#19968;&#27493;&#39588;&#21512;&#29702;&#22320;&#20445;&#35777;&#20102;$clean&#20013;&#21482;&#21253;&#25324;&#20320;&#26377;&#24847;&#20445;&#23384;&#36827;&#21435;&#30340;&#25968;&#25454;&#65292;&#20320;&#25152;&#35201;&#36127;&#36131;&#30340;&#21482;&#26159;&#19981;&#22312;$clean&#23384;&#22312;&#34987;&#27745;&#26579;&#25968;&#25454;&#12290;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; &nbsp;&#20026;&#20102;&#24041;&#22266;&#36825;&#20123;&#27010;&#24565;&#65292;&#32771;&#34385;&#19979;&#38754;&#30340;&#34920;&#21333;&#65292;&#23427;&#20801;&#35768;&#29992;&#25143;&#36873;&#25321;&#19977;&#31181;&#39068;&#33394;&#20013;&#30340;&#19968;&#31181;&#65307;</p>
<p style="line-height: 1.50;">CODE:</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp;&lt;form action="process.php" method="POST"&gt;</p>
<p style="line-height: 1.50;">  &nbsp; Please select a color:</p>
<p style="line-height: 1.50;">  &nbsp; &lt;select name="color"&gt;</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &lt;option value="red"&gt;red&lt;/option&gt;</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &lt;option value="green"&gt;green&lt;/option&gt;</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &lt;option value="blue"&gt;blue&lt;/option&gt;</p>
<p style="line-height: 1.50;">  &nbsp; &lt;/select&gt;</p>
<p style="line-height: 1.50;">  &nbsp; &lt;input type="submit" /&gt;</p>
<p style="line-height: 1.50;">  &nbsp; &lt;/form&gt;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; &nbsp;&#22312;&#22788;&#29702;&#36825;&#20010;&#34920;&#21333;&#30340;&#32534;&#31243;&#36923;&#36753;&#20013;&#65292;&#38750;&#24120;&#23481;&#26131;&#29359;&#30340;&#38169;&#35823;&#26159;&#35748;&#20026;&#21482;&#33021;&#25552;&#20132;&#19977;&#20010;&#36873;&#25321;&#20013;&#30340;&#19968;&#20010;&#12290;&#22312;&#31532;&#20108;&#31456;&#20013;&#20320;&#23558;&#23398;&#21040;&#65292;&#23458;&#25143;&#31471;&#33021;&#25552;&#20132;&#20219;&#20309;&#25968;&#25454;&#20316;&#20026;$_POST['color']&#30340;&#20540;&#12290;&#20026;&#20102;&#27491;&#30830;&#22320;&#36807;&#28388;&#25968;&#25454;&#65292;&#20320;&#38656;&#35201;&#29992;&#19968;&#20010;switch&#35821;&#21477;&#26469;&#36827;&#34892;&#65306;</p>
<p style="line-height: 1.50;">CODE:</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &lt;?php</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; $clean = array( &nbsp;);</p>
<p style="line-height: 1.50;">  &nbsp; switch($_POST['color'])</p>
<p style="line-height: 1.50;">  &nbsp; {</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; case 'red':</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; case 'green':</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; case 'blue':</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; $clean['color'] = $_POST['color'];</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; break;</p>
<p style="line-height: 1.50;">  &nbsp; }</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; ?&gt;</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; &nbsp;&#26412;&#20363;&#20013;&#39318;&#20808;&#21021;&#22987;&#21270;&#20102;$clean&#20026;&#31354;&#25968;&#32452;&#20197;&#38450;&#27490;&#21253;&#21547;&#34987;&#27745;&#26579;&#30340;&#25968;&#25454;&#12290;&#19968;&#26086;&#35777;&#26126;$_POST['color']&#26159;red, green, &#25110;blue&#20013;&#30340;&#19968;&#20010;&#26102;&#65292;&#23601;&#20250;&#20445;&#23384;&#21040;$clean['color']&#21464;&#37327;&#20013;&#12290;&#22240;&#27492;&#65292;&#21487;&#20197;&#30830;&#20449;$clean['color']&#21464;&#37327;&#26159;&#21512;&#27861;&#30340;&#65292;&#20174;&#32780;&#22312;&#20195;&#30721;&#30340;&#20854;&#23427;&#37096;&#20998;&#20351;&#29992;&#23427;&#12290;&#24403;&#28982;&#65292;&#20320;&#36824;&#21487;&#20197;&#22312;switch&#32467;&#26500;&#20013;&#21152;&#20837;&#19968;&#20010;default&#20998;&#25903;&#20197;&#22788;&#29702;&#38750;&#27861;&#25968;&#25454;&#30340;&#24773;&#20917;&#12290;&#19968;&#31181;&#21487;&#33021;&#26159;&#20877;&#27425;&#26174;&#31034;&#34920;&#21333;&#24182;&#25552;&#31034;&#38169;&#35823;&#12290;&#29305;&#21035;&#23567;&#24515;&#19981;&#35201;&#35797;&#22270;&#20026;&#20102;&#21451;&#22909;&#32780;&#36755;&#20986;&#34987;&#27745;&#26579;&#30340;&#25968;&#25454;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; &nbsp;&#19978;&#38754;&#30340;&#26041;&#27861;&#23545;&#20110;&#36807;&#28388;&#26377;&#19968;&#32452;&#24050;&#30693;&#30340;&#21512;&#27861;&#20540;&#30340;&#25968;&#25454;&#24456;&#26377;&#25928;&#65292;&#20294;&#26159;&#23545;&#20110;&#36807;&#28388;&#26377;&#19968;&#32452;&#24050;&#30693;&#21512;&#27861;&#23383;&#31526;&#32452;&#25104;&#30340;&#25968;&#25454;&#26102;&#23601;&#27809;&#26377;&#20160;&#20040;&#24110;&#21161;&#12290;&#20363;&#22914;&#65292;&#20320;&#21487;&#33021;&#38656;&#35201;&#19968;&#20010;&#29992;&#25143;&#21517;&#21482;&#33021;&#30001;&#23383;&#27597;&#21450;&#25968;&#23383;&#32452;&#25104;&#65306;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">CODE:</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp;&lt;?php</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; $clean = array( &nbsp;);</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; if (ctype_alnum($_POST['username']))</p>
<p style="line-height: 1.50;">  &nbsp; {</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; $clean['username'] = $_POST['username'];</p>
<p style="line-height: 1.50;">  &nbsp; }</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; ?&gt;</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; &nbsp;&#23613;&#31649;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#21487;&#20197;&#29992;&#27491;&#21017;&#34920;&#36798;&#24335;&#65292;&#20294;&#20351;&#29992;PHP&#20869;&#32622;&#20989;&#25968;&#26159;&#26356;&#23436;&#32654;&#30340;&#12290;&#36825;&#20123;&#20989;&#25968;&#21253;&#21547;&#38169;&#35823;&#30340;&#21487;&#33021;&#24615;&#35201;&#27604;&#20320;&#33258;&#24050;&#20889;&#30340;&#20195;&#30721;&#20986;&#38169;&#30340;&#21487;&#33021;&#24615;&#35201;&#20302;&#24471;&#22810;&#65292;&#32780;&#19988;&#22312;&#36807;&#28388;&#36923;&#36753;&#20013;&#30340;&#19968;&#20010;&#38169;&#35823;&#20960;&#20046;&#23601;&#24847;&#21619;&#30528;&#19968;&#20010;&#23433;&#20840;&#28431;&#27934;&#12290;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<hr noshade size=1 ><p style="line-height: 1.50;">&nbsp;</p>

</td></tr></table>

</body>
</html>
