<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>


   <title>2.6. &#27450;&#39575;&#34920;&#21333;&#25552;&#20132;</title>
   <meta name="generator" content="Help &amp; Manual" />
   <meta name="keywords" content="" />
   <meta http-equiv="Content-Type" content="text/html; charset=gb2312" />
   <meta http-equiv="Content-Style-Type" content="text/css" />
   <link type="text/css" href="default.css" rel="stylesheet" />
</head>
<body style="margin: 0px 0px 0px 0px; background: #FFFFFF;">


<table width="100%" border="0" cellspacing="0" cellpadding="5" bgcolor="#649CCC">
  <tr valign="middle">
    <td align="left">
      <p class="p_Heading1"><span class="f_Heading1">2.6. &#27450;&#39575;&#34920;&#21333;&#25552;&#20132;</span></p>

    </td>
    <td align="right">
     <span style="font-size: 9pt">
     <a href="introduction.htm">Top</a>&nbsp;
     <a href="new_item21.htm">Previous</a>&nbsp;
     <a href="new_item23.htm">Next</a>
     </span>
    </td>
  </tr>
</table>


<!-- Placeholder for topic body. -->
<table width="100%" border="0" cellspacing="0" cellpadding="5"><tr valign="top"><td align="left">
<p style="line-height: 1.50;">2.6. &#27450;&#39575;&#34920;&#21333;&#25552;&#20132;</p>
<p style="line-height: 1.50;">  &nbsp; &#21046;&#36896;&#19968;&#20010;&#27450;&#39575;&#34920;&#21333;&#20960;&#20046;&#19982;&#20551;&#36896;&#19968;&#20010;URL&#19968;&#26679;&#31616;&#21333;&#12290;&#27605;&#31455;&#65292;&#34920;&#21333;&#30340;&#25552;&#20132;&#21482;&#26159;&#27983;&#35272;&#22120;&#21457;&#20986;&#30340;&#19968;&#20010;HTTP&#35831;&#27714;&#32780;&#24050;&#12290;&#35831;&#27714;&#30340;&#37096;&#20998;&#26684;&#24335;&#21462;&#20915;&#20110;&#34920;&#21333;&#65292;&#26576;&#20123;&#35831;&#27714;&#20013;&#30340;&#25968;&#25454;&#26469;&#33258;&#20110;&#29992;&#25143;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &#22823;&#22810;&#25968;&#34920;&#21333;&#29992;&#19968;&#20010;&#30456;&#23545;URL&#22320;&#22336;&#26469;&#25351;&#23450;action&#23646;&#24615;&#65306;</p>
<p style="line-height: 1.50;">  &nbsp; &lt;form action="process.php" method="POST"&gt;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &#24403;&#34920;&#21333;&#25552;&#20132;&#26102;&#65292;&#27983;&#35272;&#22120;&#20250;&#35831;&#27714;action&#20013;&#25351;&#23450;&#30340;URL&#65292;&#21516;&#26102;&#23427;&#20351;&#29992;&#24403;&#21069;&#30340;URL&#22320;&#22336;&#26469;&#23450;&#20301;&#30456;&#23545;URL&#12290;&#20363;&#22914;&#65292;&#22914;&#26524;&#20043;&#21069;&#30340;&#34920;&#21333;&#26159;&#23545;http://example.org/path/to/form.php&#35831;&#27714;&#30340;&#22238;&#24212;&#25152;&#20135;&#29983;&#30340;&#65292;&#21017;&#22312;&#29992;&#25143;&#25552;&#20132;&#34920;&#21333;&#21518;&#20250;&#35831;&#27714;URL&#22320;&#22336;http://example.org/path/to/process.php&#12290;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &#30693;&#36947;&#20102;&#36825;&#19968;&#28857;&#65292;&#24456;&#23481;&#26131;&#23601;&#33021;&#24819;&#21040;&#20320;&#21487;&#20197;&#25351;&#23450;&#19968;&#20010;&#32477;&#23545;&#22320;&#22336;&#65292;&#36825;&#26679;&#34920;&#21333;&#23601;&#21487;&#20197;&#25918;&#22312;&#20219;&#20309;&#22320;&#26041;&#20102;&#65306;</p>
<p style="line-height: 1.50;">  &nbsp; &lt;form action="http://example.org/path/to/process.php" method="POST"&gt;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &#36825;&#20010;&#34920;&#21333;&#21487;&#20197;&#25918;&#22312;&#20219;&#20309;&#22320;&#26041;&#65292;&#24182;&#19988;&#20351;&#29992;&#36825;&#20010;&#34920;&#21333;&#20135;&#29983;&#30340;&#25552;&#20132;&#19982;&#21407;&#22987;&#34920;&#21333;&#20135;&#29983;&#30340;&#25552;&#20132;&#26159;&#30456;&#21516;&#30340;&#12290;&#24847;&#35782;&#21040;&#36825;&#19968;&#28857;&#65292;&#25915;&#20987;&#32773;&#21487;&#20197;&#36890;&#36807;&#26597;&#30475;&#39029;&#38754;&#28304;&#25991;&#20214;&#24182;&#20445;&#23384;&#22312;&#20182;&#30340;&#26381;&#21153;&#22120;&#19978;&#65292;&#21516;&#26102;&#23558;action&#26356;&#25913;&#20026;&#32477;&#23545;URL&#22320;&#22336;&#12290;&#36890;&#36807;&#20351;&#29992;&#36825;&#20123;&#25163;&#27573;&#65292;&#25915;&#20987;&#32773;&#21487;&#20197;&#20219;&#24847;&#26356;&#25913;&#34920;&#21333;&#65292;&#22914;&#21462;&#28040;&#26368;&#22823;&#23383;&#27573;&#38271;&#24230;&#38480;&#21046;&#65292;&#21462;&#28040;&#26412;&#22320;&#39564;&#35777;&#20195;&#30721;&#65292;&#26356;&#25913;&#38544;&#34255;&#23383;&#27573;&#30340;&#20540;&#65292;&#25110;&#32773;&#20986;&#20110;&#26356;&#21152;&#28789;&#27963;&#30340;&#30446;&#30340;&#32780;&#25913;&#20889;&#20803;&#32032;&#31867;&#22411;&#12290;&#36825;&#20123;&#26356;&#25913;&#24110;&#21161;&#25915;&#20987;&#32773;&#21521;&#26381;&#21153;&#22120;&#25552;&#20132;&#20219;&#20309;&#25968;&#25454;&#65292;&#21516;&#26102;&#30001;&#20110;&#36825;&#20010;&#36807;&#31243;&#38750;&#24120;&#31616;&#20415;&#26131;&#34892;&#65292;&#25915;&#20987;&#32773;&#26080;&#38656;&#26159;&#19968;&#20010;&#19987;&#23478;&#21363;&#21487;&#20570;&#21040;&#12290;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &#27450;&#39575;&#34920;&#21333;&#25915;&#20987;&#26159;&#19981;&#33021;&#38450;&#27490;&#30340;&#65292;&#23613;&#31649;&#36825;&#30475;&#36215;&#26469;&#26377;&#28857;&#22855;&#24618;&#65292;&#20294;&#20107;&#23454;&#19978;&#22914;&#27492;&#12290;&#19981;&#36807;&#36825;&#20320;&#19981;&#38656;&#35201;&#25285;&#24515;&#12290;&#19968;&#26086;&#20320;&#27491;&#30830;&#22320;&#36807;&#28388;&#20102;&#36755;&#20837;&#65292;&#29992;&#25143;&#23601;&#24517;&#39035;&#35201;&#36981;&#23432;&#20320;&#30340;&#35268;&#21017;&#65292;&#36825;&#19982;&#20182;&#20204;&#22914;&#20309;&#25552;&#20132;&#26080;&#20851;&#12290;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &#22914;&#26524;&#20320;&#35797;&#39564;&#36825;&#20010;&#25216;&#24039;&#26102;&#65292;&#20320;&#21487;&#33021;&#20250;&#27880;&#24847;&#21040;&#22823;&#22810;&#25968;&#27983;&#35272;&#22120;&#20250;&#22312;HTTP&#22836;&#37096;&#21253;&#25324;&#19968;&#20010;Referer&#20449;&#24687;&#20197;&#26631;&#35782;&#21069;&#19968;&#20010;&#39029;&#38754;&#30340;&#22320;&#22336;&#12290;&#22312;&#26412;&#20363;&#20013;&#65292;Referer&#30340;&#20540;&#26159;&#34920;&#21333;&#30340;URL&#22320;&#22336;&#12290;&#35831;&#19981;&#35201;&#34987;&#23427;&#25152;&#36855;&#24785;&#32780;&#29992;&#23427;&#26469;&#21306;&#20998;&#20320;&#30340;&#34920;&#21333;&#25552;&#20132;&#36824;&#26159;&#27450;&#39575;&#34920;&#21333;&#25552;&#20132;&#12290;&#22312;&#19979;&#19968;&#33410;&#30340;&#28436;&#31034;&#20013;&#65292;&#21487;&#20197;&#30475;&#21040;HTTP&#22836;&#37096;&#30340;&#20063;&#26159;&#38750;&#24120;&#23481;&#26131;&#20551;&#36896;&#30340;&#65292;&#32780;&#20351;&#29992;Referer&#26469;&#21028;&#23450;&#30340;&#26041;&#24335;&#21448;&#26159;&#20247;&#25152;&#21608;&#30693;&#30340;&#12290;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<hr noshade size=1 ><p style="line-height: 1.50;">&nbsp;</p>

</td></tr></table>

</body>
</html>
