<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>


   <title>3.1. &#35775;&#38382;&#26435;&#38480;&#26292;&#38706;</title>
   <meta name="generator" content="Help &amp; Manual" />
   <meta name="keywords" content="" />
   <meta http-equiv="Content-Type" content="text/html; charset=gb2312" />
   <meta http-equiv="Content-Style-Type" content="text/css" />
   <link type="text/css" href="default.css" rel="stylesheet" />
</head>
<body style="margin: 0px 0px 0px 0px; background: #FFFFFF;">


<table width="100%" border="0" cellspacing="0" cellpadding="5" bgcolor="#649CCC">
  <tr valign="middle">
    <td align="left">
      <p class="p_Heading1"><span class="f_Heading1">3.1. &#35775;&#38382;&#26435;&#38480;&#26292;&#38706;</span></p>

    </td>
    <td align="right">
     <span style="font-size: 9pt">
     <a href="introduction.htm">Top</a>&nbsp;
     <a href="new_item24.htm">Previous</a>&nbsp;
     <a href="new_item26.htm">Next</a>
     </span>
    </td>
  </tr>
</table>


<!-- Placeholder for topic body. -->
<table width="100%" border="0" cellspacing="0" cellpadding="5"><tr valign="top"><td align="left">
<p style="line-height: 1.50;">3.1. &#35775;&#38382;&#26435;&#38480;&#26292;&#38706;</p>
<p style="line-height: 1.50;">  &nbsp; &#25968;&#25454;&#24211;&#20351;&#29992;&#20013;&#38656;&#35201;&#20851;&#27880;&#30340;&#20027;&#35201;&#38382;&#39064;&#20043;&#19968;&#26159;&#35775;&#38382;&#26435;&#38480;&#21363;&#29992;&#25143;&#21517;&#21450;&#23494;&#30721;&#30340;&#26292;&#38706;&#12290;&#22312;&#32534;&#31243;&#20013;&#20026;&#20102;&#26041;&#20415;&#65292;&#19968;&#33324;&#37117;&#20250;&#29992;&#19968;&#20010;db.inc&#25991;&#20214;&#20445;&#23384;&#65292;&#22914;&#65306;</p>
<p style="line-height: 1.50;">CODE:</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">&lt;?php</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">$db_user = 'myuser';</p>
<p style="line-height: 1.50;">$db_pass = 'mypass';</p>
<p style="line-height: 1.50;">$db_host = '127.0.0.1';</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">$db = mysql_connect($db_host, $db_user, $db_pass);</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">?&gt;</p>
<p style="line-height: 1.50;">&#29992;&#25143;&#21517;&#21450;&#23494;&#30721;&#37117;&#26159;&#25935;&#24863;&#25968;&#25454;&#65292;&#26159;&#38656;&#35201;&#29305;&#21035;&#27880;&#24847;&#30340;&#12290;&#20182;&#20204;&#34987;&#20889;&#22312;&#28304;&#30721;&#20013;&#36896;&#25104;&#20102;&#39118;&#38505;&#65292;&#20294;&#36825;&#26159;&#19968;&#20010;&#26080;&#27861;&#36991;&#20813;&#30340;&#38382;&#39064;&#12290;&#22914;&#26524;&#19981;&#36825;&#20040;&#20570;&#65292;&#20320;&#30340;&#25968;&#25454;&#24211;&#23601;&#26080;&#27861;&#35774;&#32622;&#29992;&#25143;&#21517;&#21644;&#23494;&#30721;&#36827;&#34892;&#20445;&#25252;&#20102;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &#22914;&#26524;&#20320;&#35835;&#36807;http.conf&#65288;Apache&#30340;&#37197;&#32622;&#25991;&#20214;&#65289;&#30340;&#40664;&#35748;&#29256;&#26412;&#30340;&#35805;&#65292;&#20320;&#20250;&#21457;&#29616;&#40664;&#35748;&#30340;&#25991;&#20214;&#31867;&#22411;&#26159;text/plain&#65288;&#26222;&#36890;&#25991;&#26412;&#65289;&#12290;&#36825;&#26679;&#65292;&#22914;&#26524;db.inc&#36825;&#26679;&#30340;&#25991;&#20214;&#34987;&#20445;&#23384;&#22312;&#32593;&#31449;&#26681;&#30446;&#24405;&#19979;&#26102;&#65292;&#23601;&#24341;&#21457;&#20102;&#39118;&#38505;&#12290;&#25152;&#26377;&#20301;&#20110;&#32593;&#31449;&#26681;&#30446;&#24405;&#19979;&#30340;&#36164;&#28304;&#37117;&#26377;&#30456;&#24212;&#30340;URL&#65292;&#30001;&#20110;Apache&#27809;&#26377;&#23450;&#20041;&#23545;.inc&#21518;&#32512;&#30340;&#25991;&#20214;&#30340;&#22788;&#29702;&#26041;&#24335;&#31867;&#22411;&#65292;&#22312;&#23545;&#36825;&#19968;&#31867;&#25991;&#20214;&#36827;&#34892;&#35775;&#38382;&#26102;&#65292;&#20250;&#20197;&#26222;&#36890;&#25991;&#26412;&#30340;&#31867;&#22411;&#36827;&#34892;&#36820;&#22238;&#65288;&#40664;&#35748;&#31867;&#22411;&#65289;&#65292;&#36825;&#26679;&#35775;&#38382;&#26435;&#38480;&#23601;&#34987;&#26292;&#38706;&#22312;&#23458;&#25143;&#30340;&#27983;&#35272;&#22120;&#19978;&#20102;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &#20026;&#20102;&#36827;&#19968;&#27493;&#35828;&#26126;&#36825;&#20010;&#39118;&#38505;&#65292;&#32771;&#34385;&#19968;&#19979;&#19968;&#20010;&#20197;/www&#20026;&#32593;&#31449;&#26681;&#30446;&#24405;&#30340;&#26381;&#21153;&#22120;&#65292;&#22914;&#26524;db.inc&#34987;&#20445;&#23384;&#22312;/www/inc&#65292;&#23427;&#26377;&#20102;&#19968;&#20010;&#33258;&#24050;&#30340;URLhttp://example.org/inc/db.inc(&#20551;&#35774;example.org&#26159;&#20027;&#26426;&#22495;&#21517;)&#12290;&#36890;&#36807;&#35775;&#38382;&#35813;URL&#23601;&#21487;&#20197;&#30475;&#21040;db.inc&#20197;&#25991;&#26412;&#26041;&#24335;&#26174;&#31034;&#30340;&#28304;&#25991;&#20214;&#12290;&#26080;&#35770;&#20320;&#25226;&#35813;&#25991;&#20214;&#20445;&#23384;&#22312;/www&#21738;&#20010;&#23376;&#30446;&#24405;&#19979;&#65292;&#37117;&#26080;&#27861;&#36991;&#20813;&#35775;&#38382;&#26435;&#38480;&#26292;&#38706;&#30340;&#39118;&#38505;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &#23545;&#36825;&#20010;&#38382;&#39064;&#26368;&#22909;&#30340;&#35299;&#20915;&#26041;&#26696;&#26159;&#25226;&#23427;&#20445;&#23384;&#22312;&#32593;&#31449;&#26681;&#30446;&#24405;&#20197;&#22806;&#30340;&#21253;&#21547;&#30446;&#24405;&#20013;&#12290;&#20320;&#26080;&#38656;&#20026;&#20102;&#36798;&#21040;&#21253;&#21547;&#23427;&#20204;&#30340;&#30446;&#30340;&#32780;&#25226;&#23427;&#20204;&#25918;&#33267;&#22312;&#25991;&#20214;&#31995;&#32479;&#20013;&#30340;&#29305;&#23450;&#20301;&#32622;&#65292;&#25152;&#26377;&#21482;&#35201;&#20570;&#30340;&#21482;&#26159;&#20445;&#35777;Web&#26381;&#21153;&#22120;&#23545;&#20854;&#26377;&#35835;&#21462;&#26435;&#38480;&#12290;&#22240;&#27492;&#65292;&#25226;&#23427;&#20204;&#25918;&#22312;&#32593;&#31449;&#26681;&#30446;&#24405;&#19979;&#26159;&#27809;&#26377;&#24517;&#35201;&#30340;&#39118;&#38505;&#65292;&#21482;&#35201;&#21253;&#21547;&#25991;&#20214;&#36824;&#20301;&#20110;&#32593;&#31449;&#26681;&#30446;&#24405;&#19979;&#65292;&#20219;&#20309;&#20943;&#23569;&#39118;&#38505;&#30340;&#21162;&#21147;&#37117;&#26159;&#24466;&#21171;&#30340;&#12290;&#20107;&#23454;&#19978;&#65292;&#20320;&#21482;&#35201;&#25226;&#24517;&#39035;&#35201;&#36890;&#36807;URL&#35775;&#38382;&#30340;&#36164;&#28304;&#25918;&#32622;&#22312;&#32593;&#31449;&#26681;&#30446;&#24405;&#19979;&#21363;&#21487;&#12290;&#27605;&#31455;&#36825;&#26159;&#19968;&#20010;&#20844;&#20849;&#30340;&#30446;&#24405;&#12290;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &#21069;&#38754;&#30340;&#35805;&#39064;&#23545;&#20110;SQLite&#25968;&#25454;&#24211;&#20063;&#26377;&#29992;&#12290;&#25226;&#25968;&#25454;&#24211;&#20445;&#23384;&#22312;&#24403;&#21069;&#30446;&#24405;&#19979;&#26159;&#38750;&#24120;&#26041;&#20415;&#30340;&#65292;&#22240;&#20026;&#20320;&#21482;&#35201;&#35843;&#29992;&#25991;&#20214;&#21517;&#32780;&#26080;&#38656;&#25351;&#23450;&#36335;&#24452;&#12290;&#20294;&#26159;&#65292;&#25226;&#25968;&#25454;&#24211;&#20445;&#23384;&#22312;&#32593;&#31449;&#26681;&#30446;&#24405;&#19979;&#23601;&#20195;&#34920;&#30528;&#19981;&#24517;&#35201;&#30340;&#39118;&#38505;&#12290;&#22914;&#26524;&#20320;&#27809;&#26377;&#37319;&#29992;&#23433;&#20840;&#25514;&#26045;&#38450;&#27490;&#30452;&#25509;&#35775;&#38382;&#30340;&#35805;&#65292;&#20320;&#30340;&#25968;&#25454;&#24211;&#23601;&#21361;&#38505;&#20102;&#12290;</p>
<p style="line-height: 1.50;">&#22914;&#26524;&#30001;&#20110;&#22806;&#37096;&#22240;&#32032;&#23548;&#33268;&#26080;&#27861;&#20570;&#21040;&#25226;&#25152;&#26377;&#21253;&#21547;&#25991;&#20214;&#25918;&#22312;&#32593;&#31449;&#26681;&#30446;&#24405;&#20043;&#22806;&#65292;&#20320;&#21487;&#20197;&#22312;Apache&#37197;&#32622;&#25104;&#25298;&#32477;&#23545;.inc&#36164;&#28304;&#30340;&#35831;&#27714;&#12290;</p>
<p style="line-height: 1.50;">CODE:</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">&lt;Files ~ "\.inc$"&gt;</p>
<p style="line-height: 1.50;">  &nbsp; Order allow,deny</p>
<p style="line-height: 1.50;">  &nbsp; Deny from all</p>
<p style="line-height: 1.50;">&lt;/Files&gt;</p>
<p style="line-height: 1.50;">&#35793;&#27880;&#65306;&#22914;&#26524;&#21482;&#26159;&#22240;&#20026;&#35201;&#20030;&#20010;&#20363;&#23376;&#32780;&#36825;&#20040;&#20889;&#30340;&#35805;&#65292;&#21487;&#20197;&#29702;&#35299;&#65292;&#27605;&#31455;&#22823;&#23478;&#23398;&#21040;&#20102;&#19968;&#20123;&#25163;&#27573;&#65292;&#20294;&#36825;&#20010;&#20363;&#23376;&#26410;&#20813;&#29983;&#30828;&#20102;&#19968;&#28857;&#12290;&#23454;&#38469;&#19978;&#21482;&#35201;&#25226;&#35813;&#25991;&#20214;&#26356;&#21517;&#20026;db.inc.php&#23601;&#21487;&#20197;&#20102;&#12290;&#23601;&#22909;&#35937;&#25151;&#23376;&#30772;&#20102;&#20010;&#27934;&#32780;&#19981;&#21435;&#20462;&#34917;&#65292;&#21364;&#22312;&#22806;&#38754;&#21435;&#36896;&#19968;&#20010;&#26356;&#22823;&#30340;&#25151;&#23376;&#25226;&#30772;&#25151;&#23376;&#22871;&#36215;&#26469;&#19968;&#26679;&#12290;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &#22312;&#31532;8&#31456;&#20013;&#20320;&#36824;&#21487;&#20197;&#30475;&#21040;&#21478;&#22806;&#19968;&#31181;&#38450;&#27490;&#25968;&#25454;&#24211;&#35775;&#38382;&#26435;&#38480;&#26292;&#38706;&#30340;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#23545;&#20110;&#20849;&#20139;&#26381;&#21153;&#22120;&#29615;&#22659;&#65288;&#22312;&#35813;&#29615;&#22659;&#19979;&#23613;&#31649;&#25991;&#20214;&#20301;&#20110;&#32593;&#31449;&#26681;&#30446;&#24405;&#20043;&#22806;&#65292;&#20294;&#20381;&#28982;&#23384;&#22312;&#26292;&#38706;&#30340;&#39118;&#38505;&#65289;&#38750;&#24120;&#26377;&#25928;&#12290;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<hr noshade size=1 ><p style="line-height: 1.50;">&nbsp;</p>

</td></tr></table>

</body>
</html>
