<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>


   <title>8.1. &#28304;&#30721;&#26292;&#38706;</title>
   <meta name="generator" content="Help &amp; Manual" />
   <meta name="keywords" content="" />
   <meta http-equiv="Content-Type" content="text/html; charset=gb2312" />
   <meta http-equiv="Content-Style-Type" content="text/css" />
   <link type="text/css" href="default.css" rel="stylesheet" />
</head>
<body style="margin: 0px 0px 0px 0px; background: #FFFFFF;">


<table width="100%" border="0" cellspacing="0" cellpadding="5" bgcolor="#649CCC">
  <tr valign="middle">
    <td align="left">
      <p class="p_Heading1"><span class="f_Heading1">8.1. &#28304;&#30721;&#26292;&#38706;</span></p>

    </td>
    <td align="right">
     <span style="font-size: 9pt">
     <a href="introduction.htm">Top</a>&nbsp;
     <a href="new_item47.htm">Previous</a>&nbsp;
     <a href="new_item49.htm">Next</a>
     </span>
    </td>
  </tr>
</table>


<!-- Placeholder for topic body. -->
<table width="100%" border="0" cellspacing="0" cellpadding="5"><tr valign="top"><td align="left">
<p style="line-height: 1.50;">8.1. &#28304;&#30721;&#26292;&#38706;</p>
<p style="line-height: 1.50;">  &nbsp; &#20320;&#30340;WEB&#26381;&#21153;&#22120;&#24517;&#39035;&#35201;&#33021;&#22815;&#35835;&#21462;&#20320;&#30340;&#28304;&#30830;&#24182;&#25191;&#34892;&#23427;&#65292;&#36825;&#23601;&#24847;&#21619;&#30528;&#20219;&#24847;&#20154;&#25152;&#20889;&#30340;&#20195;&#30721;&#34987;&#26381;&#21153;&#22120;&#36816;&#34892;&#26102;&#65292;&#23427;&#21516;&#26679;&#21487;&#20197;&#35835;&#21462;&#20320;&#30340;&#28304;&#30721;&#12290;&#22312;&#19968;&#20010;&#20849;&#20139;&#20027;&#26426;&#19978;&#65292;&#26368;&#22823;&#30340;&#39118;&#38505;&#26159;&#30001;&#20110;WEB&#26381;&#21153;&#22120;&#26159;&#20849;&#20139;&#30340;&#65292;&#22240;&#27492;&#20854;&#23427;&#24320;&#21457;&#32773;&#25152;&#20889;&#30340;PHP&#20195;&#30721;&#21487;&#20197;&#35835;&#21462;&#20219;&#24847;&#25991;&#20214;&#12290;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &lt;?php</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; header('Content-Type: text/plain');</p>
<p style="line-height: 1.50;">  &nbsp; readfile($_GET['file']);</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; ?&gt;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &#36890;&#36807;&#22312;&#20320;&#30340;&#28304;&#30721;&#25152;&#22312;&#30340;&#20027;&#26426;&#19978;&#36816;&#34892;&#19978;&#38754;&#33050;&#26412;&#65292;&#25915;&#20987;&#32773;&#21487;&#20197;&#36890;&#36807;&#25226;file&#30340;&#20540;&#25351;&#23450;&#20026;&#23436;&#25972;&#30340;&#36335;&#24452;&#21644;&#25991;&#20214;&#21517;&#26469;&#20351;WEB&#26381;&#21153;&#22120;&#35835;&#21462;&#24182;&#26174;&#31034;&#20219;&#20309;&#25991;&#20214;&#12290;&#20363;&#22914;&#65292;&#20551;&#23450;&#35813;&#33050;&#26412;&#21629;&#21517;&#20026;file.php&#65292;&#20301;&#20110;&#20027;&#26426;example.org&#19978;&#65292;&#21482;&#35201;&#36890;&#36807;&#35775;&#38382;&#19979;&#38754;&#38142;&#25509;&#21363;&#21487;&#20351;&#25991;&#20214;/path/to/source.php&#30340;&#20869;&#23481;&#26292;&#38706;&#65306;</p>
<p style="line-height: 1.50;">http://example.org/file.php?file=/path/to/source.php</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &#24403;&#28982;&#65292;&#35201;&#20351;&#36825;&#27573;&#31616;&#21333;&#30340;&#20195;&#30721;&#36215;&#20316;&#29992;&#65292;&#25915;&#20987;&#32773;&#24517;&#39035;&#30830;&#20999;&#22320;&#30693;&#36947;&#20320;&#30340;&#28304;&#30721;&#30340;&#20301;&#32622;&#65292;&#20294;&#26159;&#25915;&#20987;&#32773;&#21487;&#20197;&#20889;&#20986;&#26356;&#22797;&#26434;&#30340;&#33050;&#26412;&#65292;&#36890;&#36807;&#23427;&#21487;&#20197;&#26041;&#20415;&#22312;&#27983;&#35272;&#25972;&#20010;&#25991;&#20214;&#31995;&#32479;&#12290;&#20851;&#20110;&#27492;&#31867;&#33050;&#26412;&#65292;&#35831;&#30475;&#26412;&#31456;&#21518;&#38754;&#37096;&#20998;&#30340;&#31034;&#20363;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &#23545;&#35813;&#38382;&#39064;&#27809;&#26377;&#23436;&#32654;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;&#27491;&#22914;&#31532;&#20116;&#31456;&#25152;&#36848;&#65292;&#20320;&#24517;&#39035;&#32771;&#34385;&#25152;&#26377;&#20320;&#30340;&#28304;&#30721;&#37117;&#26159;&#20844;&#24320;&#30340;&#65292;&#29978;&#33267;&#26159;&#20445;&#23384;&#22312;WEB&#20027;&#30446;&#24405;&#20043;&#22806;&#30340;&#20195;&#30721;&#20063;&#26159;&#22914;&#27492;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &#26368;&#22909;&#30340;&#21150;&#27861;&#26159;&#25226;&#25152;&#26377;&#25935;&#24863;&#25968;&#25454;&#20445;&#23384;&#22312;&#25968;&#25454;&#24211;&#20013;&#12290;&#34429;&#28982;&#36825;&#20351;&#19968;&#20123;&#20195;&#30721;&#30340;&#32534;&#20889;&#22810;&#20102;&#19968;&#23618;&#22797;&#26434;&#24615;&#65292;&#20294;&#36825;&#26159;&#38450;&#27490;&#20320;&#30340;&#25935;&#24863;&#25968;&#25454;&#26292;&#38706;&#30340;&#26368;&#22909;&#26041;&#27861;&#12290;&#24456;&#19981;&#24184;&#30340;&#26159;&#65292;&#36824;&#26377;&#19968;&#20010;&#38382;&#39064;&#12290;&#22914;&#20309;&#20445;&#23384;&#20320;&#30340;&#25968;&#25454;&#24211;&#35775;&#38382;&#23494;&#30721;&#65311;</p>
<p style="line-height: 1.50;">  &nbsp; &#35831;&#30475;&#20445;&#23384;&#22312;&#32593;&#31449;&#20027;&#30446;&#24405;&#20043;&#22806;&#19968;&#20010;&#21517;&#20026;db.inc&#30340;&#25991;&#20214;&#65306;</p>
<p style="line-height: 1.50;">  &nbsp; &lt;?php</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; $db_user = 'myuser';</p>
<p style="line-height: 1.50;">  &nbsp; $db_pass = 'mypass';</p>
<p style="line-height: 1.50;">  &nbsp; $db_host = 'localhost';</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; $db = mysql_connect($db_host, $db_user, $db_pass);</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; ?&gt;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &#22914;&#26524;&#35813;&#25991;&#20214;&#30340;&#36335;&#24452;&#26159;&#24050;&#30693;&#30340;&#65288;&#25110;&#34987;&#29468;&#20013;&#65289;&#65292;&#23601;&#23384;&#22312;&#30528;&#20320;&#30340;&#26381;&#21153;&#22120;&#19978;&#30340;&#21478;&#22806;&#19968;&#20010;&#29992;&#25143;&#35775;&#38382;&#35813;&#25991;&#20214;&#30340;&#21487;&#33021;&#65292;&#23601;&#20250;&#33719;&#21462;&#25968;&#25454;&#24211;&#35775;&#38382;&#26435;&#38480;&#65292;&#36825;&#26679;&#20320;&#20445;&#23384;&#22312;&#25968;&#25454;&#24211;&#20013;&#30340;&#25152;&#26377;&#25968;&#25454;&#23601;&#20250;&#26292;&#38706;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &#35299;&#20915;&#35813;&#38382;&#39064;&#30340;&#26368;&#22909;&#26041;&#26696;&#26159;&#25226;&#20320;&#30340;&#25968;&#25454;&#24211;&#35775;&#38382;&#26435;&#38480;&#20197;&#19979;&#38754;&#30340;&#26684;&#24335;&#20445;&#23384;&#22312;&#19968;&#20010;&#21482;&#26377;&#31995;&#32479;&#31649;&#29702;&#21592;&#26435;&#38480;&#25165;&#33021;&#35835;&#21462;&#30340;&#25991;&#20214;&#20013;&#65306;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; SetEnv DB_USER "myuser"</p>
<p style="line-height: 1.50;">  &nbsp; SetEnv DB_PASS "mypass"</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; SetEnv&#26159;&#19968;&#20010;Apache&#30340;&#25351;&#20196;&#65292;&#19978;&#38754;&#25991;&#20214;&#30340;&#24847;&#24605;&#26159;&#24314;&#31435;&#20004;&#20010;&#20998;&#21035;&#20195;&#34920;&#20320;&#30340;&#25968;&#25454;&#24211;&#29992;&#25143;&#21517;&#21450;&#23494;&#30721;&#30340;Apache&#29615;&#22659;&#21464;&#37327;&#12290;&#24403;&#28982;&#65292;&#35813;&#25216;&#24039;&#30340;&#20851;&#38190;&#26159;&#21482;&#26377;&#31995;&#32479;&#31649;&#29702;&#21592;&#25165;&#33021;&#35835;&#21462;&#35813;&#25991;&#20214;&#12290;&#22914;&#26524;&#20320;&#26080;&#27861;&#30331;&#24405;&#25104;&#20026;&#31995;&#32479;&#31649;&#29702;&#21592;&#65292;&#20320;&#23601;&#21487;&#20197;&#38480;&#21046;&#35813;&#25991;&#20214;&#21482;&#33021;&#30001;&#20320;&#33258;&#24050;&#36827;&#34892;&#35835;&#21462;&#65292;&#36825;&#26679;&#30340;&#20445;&#25252;&#26041;&#24335;&#19982;&#19978;&#38754;&#30340;&#26041;&#24335;&#31867;&#20284;&#12290;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; $ chmod 600 db.conf</p>
<p style="line-height: 1.50;">  &nbsp; $ ls db.conf</p>
<p style="line-height: 1.50;">  &nbsp; -rw------- &nbsp;1 chris chris 48 May 21 12:34 db.conf</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &#36825;&#23601;&#26377;&#25928;&#22320;&#38450;&#27490;&#20102;&#24694;&#24847;&#33050;&#26412;&#35775;&#38382;&#20320;&#30340;&#25968;&#25454;&#20013;&#26435;&#38480;&#65292;&#22240;&#27492;&#23545;&#20110;&#25968;&#25454;&#24211;&#20013;&#20445;&#23384;&#30340;&#25935;&#24863;&#25968;&#25454;&#26469;&#35828;&#65292;&#19981;&#20250;&#26377;&#21361;&#21450;&#23433;&#20840;&#30340;&#37325;&#22823;&#39118;&#38505;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &#20026;&#20351;&#35813;&#25991;&#20214;&#29983;&#25928;&#65292;&#20320;&#23601;&#38656;&#35201;&#33021;&#22815;&#36890;&#36807;PHP&#35775;&#38382;&#20854;&#20013;&#30340;&#25968;&#25454;&#12290;&#35201;&#36798;&#21040;&#36825;&#20010;&#30446;&#30340;&#65292;&#38656;&#35201;&#22312;httpd.conf&#20013;&#20889;&#19978;&#22914;&#19979;&#30340;&#21253;&#21547;&#21477;&#65306;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; Include "/path/to/db.conf"</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &#38656;&#35201;&#27880;&#24847;&#35813;&#35821;&#21477;&#38656;&#35201;&#25554;&#20837;&#22312;VirtualHost&#21306;&#22495;&#20869;&#65292;&#21542;&#21017;&#20854;&#23427;&#29992;&#25143;&#23601;&#33021;&#21462;&#24471;&#30456;&#24212;&#30340;&#20869;&#23481;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &#30001;&#20110;Apache&#30340;&#29238;&#36827;&#31243;&#20197;&#31995;&#32479;&#31649;&#29702;&#21592;&#36523;&#20221;&#36816;&#34892;&#65288;&#38656;&#35201;&#32465;&#23450;&#22312;80&#31471;&#21475;&#65289;&#65292;&#23427;&#33021;&#22815;&#35835;&#21462;&#35813;&#37197;&#32622;&#25991;&#20214;&#65292;&#20294;&#22788;&#29702;&#26381;&#21153;&#22120;&#35831;&#27714;&#30340;&#23376;&#36827;&#31243;&#65288;&#36816;&#34892;PHP&#33050;&#26412;&#65289;&#19981;&#33021;&#35835;&#21462;&#35813;&#25991;&#20214;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &#20320;&#21487;&#20197;&#36890;&#36807;$_SERVER&#36229;&#32423;&#20840;&#23616;&#25968;&#32452;&#21435;&#35775;&#38382;&#36825;&#20004;&#20010;&#21464;&#37327;&#65292;&#36825;&#26679;&#22312;db.inc&#20013;&#65292;&#21482;&#35201;&#36890;&#36807;&#24341;&#29992;$_SERVER&#21464;&#37327;&#21363;&#21487;&#65292;&#32780;&#19981;&#26159;&#22312;&#20854;&#20013;&#20889;&#26126;&#25968;&#25454;&#24211;&#30340;&#26435;&#38480;&#65306;</p>
<p style="line-height: 1.50;">  &nbsp; &lt;?php</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; $db_user = $_SERVER['DB_USER'];</p>
<p style="line-height: 1.50;">  &nbsp; $db_pass = $_SERVER['DB_PASS'];</p>
<p style="line-height: 1.50;">  &nbsp; $db_host = 'localhost';</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; $db = mysql_connect($db_host, $db_user, $db_pass);</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; ?&gt;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &#22914;&#26524;&#35813;&#25991;&#20214;&#34987;&#26292;&#38706;&#65292;&#25968;&#25454;&#24211;&#35775;&#38382;&#26435;&#20063;&#19981;&#20250;&#27844;&#38706;&#12290;&#36825;&#23545;&#20110;&#20849;&#20139;&#20027;&#26426;&#26159;&#19968;&#22823;&#23433;&#20840;&#24615;&#25913;&#36827;&#65292;&#21516;&#26102;&#23545;&#20110;&#29420;&#31435;&#20027;&#26426;&#20063;&#26159;&#19968;&#31181;&#28145;&#24230;&#38450;&#33539;&#25163;&#27573;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &#27880;&#24847;&#22312;&#20351;&#29992;&#19978;&#36848;&#25216;&#24039;&#26102;&#65292;&#25968;&#25454;&#24211;&#35775;&#38382;&#26435;&#38480;&#23601;&#20301;&#20110;$_SERVER&#36229;&#32423;&#20844;&#29992;&#25968;&#32452;&#20013;&#12290;&#36825;&#23601;&#38656;&#35201;&#21516;&#26102;&#38480;&#21046;&#26222;&#36890;&#35775;&#38382;&#32773;&#36816;&#34892;phpinfo()&#23519;&#30475;&#25110;&#20854;&#23427;&#20219;&#20309;&#23548;&#33268;$_SERVER&#20869;&#23481;&#26292;&#38706;&#30340;&#21407;&#22240;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &#24403;&#28982;&#65292;&#20320;&#21487;&#20197;&#20351;&#29992;&#26412;&#25216;&#24039;&#20445;&#25252;&#20219;&#20309;&#20449;&#24687;&#65288;&#19981;&#21482;&#26159;&#25968;&#25454;&#24211;&#35775;&#38382;&#26435;&#38480;&#65289;&#65292;&#20294;&#25105;&#21457;&#29616;&#25226;&#22823;&#22810;&#25968;&#25968;&#25454;&#20445;&#23384;&#22312;&#25968;&#25454;&#24211;&#26356;&#20026;&#26041;&#20415;&#65292;&#29305;&#21035;&#26159;&#30001;&#20110;&#35813;&#25216;&#24039;&#38656;&#35201;&#24471;&#21040;&#20320;&#30340;&#20027;&#26426;&#25552;&#20379;&#21830;&#30340;&#21327;&#21161;&#12290;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<hr noshade size=1 ><p style="line-height: 1.50;">&nbsp;</p>

</td></tr></table>

</body>
</html>
