<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>


   <title>1.3.4. &#36755;&#20986;&#36716;&#20041;</title>
   <meta name="generator" content="Help &amp; Manual" />
   <meta name="keywords" content="" />
   <meta http-equiv="Content-Type" content="text/html; charset=gb2312" />
   <meta http-equiv="Content-Style-Type" content="text/css" />
   <link type="text/css" href="default.css" rel="stylesheet" />
</head>
<body style="margin: 0px 0px 0px 0px; background: #FFFFFF;">


<table width="100%" border="0" cellspacing="0" cellpadding="5" bgcolor="#649CCC">
  <tr valign="middle">
    <td align="left">
      <p class="p_Heading1"><span class="f_Heading1">1.3.4. &#36755;&#20986;&#36716;&#20041;</span></p>

    </td>
    <td align="right">
     <span style="font-size: 9pt">
     <a href="introduction.htm">Top</a>&nbsp;
     <a href="new_item14.htm">Previous</a>&nbsp;
     <a href="new_item16.htm">Next</a>
     </span>
    </td>
  </tr>
</table>


<!-- Placeholder for topic body. -->
<table width="100%" border="0" cellspacing="0" cellpadding="5"><tr valign="top"><td align="left">
<p style="line-height: 1.50;">1.3.4. &#36755;&#20986;&#36716;&#20041;</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; &nbsp;&#21478;&#22806;&#19968;&#20010;Web&#24212;&#29992;&#23433;&#20840;&#30340;&#22522;&#30784;&#26159;&#23545;&#36755;&#20986;&#36827;&#34892;&#36716;&#20041;&#25110;&#23545;&#29305;&#27530;&#23383;&#31526;&#36827;&#34892;&#32534;&#30721;&#65292;&#20197;&#20445;&#35777;&#21407;&#24847;&#19981;&#21464;&#12290;&#20363;&#22914;&#65292;O'Reilly&#22312;&#20256;&#36865;&#32473;MySQL&#25968;&#25454;&#24211;&#21069;&#38656;&#35201;&#36716;&#20041;&#25104;O\'Reilly&#12290;&#21333;&#24341;&#21495;&#21069;&#30340;&#21453;&#26012;&#26464;&#20195;&#34920;&#21333;&#24341;&#21495;&#26159;&#25968;&#25454;&#26412;&#36523;&#30340;&#19968;&#37096;&#20998;&#65292;&#32780;&#19981;&#26159;&#24182;&#19981;&#26159;&#23427;&#30340;&#26412;&#20041;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; &nbsp;&#25105;&#25152;&#25351;&#30340;&#36755;&#20986;&#36716;&#20041;&#20855;&#20307;&#20998;&#20026;&#19977;&#27493;&#65306;</p>
<p style="line-height: 1.50;">l &nbsp; &nbsp; &nbsp; &nbsp;&#35782;&#21035;&#36755;&#20986;</p>
<p style="line-height: 1.50;">l &nbsp; &nbsp; &nbsp; &nbsp;&#36755;&#20986;&#36716;&#20041;</p>
<p style="line-height: 1.50;">l &nbsp; &nbsp; &nbsp; &nbsp;&#21306;&#20998;&#24050;&#36716;&#20041;&#19982;&#26410;&#36716;&#20041;&#25968;&#25454;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; &#21482;&#23545;&#24050;&#36807;&#28388;&#25968;&#25454;&#36827;&#34892;&#36716;&#20041;&#26159;&#24456;&#26377;&#24517;&#35201;&#30340;&#12290;&#23613;&#31649;&#36716;&#20041;&#33021;&#38450;&#27490;&#24456;&#22810;&#24120;&#35265;&#23433;&#20840;&#28431;&#27934;&#65292;&#20294;&#23427;&#19981;&#33021;&#26367;&#20195;&#36755;&#20837;&#36807;&#28388;&#12290;&#34987;&#27745;&#26579;&#25968;&#25454;&#24517;&#39035;&#39318;&#20808;&#36807;&#28388;&#28982;&#21518;&#36716;&#20041;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; &#22312;&#23545;&#36755;&#20986;&#36827;&#34892;&#36716;&#20041;&#26102;&#65292;&#20320;&#24517;&#39035;&#20808;&#35782;&#21035;&#36755;&#20986;&#12290;&#36890;&#24120;&#65292;&#36825;&#35201;&#27604;&#35782;&#21035;&#36755;&#20837;&#31616;&#21333;&#24471;&#22810;&#65292;&#22240;&#20026;&#23427;&#20381;&#36182;&#20110;&#20320;&#25152;&#36827;&#34892;&#30340;&#21160;&#20316;&#12290;&#20363;&#22914;&#65292;&#35782;&#21035;&#21040;&#23458;&#25143;&#31471;&#30340;&#36755;&#20986;&#26102;&#65292;&#20320;&#21487;&#20197;&#22312;&#20195;&#30721;&#20013;&#26597;&#25214;&#19979;&#21015;&#35821;&#21477;&#65306;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">echo</p>
<p style="line-height: 1.50;">print</p>
<p style="line-height: 1.50;">printf</p>
<p style="line-height: 1.50;">&lt;?=</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; &nbsp;&#20316;&#20026;&#19968;&#39033;&#24212;&#29992;&#30340;&#24320;&#21457;&#32773;&#65292;&#20320;&#24517;&#39035;&#30693;&#36947;&#27599;&#19968;&#20010;&#21521;&#22806;&#37096;&#31995;&#32479;&#36755;&#20986;&#30340;&#22320;&#26041;&#12290;&#23427;&#20204;&#26500;&#25104;&#20102;&#36755;&#20986;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; &nbsp;&#35937;&#36807;&#28388;&#19968;&#26679;&#65292;&#36716;&#20041;&#36807;&#31243;&#22312;&#20381;&#24773;&#24418;&#30340;&#19981;&#21516;&#32780;&#19981;&#21516;&#12290;&#36807;&#28388;&#23545;&#20110;&#19981;&#21516;&#31867;&#22411;&#30340;&#25968;&#25454;&#22788;&#29702;&#26041;&#27861;&#20063;&#26159;&#19981;&#21516;&#30340;&#65292;&#36716;&#20041;&#20063;&#26159;&#26681;&#25454;&#20320;&#20256;&#36755;&#20449;&#24687;&#21040;&#19981;&#21516;&#30340;&#31995;&#32479;&#32780;&#37319;&#29992;&#19981;&#21516;&#30340;&#26041;&#27861;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; &nbsp;&#23545;&#20110;&#19968;&#20123;&#24120;&#35265;&#30340;&#36755;&#20986;&#30446;&#26631;&#65288;&#21253;&#25324;&#23458;&#25143;&#31471;&#12289;&#25968;&#25454;&#24211;&#21644;URL&#65289;&#30340;&#36716;&#20041;&#65292;PHP&#20013;&#26377;&#20869;&#32622;&#20989;&#25968;&#21487;&#29992;&#12290;&#22914;&#26524;&#20320;&#35201;&#20889;&#19968;&#20010;&#33258;&#24049;&#31639;&#27861;&#65292;&#20570;&#21040;&#19975;&#26080;&#19968;&#22833;&#24456;&#37325;&#35201;&#12290;&#38656;&#35201;&#25214;&#21040;&#22312;&#22806;&#31995;&#32479;&#20013;&#29305;&#27530;&#23383;&#31526;&#30340;&#21487;&#38752;&#21644;&#23436;&#25972;&#30340;&#21015;&#34920;&#65292;&#20197;&#21450;&#23427;&#20204;&#30340;&#34920;&#31034;&#26041;&#24335;&#65292;&#36825;&#26679;&#25968;&#25454;&#26159;&#34987;&#20445;&#30041;&#19979;&#26469;&#32780;&#19981;&#26159;&#36716;&#35793;&#20102;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; &nbsp;&#26368;&#24120;&#35265;&#30340;&#36755;&#20986;&#30446;&#26631;&#26159;&#23458;&#25143;&#26426;&#65292;&#20351;&#29992;htmlentities( )&#22312;&#25968;&#25454;&#21457;&#20986;&#21069;&#36827;&#34892;&#36716;&#20041;&#26159;&#26368;&#22909;&#30340;&#26041;&#27861;&#12290;&#19982;&#20854;&#23427;&#23383;&#31526;&#20018;&#20989;&#25968;&#19968;&#26679;&#65292;&#23427;&#36755;&#20837;&#26159;&#19968;&#20010;&#23383;&#31526;&#20018;&#65292;&#23545;&#20854;&#36827;&#34892;&#21152;&#24037;&#21518;&#36827;&#34892;&#36755;&#20986;&#12290;&#20294;&#26159;&#20351;&#29992;htmlentities( )&#20989;&#25968;&#30340;&#26368;&#20339;&#26041;&#24335;&#26159;&#25351;&#23450;&#23427;&#30340;&#20004;&#20010;&#21487;&#36873;&#21442;&#25968;&#65306;&#24341;&#21495;&#30340;&#36716;&#20041;&#26041;&#24335;&#65288;&#31532;&#20108;&#21442;&#25968;&#65289;&#21450;&#23383;&#31526;&#38598;&#65288;&#31532;&#19977;&#21442;&#25968;&#65289;&#12290;&#24341;&#21495;&#30340;&#36716;&#20041;&#26041;&#24335;&#24212;&#35813;&#25351;&#23450;&#20026;ENT_QUOTES&#65292;&#23427;&#30340;&#30446;&#30340;&#26159;&#21516;&#26102;&#36716;&#20041;&#21333;&#24341;&#21495;&#21644;&#21452;&#24341;&#21495;&#65292;&#36825;&#26679;&#20570;&#26159;&#26368;&#24443;&#24213;&#30340;&#65292;&#23383;&#31526;&#38598;&#21442;&#25968;&#24517;&#39035;&#19982;&#35813;&#39029;&#38754;&#25152;&#20351;&#29992;&#30340;&#23383;&#31526;&#38598;&#30456;&#24517;&#37197;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; &#20026;&#20102;&#21306;&#20998;&#25968;&#25454;&#26159;&#21542;&#24050;&#36716;&#20041;&#65292;&#25105;&#36824;&#26159;&#24314;&#35758;&#23450;&#20041;&#19968;&#20010;&#21629;&#21517;&#26426;&#21046;&#12290;&#23545;&#20110;&#36755;&#20986;&#21040;&#23458;&#25143;&#26426;&#30340;&#36716;&#20041;&#25968;&#25454;&#65292;&#25105;&#20351;&#29992;$html&#25968;&#32452;&#36827;&#34892;&#23384;&#20648;&#65292;&#35813;&#25968;&#25454;&#39318;&#20808;&#21021;&#22987;&#21270;&#25104;&#19968;&#20010;&#31354;&#25968;&#32452;&#65292;&#23545;&#25152;&#26377;&#24050;&#36807;&#28388;&#21644;&#24050;&#36716;&#20041;&#25968;&#25454;&#36827;&#34892;&#20445;&#23384;&#12290;</p>
<p style="line-height: 1.50;">CODE:</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">&lt;?php</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; $html = array( &nbsp;);</p>
<p style="line-height: 1.50;">  &nbsp; $html['username'] = htmlentities($clean['username'], ENT_QUOTES, 'UTF-8');</p>
<p style="line-height: 1.50;">  &nbsp; echo "&lt;p&gt;Welcome back, {$html['username']}.&lt;/p&gt;";</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; ?&gt;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;"><span style="font-weight: bold;">&#23567;&#25552;&#31034;</span></p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; &nbsp;htmlspecialchars( )&#20989;&#25968;&#19982;htmlentities( )&#20989;&#25968;&#22522;&#26412;&#30456;&#21516;&#65292;&#23427;&#20204;&#30340;&#21442;&#25968;&#23450;&#20041;&#23436;&#20840;&#30456;&#21516;&#65292;&#21482;&#19981;&#36807;&#26159;htmlentities( )&#30340;&#36716;&#20041;&#26356;&#20026;&#24443;&#24213;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; &nbsp;&#36890;&#36807;$html['username']&#25226;username&#36755;&#20986;&#21040;&#23458;&#25143;&#31471;&#65292;&#20320;&#23601;&#21487;&#20197;&#30830;&#20445;&#20854;&#20013;&#30340;&#29305;&#27530;&#23383;&#31526;&#19981;&#20250;&#34987;&#27983;&#35272;&#22120;&#25152;&#38169;&#35823;&#35299;&#37322;&#12290;&#22914;&#26524;username&#21482;&#21253;&#21547;&#23383;&#27597;&#21644;&#25968;&#23383;&#30340;&#35805;&#65292;&#23454;&#38469;&#19978;&#36716;&#20041;&#26159;&#27809;&#26377;&#24517;&#35201;&#30340;&#65292;&#20294;&#26159;&#36825;&#20307;&#29616;&#20102;&#28145;&#24230;&#38450;&#33539;&#30340;&#21407;&#21017;&#12290;&#36716;&#20041;&#20219;&#20309;&#30340;&#36755;&#20986;&#26159;&#19968;&#20010;&#38750;&#24120;&#22909;&#30340;&#20064;&#24815;&#65292;&#23427;&#21487;&#20197;&#25103;&#21095;&#24615;&#22320;&#25552;&#39640;&#20320;&#30340;&#36719;&#20214;&#30340;&#23433;&#20840;&#24615;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; &nbsp;&#21478;&#22806;&#19968;&#20010;&#24120;&#35265;&#30340;&#36755;&#20986;&#30446;&#26631;&#26159;&#25968;&#25454;&#24211;&#12290;&#22914;&#26524;&#21487;&#33021;&#30340;&#35805;&#65292;&#20320;&#38656;&#35201;&#23545;SQL&#35821;&#21477;&#20013;&#30340;&#25968;&#25454;&#20351;&#29992;PHP&#20869;&#24314;&#20989;&#25968;&#36827;&#34892;&#36716;&#20041;&#12290;&#23545;&#20110;MySQL&#29992;&#25143;&#65292;&#26368;&#22909;&#30340;&#36716;&#20041;&#20989;&#25968;&#26159;mysql_real_escape_string( )&#12290;&#22914;&#26524;&#20320;&#20351;&#29992;&#30340;&#25968;&#25454;&#24211;&#27809;&#26377;PHP&#20869;&#24314;&#36716;&#20041;&#20989;&#25968;&#21487;&#29992;&#30340;&#35805;&#65292;addslashes( )&#26159;&#26368;&#21518;&#30340;&#36873;&#25321;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; &nbsp;&#19979;&#38754;&#30340;&#20363;&#23376;&#35828;&#26126;&#20102;&#23545;&#20110;MySQL&#25968;&#25454;&#24211;&#30340;&#27491;&#30830;&#30340;&#36716;&#20041;&#25216;&#24039;&#65306;</p>
<p style="line-height: 1.50;">CODE:</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &lt;?php</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; $mysql = array( &nbsp;);</p>
<p style="line-height: 1.50;">  &nbsp; $mysql['username'] = mysql_real_escape_string($clean['username']);</p>
<p style="line-height: 1.50;">  &nbsp; $sql = "SELECT *</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; FROM &nbsp; profile</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; WHERE &nbsp;username = '{$mysql['username']}'";</p>
<p style="line-height: 1.50;">  &nbsp; $result = mysql_query($sql);</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; ?&gt;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<hr noshade size=1 ><p style="line-height: 1.50;">&nbsp;</p>

</td></tr></table>

</body>
</html>
