<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>


   <title>2.2. &#35821;&#20041;URL&#25915;&#20987;</title>
   <meta name="generator" content="Help &amp; Manual" />
   <meta name="keywords" content="" />
   <meta http-equiv="Content-Type" content="text/html; charset=gb2312" />
   <meta http-equiv="Content-Style-Type" content="text/css" />
   <link type="text/css" href="default.css" rel="stylesheet" />
</head>
<body style="margin: 0px 0px 0px 0px; background: #FFFFFF;">


<table width="100%" border="0" cellspacing="0" cellpadding="5" bgcolor="#649CCC">
  <tr valign="middle">
    <td align="left">
      <p class="p_Heading1"><span class="f_Heading1">2.2. &#35821;&#20041;URL&#25915;&#20987;</span></p>

    </td>
    <td align="right">
     <span style="font-size: 9pt">
     <a href="introduction.htm">Top</a>&nbsp;
     <a href="new_item17.htm">Previous</a>&nbsp;
     <a href="new_item19.htm">Next</a>
     </span>
    </td>
  </tr>
</table>


<!-- Placeholder for topic body. -->
<table width="100%" border="0" cellspacing="0" cellpadding="5"><tr valign="top"><td align="left">
<p style="line-height: 1.50;">2.2. &#35821;&#20041;URL&#25915;&#20987;</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; &#22909;&#22855;&#24515;&#26159;&#24456;&#22810;&#25915;&#20987;&#32773;&#30340;&#20027;&#35201;&#21160;&#26426;&#65292;&#35821;&#20041;URL&#25915;&#20987;&#23601;&#26159;&#19968;&#20010;&#24456;&#22909;&#30340;&#20363;&#23376;&#12290;&#27492;&#31867;&#25915;&#20987;&#20027;&#35201;&#21253;&#25324;&#23545;URL&#36827;&#34892;&#32534;&#36753;&#20197;&#26399;&#21457;&#29616;&#19968;&#20123;&#26377;&#36259;&#30340;&#20107;&#24773;&#12290;&#20363;&#22914;&#65292;&#22914;&#26524;&#29992;&#25143;chris&#28857;&#20987;&#20102;&#20320;&#30340;&#36719;&#20214;&#20013;&#30340;&#19968;&#20010;&#38142;&#25509;&#24182;&#21040;&#36798;&#20102;&#39029;&#38754;http://example.org/private.php?user=chris, &#24456;&#33258;&#28982;&#22320;&#20182;&#21487;&#33021;&#20250;&#35797;&#22270;&#25913;&#21464;user&#30340;&#20540;&#65292;&#30475;&#30475;&#20250;&#21457;&#29983;&#20160;&#20040;&#12290;&#20363;&#22914;&#65292;&#20182;&#21487;&#33021;&#35775;&#38382;http://example.org/private.php?user=rasmus&#26469;&#30475;&#19968;&#19979;&#20182;&#26159;&#21542;&#33021;&#30475;&#21040;&#20854;&#20182;&#20154;&#30340;&#20449;&#24687;&#12290;&#34429;&#28982;&#23545;GET&#25968;&#25454;&#30340;&#25805;&#32437;&#21482;&#26159;&#27604;&#23545;POST&#25968;&#25454;&#31245;&#20026;&#26041;&#20415;&#65292;&#20294;&#23427;&#30340;&#26292;&#38706;&#24615;&#20915;&#23450;&#20102;&#23427;&#26356;&#20026;&#39057;&#32321;&#30340;&#21463;&#25915;&#20987;&#65292;&#29305;&#21035;&#26159;&#23545;&#20110;&#25915;&#20987;&#30340;&#26032;&#25163;&#32780;&#35328;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; &#22823;&#22810;&#25968;&#30340;&#28431;&#27934;&#26159;&#30001;&#20110;&#30095;&#28431;&#32780;&#20135;&#29983;&#30340;&#65292;&#32780;&#19981;&#26159;&#29305;&#21035;&#22797;&#26434;&#30340;&#21407;&#22240;&#24341;&#36215;&#30340;&#12290;&#34429;&#28982;&#24456;&#22810;&#26377;&#32463;&#39564;&#30340;&#31243;&#24207;&#21592;&#33021;&#36731;&#26131;&#22320;&#24847;&#35782;&#21040;&#19978;&#38754;&#25152;&#36848;&#30340;&#23545;URL&#30340;&#20449;&#20219;&#25152;&#24102;&#26469;&#30340;&#21361;&#38505;&#65292;&#20294;&#26159;&#24120;&#24120;&#35201;&#21040;&#21035;&#20154;&#25351;&#20986;&#25165;&#24653;&#28982;&#22823;&#24735;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; &#20026;&#20102;&#26356;&#22909;&#22320;&#28436;&#31034;&#35821;&#20041;URL&#25915;&#20987;&#21450;&#28431;&#27934;&#26159;&#22914;&#20309;&#34987;&#30095;&#24573;&#30340;&#65292;&#20197;&#19968;&#20010;Webmail&#31995;&#32479;&#20026;&#20363;&#65292;&#35813;&#31995;&#32479;&#20027;&#35201;&#21151;&#33021;&#26159;&#29992;&#25143;&#30331;&#24405;&#23519;&#30475;&#20182;&#20204;&#33258;&#24049;&#30340;&#37038;&#20214;&#12290;&#20219;&#20309;&#22522;&#20110;&#29992;&#25143;&#30331;&#24405;&#30340;&#31995;&#32479;&#37117;&#38656;&#35201;&#19968;&#20010;&#23494;&#30721;&#25214;&#22238;&#26426;&#21046;&#12290;&#36890;&#24120;&#30340;&#26041;&#27861;&#26159;&#35810;&#38382;&#19968;&#20010;&#25915;&#20987;&#32773;&#19981;&#21487;&#33021;&#30693;&#36947;&#30340;&#38382;&#39064;&#65288;&#22914;&#20320;&#30340;&#35745;&#31639;&#26426;&#30340;&#21697;&#29260;&#31561;&#65292;&#20294;&#22914;&#26524;&#33021;&#35753;&#29992;&#25143;&#33258;&#24049;&#25351;&#23450;&#38382;&#39064;&#21644;&#31572;&#26696;&#26356;&#20339;&#65289;&#65292;&#22914;&#26524;&#38382;&#39064;&#22238;&#31572;&#27491;&#30830;&#65292;&#21017;&#25226;&#26032;&#30340;&#23494;&#30721;&#21457;&#36865;&#21040;&#27880;&#20876;&#26102;&#25351;&#23450;&#30340;&#37038;&#20214;&#22320;&#22336;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; &#23545;&#20110;&#19968;&#20010;Webmail&#31995;&#32479;&#65292;&#21487;&#33021;&#19981;&#20250;&#22312;&#27880;&#20876;&#26102;&#25351;&#23450;&#37038;&#20214;&#22320;&#22336;&#65292;&#22240;&#27492;&#27491;&#30830;&#22238;&#31572;&#38382;&#39064;&#30340;&#29992;&#25143;&#20250;&#34987;&#25552;&#31034;&#25552;&#20379;&#19968;&#20010;&#37038;&#20214;&#22320;&#22336;&#65288;&#22312;&#21521;&#35813;&#37038;&#20214;&#22320;&#22336;&#21457;&#36865;&#26032;&#23494;&#30721;&#30340;&#21516;&#26102;&#65292;&#20063;&#21487;&#20197;&#25910;&#38598;&#22791;&#29992;&#37038;&#20214;&#22320;&#22336;&#20449;&#24687;&#65289;&#12290;&#19979;&#38754;&#30340;&#34920;&#21333;&#21363;&#29992;&#20110;&#35810;&#38382;&#19968;&#20010;&#26032;&#30340;&#37038;&#20214;&#22320;&#22336;&#65292;&#21516;&#26102;&#20182;&#30340;&#24080;&#25143;&#21517;&#31216;&#23384;&#22312;&#34920;&#21333;&#30340;&#19968;&#20010;&#38544;&#34255;&#23383;&#27573;&#20013;&#65306;</p>
<p style="line-height: 1.50;">CODE:</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &lt;form action="reset.php" method="GET"&gt;</p>
<p style="line-height: 1.50;">  &nbsp; &lt;input type="hidden" name="user" value="chris" /&gt;</p>
<p style="line-height: 1.50;">  &nbsp; &lt;p&gt;Please specify the email address where you want your new password sent:&lt;/p&gt;</p>
<p style="line-height: 1.50;">  &nbsp; &lt;input type="text" name="email" /&gt;&lt;br /&gt;</p>
<p style="line-height: 1.50;">  &nbsp; &lt;input type="submit" value="Send Password" /&gt;</p>
<p style="line-height: 1.50;">  &nbsp; &lt;/form&gt;</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; &#21487;&#20197;&#30475;&#20986;&#65292;&#25509;&#25910;&#33050;&#26412;reset.php&#20250;&#24471;&#21040;&#25152;&#26377;&#20449;&#24687;&#65292;&#21253;&#25324;&#37325;&#32622;&#21738;&#20010;&#24080;&#21495;&#30340;&#23494;&#30721;&#12289;&#24182;&#32473;&#20986;&#23558;&#26032;&#23494;&#30721;&#21457;&#36865;&#21040;&#21738;&#19968;&#20010;&#37038;&#20214;&#22320;&#22336;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; &#22914;&#26524;&#19968;&#20010;&#29992;&#25143;&#33021;&#30475;&#21040;&#19978;&#38754;&#30340;&#34920;&#21333;&#65288;&#22312;&#22238;&#31572;&#27491;&#30830;&#38382;&#39064;&#21518;&#65289;&#65292;&#20320;&#26377;&#29702;&#30001;&#35748;&#20026;&#20182;&#26159;chris&#24080;&#21495;&#30340;&#21512;&#27861;&#25317;&#26377;&#32773;&#12290;&#22914;&#26524;&#20182;&#25552;&#20379;&#20102;chris@example.org&#20316;&#20026;&#22791;&#29992;&#37038;&#20214;&#22320;&#22336;&#65292;&#22312;&#25552;&#20132;&#21518;&#20182;&#23558;&#36827;&#20837;&#19979;&#38754;&#30340;URL&#65306;</p>
<p style="line-height: 1.50;">CODE:</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; http://example.org/reset.php?user=chris&amp;email=chris%40example.org</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; &#35813;URL&#20986;&#29616;&#22312;&#27983;&#35272;&#22120;&#26639;&#20013;&#65292;&#25152;&#20197;&#20219;&#20309;&#19968;&#20301;&#36827;&#34892;&#21040;&#36825;&#19968;&#27493;&#30340;&#29992;&#25143;&#37117;&#33021;&#22815;&#26041;&#20415;&#22320;&#30475;&#20986;&#20854;&#20013;&#30340;user&#21644;mail&#21464;&#37327;&#30340;&#20316;&#29992;&#12290;&#24403;&#24847;&#24605;&#21040;&#36825;&#19968;&#28857;&#21518;&#65292;&#36825;&#20301;&#29992;&#25143;&#23601;&#24819;&#21040;php@example.org&#26159;&#19968;&#20010;&#38750;&#24120;&#37239;&#30340;&#22320;&#22336;&#65292;&#20110;&#26159;&#20182;&#23601;&#20250;&#35775;&#38382;&#19979;&#38754;&#38142;&#25509;&#36827;&#34892;&#23581;&#35797;&#65306;</p>
<p style="line-height: 1.50;">CODE:</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; http://example.org/reset.php?user=php&amp;email=chris%40example.org</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; &#22914;&#26524;reset.php&#20449;&#20219;&#20102;&#29992;&#25143;&#25552;&#20379;&#30340;&#36825;&#20123;&#20449;&#24687;&#65292;&#36825;&#23601;&#26159;&#19968;&#20010;&#35821;&#20041;URL&#25915;&#20987;&#28431;&#27934;&#12290;&#22312;&#27492;&#24773;&#20917;&#19979;&#65292;&#31995;&#32479;&#23558;&#20250;&#20026;php&#24080;&#21495;&#20135;&#29983;&#19968;&#20010;&#26032;&#23494;&#30721;&#24182;&#21457;&#36865;&#33267;chris@example.org&#65292;&#36825;&#26679;chris&#25104;&#21151;&#22320;&#31363;&#21462;&#20102;php&#24080;&#21495;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; &#22914;&#26524;&#20351;&#29992;session&#36319;&#36394;&#65292;&#21487;&#20197;&#24456;&#26041;&#20415;&#22320;&#36991;&#20813;&#19978;&#36848;&#24773;&#20917;&#30340;&#21457;&#29983;&#65306;</p>
<p style="line-height: 1.50;">CODE:</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &lt;?php</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; session_start();</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; $clean = array();</p>
<p style="line-height: 1.50;">  &nbsp; $email_pattern = '/^[^@\s&lt;&amp;&gt;]+@([-a-z0-9]+\.)+[a-z]{2,}$/i';</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; if (preg_match($email_pattern, $_POST['email']))</p>
<p style="line-height: 1.50;">  &nbsp; {</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; $clean['email'] = $_POST['email'];</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; $user = $_SESSION['user'];</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; $new_password = md5(uniqid(rand(), TRUE));</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; if ($_SESSION['verified'])</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; {</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; /* Update Password */</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; mail($clean['email'], 'Your New Password', $new_password);</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; }</p>
<p style="line-height: 1.50;">  &nbsp; }</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; ?&gt;</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; &#23613;&#31649;&#19978;&#20363;&#30465;&#30053;&#20102;&#19968;&#20123;&#32454;&#33410;&#65288;&#22914;&#26356;&#35814;&#32454;&#30340;email&#20449;&#24687;&#25110;&#19968;&#20010;&#21512;&#29702;&#30340;&#23494;&#30721;&#65289;&#65292;&#20294;&#23427;&#31034;&#33539;&#20102;&#23545;&#29992;&#25143;&#25552;&#20379;&#30340;&#24080;&#25143;&#19981;&#21152;&#20197;&#20449;&#20219;&#65292;&#21516;&#26102;&#26356;&#37325;&#35201;&#30340;&#26159;&#20351;&#29992;session&#21464;&#37327;&#20026;&#20445;&#23384;&#29992;&#25143;&#26159;&#21542;&#27491;&#30830;&#22238;&#31572;&#20102;&#38382;&#39064;($_SESSION['verified'])&#65292;&#20197;&#21450;&#27491;&#30830;&#22238;&#31572;&#38382;&#39064;&#30340;&#29992;&#25143;($_SESSION['user'])&#12290;&#27491;&#26159;&#36825;&#31181;&#19981;&#20449;&#20219;&#30340;&#20570;&#27861;&#26159;&#38450;&#27490;&#20320;&#30340;&#24212;&#29992;&#20135;&#29983;&#28431;&#27934;&#30340;&#20851;&#38190;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; &#36825;&#20010;&#23454;&#20363;&#24182;&#19981;&#26159;&#23436;&#20840;&#34394;&#26500;&#30340;&#12290;&#23427;&#26159;&#20174;2003&#24180;5&#26376;&#21457;&#29616;&#30340;Microsoft Passport&#30340;&#28431;&#27934;&#20013;&#24471;&#21040;&#30340;&#28789;&#24863;&#12290;&#35831;&#35775;&#38382;http://slashdot.org/article.pl?sid=03/05/08/122208 &#30475;&#20855;&#20307;&#23454;&#20363;&#12289;&#35752;&#35770;&#21450;&#20854;&#23427;&#20449;&#24687;&#12290;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<hr noshade size=1 ><p style="line-height: 1.50;">&nbsp;</p>

</td></tr></table>

</body>
</html>
