<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>


   <title>4.3. &#20250;&#35805;&#22266;&#23450;</title>
   <meta name="generator" content="Help &amp; Manual" />
   <meta name="keywords" content="" />
   <meta http-equiv="Content-Type" content="text/html; charset=gb2312" />
   <meta http-equiv="Content-Style-Type" content="text/css" />
   <link type="text/css" href="default.css" rel="stylesheet" />
</head>
<body style="margin: 0px 0px 0px 0px; background: #FFFFFF;">


<table width="100%" border="0" cellspacing="0" cellpadding="5" bgcolor="#649CCC">
  <tr valign="middle">
    <td align="left">
      <p class="p_Heading1"><span class="f_Heading1">4.3. &#20250;&#35805;&#22266;&#23450;</span></p>

    </td>
    <td align="right">
     <span style="font-size: 9pt">
     <a href="introduction.htm">Top</a>&nbsp;
     <a href="new_item30.htm">Previous</a>&nbsp;
     <a href="new_item32.htm">Next</a>
     </span>
    </td>
  </tr>
</table>


<!-- Placeholder for topic body. -->
<table width="100%" border="0" cellspacing="0" cellpadding="5"><tr valign="top"><td align="left">
<p style="line-height: 1.50;">4.3. &#20250;&#35805;&#22266;&#23450;</p>
<p style="line-height: 1.50;">  &nbsp; &#20851;&#20110;&#20250;&#35805;&#65292;&#38656;&#35201;&#20851;&#27880;&#30340;&#20027;&#35201;&#38382;&#39064;&#26159;&#20250;&#35805;&#26631;&#35782;&#30340;&#20445;&#23494;&#24615;&#38382;&#39064;&#12290;&#22914;&#26524;&#23427;&#26159;&#20445;&#23494;&#30340;&#65292;&#23601;&#19981;&#20250;&#23384;&#22312;&#20250;&#35805;&#21163;&#25345;&#30340;&#39118;&#38505;&#20102;&#12290;&#36890;&#36807;&#19968;&#20010;&#21512;&#27861;&#30340;&#20250;&#35805;&#26631;&#35782;&#65292;&#19968;&#20010;&#25915;&#20987;&#32773;&#21487;&#20197;&#38750;&#24120;&#25104;&#21151;&#22320;&#20882;&#20805;&#25104;&#20026;&#20320;&#30340;&#26576;&#19968;&#20010;&#29992;&#25143;&#12290;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &#19968;&#20010;&#25915;&#20987;&#32773;&#21487;&#20197;&#36890;&#36807;&#19977;&#31181;&#26041;&#27861;&#26469;&#21462;&#24471;&#21512;&#27861;&#30340;&#20250;&#35805;&#26631;&#35782;&#65306;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">l &nbsp; &nbsp; &nbsp; &nbsp;&#29468;&#27979;</p>
<p style="line-height: 1.50;">l &nbsp; &nbsp; &nbsp; &nbsp;&#25429;&#33719;</p>
<p style="line-height: 1.50;">l &nbsp; &nbsp; &nbsp; &nbsp;&#22266;&#23450;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; PHP&#29983;&#25104;&#30340;&#26159;&#38543;&#26426;&#24615;&#24456;&#24378;&#30340;&#20250;&#35805;&#26631;&#35782;&#65292;&#25152;&#20197;&#34987;&#29468;&#27979;&#30340;&#39118;&#38505;&#26159;&#19981;&#23384;&#22312;&#30340;&#12290;&#24120;&#35265;&#30340;&#26159;&#36890;&#36807;&#25429;&#33719;&#32593;&#32476;&#36890;&#20449;&#25968;&#25454;&#20197;&#24471;&#21040;&#20250;&#35805;&#26631;&#35782;&#12290;&#20026;&#20102;&#36991;&#20813;&#20250;&#35805;&#26631;&#35782;&#34987;&#25429;&#33719;&#30340;&#39118;&#38505;&#65292;&#21487;&#20197;&#20351;&#29992;SSL&#65292;&#21516;&#26102;&#36824;&#35201;&#23545;&#27983;&#35272;&#22120;&#28431;&#27934;&#21450;&#26102;&#20462;&#34917;&#12290;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">&#23567;&#25552;&#31034;</p>
<p style="line-height: 1.50;">  &nbsp; &#35201;&#35760;&#20303;&#27983;&#35272;&#22120;&#20250;&#26681;&#25454;&#35831;&#27714;&#20013;&#30340;Set-cookie&#22836;&#37096;&#20013;&#30340;&#35201;&#27714;&#23545;&#20043;&#21518;&#25152;&#26377;&#30340;&#35831;&#27714;&#20013;&#37117;&#21253;&#21547;&#19968;&#20010;&#30456;&#24212;&#30340;Cookie&#22836;&#37096;&#12290;&#26368;&#24120;&#35265;&#30340;&#26159;&#65292;&#20250;&#35805;&#26631;&#35782;&#20250;&#26080;&#35859;&#30340;&#22312;&#23545;&#19968;&#20123;&#23884;&#20837;&#36164;&#28304;&#22914;&#22270;&#29255;&#30340;&#35831;&#27714;&#20013;&#34987;&#26292;&#38706;&#12290;&#20363;&#22914;&#65292;&#35831;&#27714;&#19968;&#20010;&#21253;&#21547;10&#20010;&#22270;&#29255;&#30340;&#32593;&#39029;&#26102;&#65292;&#27983;&#35272;&#22120;&#20250;&#21457;&#20986;11&#20010;&#24102;&#26377;&#20250;&#35805;&#26631;&#35782;&#30340;&#35831;&#27714;&#65292;&#20294;&#21482;&#26377;&#19968;&#20010;&#26159;&#26377;&#24517;&#35201;&#24102;&#26377;&#26631;&#35782;&#30340;&#12290;&#20026;&#20102;&#38450;&#27490;&#36825;&#31181;&#26080;&#35859;&#30340;&#26292;&#38706;&#65292;&#20320;&#21487;&#20197;&#32771;&#34385;&#25226;&#25152;&#26377;&#30340;&#23884;&#20837;&#36164;&#28304;&#25918;&#22312;&#26377;&#21478;&#22806;&#19968;&#20010;&#22495;&#21517;&#30340;&#26381;&#21153;&#22120;&#19978;&#12290;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &#20250;&#35805;&#22266;&#23450;&#26159;&#19968;&#31181;&#35825;&#39575;&#21463;&#23475;&#32773;&#20351;&#29992;&#25915;&#20987;&#32773;&#25351;&#23450;&#30340;&#20250;&#35805;&#26631;&#35782;&#30340;&#25915;&#20987;&#25163;&#27573;&#12290;&#36825;&#26159;&#25915;&#20987;&#32773;&#33719;&#21462;&#21512;&#27861;&#20250;&#35805;&#26631;&#35782;&#30340;&#26368;&#31616;&#21333;&#30340;&#26041;&#27861;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &#22312;&#36825;&#20010;&#26368;&#31616;&#21333;&#30340;&#20363;&#23376;&#20013;&#65292;&#20351;&#29992;&#20102;&#19968;&#20010;&#38142;&#25509;&#36827;&#34892;&#20250;&#35805;&#22266;&#23450;&#25915;&#20987;&#65306;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &lt;a href="http://example.org/index.php?PHPSESSID=1234"&gt;Click Here&lt;/a&gt;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">&#21478;&#22806;&#19968;&#20010;&#26041;&#27861;&#26159;&#20351;&#29992;&#19968;&#20010;&#21327;&#35758;&#32423;&#21035;&#30340;&#36716;&#21521;&#35821;&#21477;&#65306;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &lt;?php</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; header('Location: http://example.org/index.php?PHPSESSID=1234');</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; ?&gt;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &#36825;&#20063;&#21487;&#20197;&#36890;&#36807;Refresh&#22836;&#37096;&#26469;&#36827;&#34892;&#65292;&#20135;&#29983;&#35813;&#22836;&#37096;&#30340;&#26041;&#27861;&#26159;&#36890;&#36807;&#30495;&#27491;&#30340;HTTP&#22836;&#37096;&#25110;meta&#26631;&#31614;&#30340;http-equiv&#23646;&#24615;&#25351;&#23450;&#12290;&#25915;&#20987;&#32773;&#30340;&#30446;&#26631;&#26159;&#35753;&#29992;&#25143;&#35775;&#38382;&#21253;&#21547;&#26377;&#25915;&#20987;&#32773;&#25351;&#23450;&#30340;&#20250;&#35805;&#26631;&#35782;&#30340;URL&#12290;&#36825;&#26159;&#19968;&#20010;&#22522;&#26412;&#30340;&#25915;&#20987;&#30340;&#31532;&#19968;&#27493;&#65292;&#23436;&#25972;&#30340;&#25915;&#20987;&#36807;&#31243;&#35265;&#22270;4-3&#25152;&#31034;&#12290;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">Figure 4-3. &#20351;&#29992;&#25915;&#20987;&#32773;&#25351;&#23450;&#30340;&#20250;&#35805;&#26631;&#35782;&#36827;&#34892;&#30340;&#20250;&#35805;&#22266;&#23450;&#25915;&#20987;</p>
<p style="line-height: 1.50;"> <img src="embim3.png" width="520" height="196" vspace="1" hspace="1" border="0" alt=""></p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">&#22914;&#26524;&#25104;&#21151;&#20102;&#65292;&#25915;&#20987;&#32773;&#23601;&#33021;&#32469;&#36807;&#25235;&#21462;&#25110;&#29468;&#27979;&#21512;&#27861;&#20250;&#35805;&#26631;&#35782;&#30340;&#38656;&#35201;&#65292;&#36825;&#23601;&#20351;&#21457;&#36215;&#26356;&#22810;&#21644;&#26356;&#21361;&#38505;&#30340;&#25915;&#20987;&#25104;&#20026;&#21487;&#33021;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &#20026;&#20102;&#26356;&#22909;&#22320;&#20351;&#20320;&#29702;&#35299;&#36825;&#19968;&#27493;&#39588;&#65292;&#26368;&#22909;&#30340;&#21150;&#27861;&#26159;&#20320;&#33258;&#24049;&#23581;&#35797;&#19968;&#19979;&#12290;&#39318;&#20808;&#24314;&#31435;&#19968;&#20010;&#21517;&#20026;fixation.php&#30340;&#33050;&#26412;&#65306;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &lt;?php</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; session_start();</p>
<p style="line-height: 1.50;">  &nbsp; $_SESSION['username'] = 'chris';</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; ?&gt;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &#30830;&#35748;&#20320;&#27809;&#26377;&#20445;&#23384;&#30528;&#20219;&#20309;&#24403;&#21069;&#26381;&#21153;&#22120;&#30340;cookies&#65292;&#25110;&#36890;&#36807;&#28165;&#38500;&#25152;&#26377;&#30340;cookies&#20197;&#30830;&#20445;&#36825;&#19968;&#28857;&#12290;&#36890;&#36807;&#21253;&#21547;PHPSESSID&#30340;URL&#35775;&#38382;fixation.php&#65306;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; http://example.org/fixation.php?PHPSESSID=1234</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &#23427;&#24314;&#31435;&#20102;&#19968;&#20010;&#20540;&#20026;chris&#30340;&#20250;&#35805;&#21464;&#37327;username&#12290;&#22312;&#26816;&#26597;&#20250;&#35805;&#23384;&#20648;&#21306;&#21518;&#21457;&#29616;1234&#25104;&#20026;&#20102;&#35813;&#25968;&#25454;&#30340;&#20250;&#35805;&#26631;&#35782;&#65306;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; $ cat /tmp/sess_1234</p>
<p style="line-height: 1.50;">  &nbsp; username|s:5:"chris";</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &#24314;&#31435;&#31532;&#20108;&#27573;&#33050;&#26412;test.php&#65292;&#23427;&#22312;$_SESSION[&#8216;username&#8217;] &nbsp; &nbsp; &nbsp; &nbsp;&#23384;&#22312;&#30340;&#24773;&#20917;&#19979;&#21363;&#36755;&#20837;&#20986;&#35813;&#20540;&#65306;</p>
<p style="line-height: 1.50;">  &nbsp; &lt;?php</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; session_start();</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; if (isset($_SESSION['username']))</p>
<p style="line-height: 1.50;">  &nbsp; {</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; echo $_SESSION['username'];</p>
<p style="line-height: 1.50;">  &nbsp; }</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; ?&gt;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &#22312;&#21478;&#22806;&#19968;&#21488;&#35745;&#31639;&#26426;&#19978;&#25110;&#32773;&#22312;&#21478;&#19968;&#20010;&#27983;&#35272;&#22120;&#20013;&#35775;&#38382;&#19979;&#38754;&#30340;URL&#65292;&#21516;&#26102;&#35813;URL&#25351;&#23450;&#20102;&#30456;&#21516;&#30340;&#20250;&#35805;&#26631;&#35782;&#65306;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; http://example.org/test.php?PHPSESSID=1234</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &#36825;&#20351;&#20320;&#21487;&#20197;&#22312;&#21478;&#19968;&#21488;&#35745;&#31639;&#26426;&#19978;&#25110;&#27983;&#35272;&#22120;&#20013;&#65288;&#27169;&#20223;&#25915;&#20987;&#32773;&#25152;&#22312;&#20301;&#32622;&#65289;&#24674;&#22797;&#21069;&#38754;&#22312;fixation.php&#20013;&#24314;&#31435;&#30340;&#20250;&#35805;&#12290;&#36825;&#26679;&#65292;&#20320;&#23601;&#20316;&#20026;&#19968;&#20010;&#25915;&#20987;&#32773;&#25104;&#21151;&#22320;&#21163;&#25345;&#20102;&#19968;&#20010;&#20250;&#35805;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &#24456;&#26126;&#26174;&#65292;&#25105;&#20204;&#19981;&#24076;&#26395;&#36825;&#31181;&#24773;&#20917;&#21457;&#29983;&#12290;&#22240;&#20026;&#36890;&#36807;&#19978;&#38754;&#30340;&#26041;&#27861;&#65292;&#25915;&#20987;&#32773;&#20250;&#25552;&#20379;&#19968;&#20010;&#21040;&#20320;&#30340;&#24212;&#29992;&#30340;&#38142;&#25509;&#65292;&#21482;&#35201;&#36890;&#36807;&#36825;&#20010;&#38142;&#25509;&#23545;&#20320;&#30340;&#32593;&#31449;&#36827;&#34892;&#35775;&#38382;&#30340;&#29992;&#25143;&#37117;&#20250;&#20351;&#29992;&#25915;&#20987;&#32773;&#25152;&#25351;&#23450;&#30340;&#20250;&#35805;&#26631;&#35782;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &#20135;&#29983;&#36825;&#20010;&#38382;&#39064;&#30340;&#19968;&#20010;&#21407;&#22240;&#26159;&#20250;&#35805;&#26159;&#30001;URL&#20013;&#30340;&#20250;&#35805;&#26631;&#35782;&#25152;&#24314;&#31435;&#30340;&#12290;&#24403;&#27809;&#26377;&#25351;&#23450;&#20250;&#35805;&#26631;&#35782;&#26102;&#65292;PHP&#23601;&#20250;&#33258;&#21160;&#20135;&#29983;&#19968;&#20010;&#12290;&#36825;&#23601;&#20026;&#25915;&#20987;&#32773;&#22823;&#24320;&#20102;&#26041;&#20415;&#20043;&#38376;&#12290;&#24184;&#36816;&#30340;&#26159;&#65292;&#25105;&#20204;&#20197;&#21487;&#20197;&#20351;&#29992;session_regenerate_id( )&#20989;&#25968;&#26469;&#38450;&#27490;&#36825;&#31181;&#24773;&#20917;&#30340;&#21457;&#29983;&#12290;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &lt;?php</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; session_start();</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; if (!isset($_SESSION['initiated']))</p>
<p style="line-height: 1.50;">  &nbsp; {</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; session_regenerate_id();</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; $_SESSION['initiated'] = TRUE;</p>
<p style="line-height: 1.50;">  &nbsp; }</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; ?&gt;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &#36825;&#23601;&#20445;&#35777;&#20102;&#22312;&#20250;&#35805;&#21021;&#22987;&#21270;&#26102;&#33021;&#26377;&#19968;&#20010;&#20840;&#26032;&#30340;&#20250;&#35805;&#26631;&#35782;&#12290;&#21487;&#26159;&#65292;&#36825;&#24182;&#19981;&#26159;&#38450;&#27490;&#20250;&#35805;&#22266;&#23450;&#25915;&#20987;&#30340;&#26377;&#25928;&#35299;&#20915;&#26041;&#26696;&#12290;&#25915;&#20987;&#32773;&#33021;&#31616;&#21333;&#22320;&#36890;&#36807;&#35775;&#38382;&#20320;&#30340;&#32593;&#31449;&#65292;&#30830;&#23450;PHP&#32473;&#20986;&#30340;&#20250;&#35805;&#26631;&#35782;&#65292;&#24182;&#19988;&#22312;&#20250;&#35805;&#22266;&#23450;&#25915;&#20987;&#20013;&#20351;&#29992;&#35813;&#20250;&#35805;&#26631;&#35782;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &#36825;&#30830;&#23454;&#20351;&#25915;&#20987;&#32773;&#27809;&#26377;&#26426;&#20250;&#21435;&#25351;&#23450;&#19968;&#20010;&#31616;&#21333;&#30340;&#20250;&#35805;&#26631;&#35782;&#65292;&#22914;1234&#65292;&#20294;&#25915;&#20987;&#32773;&#20381;&#28982;&#21487;&#20197;&#36890;&#36807;&#26816;&#26597;cookie&#25110;URL&#65288;&#20381;&#36182;&#20110;&#26631;&#35782;&#30340;&#20256;&#36882;&#26041;&#24335;&#65289;&#24471;&#21040;PHP&#25351;&#23450;&#30340;&#20250;&#35805;&#26631;&#35782;&#12290;&#35813;&#27969;&#31243;&#22914;&#22270;4-4&#25152;&#31034;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &#35813;&#22270;&#35828;&#26126;&#20102;&#20250;&#35805;&#30340;&#36825;&#20010;&#24369;&#28857;&#65292;&#21516;&#26102;&#23427;&#21487;&#20197;&#24110;&#21161;&#20320;&#29702;&#35299;&#35813;&#38382;&#39064;&#28041;&#21450;&#30340;&#33539;&#22260;&#12290;&#20250;&#35805;&#22266;&#23450;&#21482;&#26159;&#19968;&#20010;&#22522;&#30784;&#65292;&#25915;&#20987;&#30340;&#30446;&#30340;&#26159;&#35201;&#21462;&#24471;&#19968;&#20010;&#33021;&#29992;&#26469;&#21163;&#25345;&#20250;&#35805;&#30340;&#26631;&#35782;&#12290;&#36825;&#36890;&#24120;&#29992;&#20110;&#36825;&#26679;&#30340;&#19968;&#20010;&#31995;&#32479;&#65292;&#22312;&#36825;&#20010;&#31995;&#32479;&#20013;&#65292;&#25915;&#20987;&#32773;&#33021;&#21512;&#27861;&#21462;&#24471;&#36739;&#20302;&#30340;&#26435;&#38480;(&#35813;&#26435;&#38480;&#32423;&#21035;&#21482;&#35201;&#33021;&#30331;&#24405;&#21363;&#21487;)&#65292;&#36825;&#26679;&#21163;&#25345;&#19968;&#20010;&#20855;&#26377;&#36739;&#39640;&#26435;&#38480;&#30340;&#20250;&#35805;&#26159;&#38750;&#24120;&#26377;&#29992;&#30340;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &#22914;&#26524;&#20250;&#35805;&#26631;&#35782;&#22312;&#26435;&#38480;&#31561;&#32423;&#26377;&#25913;&#21464;&#26102;&#37325;&#26032;&#29983;&#25104;&#65292;&#23601;&#21487;&#20197;&#22312;&#20107;&#23454;&#19978;&#36991;&#24320;&#20250;&#35805;&#22266;&#23450;&#30340;&#39118;&#38505;&#65306;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &lt;?php</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; $_SESSION['logged_in'] = FALSE;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; if (check_login())</p>
<p style="line-height: 1.50;">  &nbsp; {</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; session_regenerate_id();</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; $_SESSION['logged_in'] = TRUE;</p>
<p style="line-height: 1.50;">  &nbsp; }</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; ?&gt;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">Figure 4-4. &#36890;&#36807;&#39318;&#20808;&#21021;&#22987;&#21270;&#20250;&#35805;&#36827;&#34892;&#20250;&#35805;&#22266;&#23450;&#25915;&#20987;</p>
<p style="line-height: 1.50;"> <img src="embim4.png" width="574" height="515" vspace="1" hspace="1" border="0" alt=""></p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;"><span style="font-weight: bold;">&#23567;&#25552;&#31034;</span></p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &#25105;&#19981;&#25512;&#33616;&#22312;&#27599;&#19968;&#39029;&#19978;&#37325;&#26032;&#29983;&#25104;&#20250;&#35805;&#26631;&#35782;&#12290;&#34429;&#28982;&#36825;&#30475;&#36215;&#26469;&#30830;&#23454;&#26159;&#19968;&#20010;&#23433;&#20840;&#30340;&#26041;&#27861;&#12290;&#20294;&#19982;&#22312;&#26435;&#38480;&#31561;&#32423;&#21464;&#21270;&#26102;&#37325;&#26032;&#29983;&#25104;&#20250;&#35805;&#26631;&#35782;&#30456;&#27604;&#65292;&#24182;&#27809;&#26377;&#25552;&#20379;&#26356;&#22810;&#30340;&#20445;&#25252;&#25163;&#27573;&#12290;&#26356;&#37325;&#35201;&#30340;&#26159;&#65292;&#30456;&#21453;&#22320;&#23427;&#36824;&#20250;&#23545;&#20320;&#30340;&#21512;&#27861;&#29992;&#25143;&#20135;&#29983;&#24433;&#21709;&#65292;&#29305;&#21035;&#26159;&#20250;&#35805;&#26631;&#35782;&#36890;&#36807;URL&#20256;&#36882;&#26102;&#23588;&#29978;&#12290;&#29992;&#25143;&#21487;&#33021;&#20250;&#20351;&#29992;&#27983;&#35272;&#22120;&#30340;&#35775;&#38382;&#21382;&#21490;&#26426;&#21046;&#21435;&#35775;&#38382;&#20197;&#21069;&#35775;&#38382;&#30340;&#39029;&#38754;&#65292;&#36825;&#26679;&#35813;&#39029;&#19978;&#30340;&#38142;&#25509;&#23601;&#20250;&#25351;&#21521;&#19968;&#20010;&#19981;&#20877;&#23384;&#22312;&#30340;&#20250;&#35805;&#26631;&#35782;&#12290;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &#22914;&#26524;&#20320;&#21482;&#22312;&#26435;&#38480;&#31561;&#32423;&#21464;&#21270;&#26102;&#37325;&#26032;&#29983;&#25104;&#20250;&#35805;&#26631;&#35782;&#65292;&#21516;&#26679;&#30340;&#24773;&#20917;&#20063;&#26377;&#21487;&#20197;&#21457;&#29983;&#65292;&#20294;&#26159;&#29992;&#25143;&#22312;&#35775;&#38382;&#26435;&#38480;&#21464;&#26356;&#21069;&#30340;&#39029;&#38754;&#26102;&#65292;&#19981;&#20250;&#22240;&#20026;&#20250;&#35805;&#20002;&#22833;&#32780;&#22855;&#24618;&#65292;&#21516;&#26102;&#65292;&#36825;&#31181;&#24773;&#20917;&#20063;&#19981;&#24120;&#35265;&#12290;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<hr noshade size=1 ><p style="line-height: 1.50;">&nbsp;</p>

</td></tr></table>

</body>
</html>
