<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>


   <title>&#31532;&#19977;&#31456; &#25968;&#25454;&#24211;&#21450;SQL</title>
   <meta name="generator" content="Help &amp; Manual" />
   <meta name="keywords" content="" />
   <meta http-equiv="Content-Type" content="text/html; charset=gb2312" />
   <meta http-equiv="Content-Style-Type" content="text/css" />
   <link type="text/css" href="default.css" rel="stylesheet" />
</head>
<body style="margin: 0px 0px 0px 0px; background: #FFFFFF;">


<table width="100%" border="0" cellspacing="0" cellpadding="5" bgcolor="#649CCC">
  <tr valign="middle">
    <td align="left">
      <p class="p_Heading1"><span class="f_Heading1">&#31532;&#19977;&#31456; &#25968;&#25454;&#24211;&#21450;SQL</span></p>

    </td>
    <td align="right">
     <span style="font-size: 9pt">
     <a href="introduction.htm">Top</a>&nbsp;
     <a href="new_item23.htm">Previous</a>&nbsp;
     <a href="new_item25.htm">Next</a>
     </span>
    </td>
  </tr>
</table>


<!-- Placeholder for topic body. -->
<table width="100%" border="0" cellspacing="0" cellpadding="5"><tr valign="top"><td align="left">
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &#31532;&#19977;&#31456; &#25968;&#25454;&#24211;&#21450;SQL</p>
<p style="line-height: 1.50;">  &nbsp; PHP&#30340;&#20316;&#29992;&#24120;&#24120;&#26159;&#27807;&#36890;&#21508;&#31181;&#25968;&#25454;&#28304;&#21450;&#29992;&#25143;&#30340;&#26725;&#26753;&#12290;&#20107;&#23454;&#19978;&#65292;&#26377;&#20123;&#20154;&#35748;&#20026;PHP&#26356;&#20687;&#26159;&#19968;&#20010;&#24179;&#21488;&#32780;&#19981;&#26159;&#19968;&#20010;&#32534;&#31243;&#35821;&#35328;&#12290;&#22522;&#20110;&#36825;&#20123;&#21407;&#22240;&#65292;PHP&#39057;&#32321;&#29992;&#20110;&#19982;&#25968;&#25454;&#24211;&#30340;&#20132;&#27969;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; PHP&#21487;&#20197;&#24456;&#22909;&#30340;&#32988;&#20219;&#36825;&#20010;&#20219;&#21153;&#65292;&#20854;&#21407;&#22240;&#29305;&#21035;&#26159;&#30001;&#20110;&#23427;&#33021;&#19982;&#24456;&#22810;&#31181;&#25968;&#25454;&#24211;&#36830;&#25509;&#12290;&#19979;&#38754;&#21015;&#20030;&#20102;PHP&#25903;&#25345;&#30340;&#23567;&#37096;&#20998;&#25968;&#25454;&#24211;&#65306;</p>
<p style="line-height: 1.50;">DB2</p>
<p style="line-height: 1.50;">ODBC</p>
<p style="line-height: 1.50;">SQLite</p>
<p style="line-height: 1.50;">InterBase</p>
<p style="line-height: 1.50;">Oracle</p>
<p style="line-height: 1.50;">Sybase</p>
<p style="line-height: 1.50;">MySQL</p>
<p style="line-height: 1.50;">PostgreSQL</p>
<p style="line-height: 1.50;">DBM</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &#19982;&#20219;&#20309;&#30340;&#36828;&#31243;&#25968;&#25454;&#23384;&#20648;&#26041;&#24335;&#30456;&#21516;&#65292;&#25968;&#25454;&#24211;&#26412;&#36523;&#20063;&#23384;&#22312;&#30528;&#19968;&#20123;&#39118;&#38505;&#12290;&#23613;&#31649;&#25968;&#25454;&#24211;&#23433;&#20840;&#19981;&#26159;&#26412;&#20070;&#35752;&#35770;&#30340;&#38382;&#39064;&#65292;&#20294;&#25968;&#25454;&#24211;&#23433;&#20840;&#26159;&#38656;&#35201;&#26102;&#21051;&#27880;&#24847;&#30340;&#65292;&#29305;&#21035;&#26159;&#20851;&#20110;&#22914;&#20309;&#23545;&#24453;&#20174;&#25968;&#25454;&#24211;&#35835;&#21462;&#20316;&#20026;&#36755;&#20837;&#30340;&#25968;&#25454;&#30340;&#38382;&#39064;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &#27491;&#22914;&#31532;&#19968;&#31456;&#25152;&#35752;&#35770;&#30340;&#65292;&#25152;&#26377;&#36755;&#20837;&#24517;&#38656;&#35201;&#36827;&#34892;&#36807;&#28388;&#65292;&#21516;&#26102;&#25152;&#26377;&#30340;&#36755;&#20986;&#24517;&#39035;&#35201;&#36716;&#20041;&#12290;&#24403;&#22788;&#29702;&#25968;&#25454;&#24211;&#26102;&#65292;&#24847;&#21619;&#30528;&#25152;&#26377;&#26469;&#33258;&#25968;&#25454;&#24211;&#30340;&#25968;&#25454;&#35201;&#36807;&#28388;&#65292;&#25152;&#26377;&#20889;&#20837;&#25968;&#25454;&#24211;&#30340;&#25968;&#25454;&#35201;&#36827;&#34892;&#36716;&#20041;&#12290;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;"><span style="font-weight: bold;">&#23567;&#25552;&#31034;</span></p>
<p style="line-height: 1.50;">  &nbsp; &#24120;&#29359;&#30340;&#38169;&#35823;&#26159;&#24536;&#35760;&#20102;SELECT&#35821;&#21477;&#26412;&#36523;&#26159;&#21521;&#25968;&#25454;&#24211;&#20256;&#36865;&#30340;&#25968;&#25454;&#12290;&#23613;&#31649;&#35813;&#35821;&#21477;&#30340;&#30446;&#30340;&#26159;&#21462;&#24471;&#25968;&#25454;&#65292;&#20294;&#35821;&#21477;&#26412;&#36523;&#21017;&#26159;&#36755;&#20986;&#12290;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &#24456;&#22810;PHP&#24320;&#21457;&#20154;&#21592;&#19981;&#20250;&#21435;&#36807;&#28388;&#26469;&#33258;&#25968;&#25454;&#24211;&#30340;&#25968;&#25454;&#65292;&#20182;&#20204;&#35748;&#20026;&#25968;&#25454;&#24211;&#20869;&#20445;&#23384;&#30340;&#26159;&#24050;&#36807;&#28388;&#30340;&#25968;&#25454;&#12290;&#34429;&#28982;&#36825;&#31181;&#20570;&#27861;&#30340;&#23433;&#20840;&#39118;&#38505;&#26159;&#24456;&#23567;&#30340;&#65292;&#20294;&#26159;&#36825;&#19981;&#26159;&#26368;&#22909;&#30340;&#20570;&#27861;&#65292;&#21516;&#26102;&#25105;&#20063;&#19981;&#25512;&#33616;&#36825;&#26679;&#20570;&#12290;&#36825;&#31181;&#20570;&#27861;&#26159;&#22522;&#20110;&#23545;&#25968;&#25454;&#24211;&#23433;&#20840;&#30340;&#32477;&#23545;&#20449;&#20219;&#65292;&#20294;&#21516;&#26102;&#36829;&#21453;&#20102;&#28145;&#24230;&#38450;&#33539;&#30340;&#21407;&#21017;&#12290;&#22914;&#26524;&#24694;&#24847;&#25968;&#25454;&#30001;&#20110;&#26576;&#20123;&#21407;&#22240;&#34987;&#27880;&#20837;&#20102;&#25968;&#25454;&#24211;&#65292;&#22914;&#26524;&#20320;&#26377;&#36807;&#28388;&#26426;&#21046;&#30340;&#35805;&#65292;&#23601;&#33021;&#21457;&#29616;&#24182;&#25235;&#20303;&#23427;&#12290;&#35831;&#35760;&#20303;&#65292;&#20887;&#20313;&#30340;&#23433;&#20840;&#25514;&#26045;&#26159;&#26377;&#20215;&#20540;&#30340;&#65292;&#36825;&#23601;&#26159;&#19968;&#20010;&#24456;&#22909;&#30340;&#20363;&#23376;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &#26412;&#31456;&#21253;&#25324;&#20102;&#20854;&#23427;&#20960;&#20010;&#38656;&#35201;&#20851;&#24515;&#30340;&#20027;&#39064;&#65292;&#21253;&#25324;&#35775;&#38382;&#26435;&#38480;&#26292;&#38706;&#21450;SQL&#27880;&#20837;&#12290;SQL&#27880;&#20837;&#26159;&#38656;&#35201;&#29305;&#21035;&#20851;&#27880;&#30340;&#65292;&#36825;&#26159;&#22240;&#20026;&#22312;&#27969;&#34892;&#30340;PHP&#24212;&#29992;&#20013;&#39057;&#32321;&#21457;&#29616;&#20102;SQL&#27880;&#20837;&#28431;&#27934;&#12290;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<hr noshade size=1 ><p style="line-height: 1.50;">&nbsp;</p>

</td></tr></table>

</body>
</html>
