<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>


   <title>3.2. SQL &#27880;&#20837;</title>
   <meta name="generator" content="Help &amp; Manual" />
   <meta name="keywords" content="" />
   <meta http-equiv="Content-Type" content="text/html; charset=gb2312" />
   <meta http-equiv="Content-Style-Type" content="text/css" />
   <link type="text/css" href="default.css" rel="stylesheet" />
</head>
<body style="margin: 0px 0px 0px 0px; background: #FFFFFF;">


<table width="100%" border="0" cellspacing="0" cellpadding="5" bgcolor="#649CCC">
  <tr valign="middle">
    <td align="left">
      <p class="p_Heading1"><span class="f_Heading1">3.2. SQL &#27880;&#20837;</span></p>

    </td>
    <td align="right">
     <span style="font-size: 9pt">
     <a href="introduction.htm">Top</a>&nbsp;
     <a href="new_item25.htm">Previous</a>&nbsp;
     <a href="new_item27.htm">Next</a>
     </span>
    </td>
  </tr>
</table>


<!-- Placeholder for topic body. -->
<table width="100%" border="0" cellspacing="0" cellpadding="5"><tr valign="top"><td align="left">
<p style="line-height: 1.50;">3.2. SQL &#27880;&#20837;</p>
<p style="line-height: 1.50;">  &nbsp; SQL &#27880;&#20837;&#26159;PHP&#24212;&#29992;&#20013;&#26368;&#24120;&#35265;&#30340;&#28431;&#27934;&#20043;&#19968;&#12290;&#20107;&#23454;&#19978;&#20196;&#20154;&#24778;&#22855;&#30340;&#26159;&#65292;&#24320;&#21457;&#32773;&#35201;&#21516;&#26102;&#29359;&#20004;&#20010;&#38169;&#35823;&#25165;&#20250;&#24341;&#21457;&#19968;&#20010;SQL&#27880;&#20837;&#28431;&#27934;&#65292;&#19968;&#20010;&#26159;&#27809;&#26377;&#23545;&#36755;&#20837;&#30340;&#25968;&#25454;&#36827;&#34892;&#36807;&#28388;&#65288;&#36807;&#28388;&#36755;&#20837;&#65289;&#65292;&#36824;&#26377;&#19968;&#20010;&#26159;&#27809;&#26377;&#23545;&#21457;&#36865;&#21040;&#25968;&#25454;&#24211;&#30340;&#25968;&#25454;&#36827;&#34892;&#36716;&#20041;&#65288;&#36716;&#20041;&#36755;&#20986;&#65289;&#12290;&#36825;&#20004;&#20010;&#37325;&#35201;&#30340;&#27493;&#39588;&#32570;&#19968;&#19981;&#21487;&#65292;&#38656;&#35201;&#21516;&#26102;&#21152;&#20197;&#29305;&#21035;&#20851;&#27880;&#20197;&#20943;&#23569;&#31243;&#24207;&#38169;&#35823;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &#23545;&#20110;&#25915;&#20987;&#32773;&#26469;&#35828;&#65292;&#36827;&#34892;SQL&#27880;&#20837;&#25915;&#20987;&#38656;&#35201;&#24605;&#32771;&#21644;&#35797;&#39564;&#65292;&#23545;&#25968;&#25454;&#24211;&#26041;&#26696;&#36827;&#34892;&#26377;&#26681;&#26377;&#25454;&#30340;&#25512;&#29702;&#38750;&#24120;&#26377;&#24517;&#35201;&#65288;&#24403;&#28982;&#20551;&#35774;&#25915;&#20987;&#32773;&#30475;&#19981;&#21040;&#20320;&#30340;&#28304;&#31243;&#24207;&#21644;&#25968;&#25454;&#24211;&#26041;&#26696;&#65289;&#65292;&#32771;&#34385;&#20197;&#19979;&#31616;&#21333;&#30340;&#30331;&#24405;&#34920;&#21333;&#65306;</p>
<p style="line-height: 1.50;">CODE:</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">&lt;form action="/login.php" method="POST"&gt;</p>
<p style="line-height: 1.50;">&lt;p&gt;Username: &lt;input type="text" name="username" /&gt;&lt;/p&gt;</p>
<p style="line-height: 1.50;">&lt;p&gt;Password: &lt;input type="password" name="password" /&gt;&lt;/p&gt;</p>
<p style="line-height: 1.50;">&lt;p&gt;&lt;input type="submit" value="Log In" /&gt;&lt;/p&gt;</p>
<p style="line-height: 1.50;">&lt;/form&gt;</p>
<p style="line-height: 1.50;">&#22270; 3-1 &#32473;&#20986;&#20102;&#35813;&#34920;&#21333;&#22312;&#27983;&#35272;&#22120;&#20013;&#30340;&#26174;&#31034;&#12290;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &#20316;&#20026;&#19968;&#20010;&#25915;&#20987;&#32773;&#65292;&#20182;&#20250;&#20174;&#25512;&#27979;&#39564;&#35777;&#29992;&#25143;&#21517;&#21644;&#23494;&#30721;&#30340;&#26597;&#35810;&#35821;&#21477;&#24320;&#22987;&#12290;&#36890;&#36807;&#26597;&#30475;&#28304;&#25991;&#20214;&#65292;&#20182;&#23601;&#33021;&#24320;&#22987;&#29468;&#27979;&#20320;&#30340;&#20064;&#24815;&#12290;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">&#22270; 3-1. &#30331;&#24405;&#34920;&#21333;&#22312;&#27983;&#35272;&#22120;&#20013;&#30340;&#26174;&#31034;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">&#21629;&#21517;&#20064;&#24815;&#12290;&#36890;&#24120;&#20250;&#20551;&#35774;&#20320;&#34920;&#21333;&#20013;&#30340;&#23383;&#27573;&#21517;&#20026;&#19982;&#25968;&#25454;&#34920;&#20013;&#30340;&#23383;&#27573;&#21517;&#30456;&#21516;&#12290;&#24403;&#28982;&#65292;&#30830;&#20445;&#23427;&#20204;&#19981;&#21516;&#26410;&#24517;&#26159;&#19968;&#20010;&#21487;&#38752;&#30340;&#23433;&#20840;&#25514;&#26045;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &#31532;&#19968;&#27425;&#29468;&#27979;&#65292;&#19968;&#33324;&#20250;&#20351;&#29992;&#19979;&#38754;&#20363;&#23376;&#20013;&#30340;&#26597;&#35810;&#65306;</p>
<p style="line-height: 1.50;">CODE:</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">&lt;?php</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">$password_hash = md5($_POST['password']);</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">$sql = "SELECT count(*)</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; FROM &nbsp; users</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; WHERE &nbsp;username = '{$_POST['username']}'</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; AND &nbsp; &nbsp;password = '$password_hash'";</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">?&gt;</p>
<p style="line-height: 1.50;">&#20351;&#29992;&#29992;&#25143;&#23494;&#30721;&#30340;MD5&#20540;&#21407;&#26469;&#26159;&#19968;&#20010;&#36890;&#34892;&#30340;&#20570;&#27861;&#65292;&#20294;&#29616;&#22312;&#24182;&#19981;&#26159;&#29305;&#21035;&#23433;&#20840;&#20102;&#12290;&#26368;&#36817;&#30340;&#30740;&#31350;&#34920;&#26126;MD5&#31639;&#27861;&#26377;&#32570;&#38519;&#65292;&#32780;&#19988;&#22823;&#37327;MD5&#25968;&#25454;&#24211;&#38477;&#20302;&#20102;MD5&#21453;&#21521;&#30772;&#35299;&#30340;&#38590;&#24230;&#12290;&#35831;&#35775;&#38382;http://md5.rednoize.com/ &#26597;&#30475;&#28436;&#31034;&#12290;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &#35793;&#27880;&#65306;&#21407;&#25991;&#22914;&#27492;&#65292;&#23665;&#19996;&#22823;&#23398;&#25945;&#25480;&#29579;&#23567;&#20113;&#30340;&#30740;&#31350;&#34920;&#26126;&#21487;&#20197;&#24456;&#24555;&#30340;&#25214;&#21040;MD5&#30340;&#8220;&#30896;&#25758;&#8221;&#65292;&#23601;&#26159;&#21487;&#20197;&#20135;&#29983;&#30456;&#21516;&#30340;MD5&#20540;&#30340;&#19981;&#21516;&#20004;&#20010;&#25991;&#20214;&#21644;&#23383;&#20018;&#12290;MD5&#26159;&#20449;&#24687;&#25688;&#35201;&#31639;&#27861;&#65292;&#32780;&#19981;&#26159;&#21152;&#23494;&#31639;&#27861;&#65292;&#21453;&#21521;&#30772;&#35299;&#20063;&#23601;&#26080;&#20174;&#35848;&#36215;&#20102;&#12290;&#19981;&#36807;&#26681;&#25454;&#36825;&#20010;&#25104;&#26524;&#65292;&#22312;&#19978;&#38754;&#30340;&#29305;&#20363;&#20013;&#65292;&#30452;&#25509;&#20351;&#29992;md5&#26159;&#21361;&#38505;&#30340;&#12290;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &#26368;&#22909;&#30340;&#20445;&#25252;&#26041;&#27861;&#26159;&#22312;&#23494;&#30721;&#19978;&#38468;&#21152;&#19968;&#20010;&#20320;&#33258;&#24049;&#23450;&#20041;&#30340;&#23383;&#31526;&#20018;&#65292;&#20363;&#22914;&#65306;</p>
<p style="line-height: 1.50;">CODE:</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">&lt;?php</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">$salt = 'SHIFLETT';</p>
<p style="line-height: 1.50;">$password_hash = md5($salt . md5($_POST['password'] . $salt));</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">?&gt;</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &#24403;&#28982;&#65292;&#25915;&#20987;&#32773;&#26410;&#24517;&#22312;&#31532;&#19968;&#27425;&#23601;&#33021;&#29468;&#20013;&#65292;&#20182;&#20204;&#24120;&#24120;&#36824;&#38656;&#35201;&#20570;&#19968;&#20123;&#35797;&#39564;&#12290;&#26377;&#19968;&#20010;&#27604;&#36739;&#22909;&#30340;&#35797;&#39564;&#26041;&#24335;&#26159;&#25226;&#21333;&#24341;&#21495;&#20316;&#20026;&#29992;&#25143;&#21517;&#24405;&#20837;&#65292;&#21407;&#22240;&#26159;&#36825;&#26679;&#21487;&#33021;&#20250;&#26292;&#38706;&#19968;&#20123;&#37325;&#35201;&#20449;&#24687;&#12290;&#26377;&#24456;&#22810;&#24320;&#21457;&#20154;&#21592;&#22312;Mysql&#35821;&#21477;&#25191;&#34892;&#20986;&#38169;&#26102;&#20250;&#35843;&#29992;&#20989;&#25968;mysql_error()&#26469;&#25253;&#21578;&#38169;&#35823;&#12290;&#35265;&#19979;&#38754;&#30340;&#20363;&#23376;&#65306;</p>
<p style="line-height: 1.50;">CODE:</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">&lt;?php</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">mysql_query($sql) or exit(mysql_error());</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">?&gt;</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &#34429;&#28982;&#35813;&#26041;&#27861;&#22312;&#24320;&#21457;&#20013;&#21313;&#20998;&#26377;&#29992;&#65292;&#20294;&#23427;&#33021;&#21521;&#25915;&#20987;&#32773;&#26292;&#38706;&#37325;&#35201;&#20449;&#24687;&#12290;&#22914;&#26524;&#25915;&#20987;&#32773;&#25226;&#21333;&#24341;&#21495;&#20570;&#20026;&#29992;&#25143;&#21517;&#65292;mypass&#20570;&#20026;&#23494;&#30721;&#65292;&#26597;&#35810;&#35821;&#21477;&#23601;&#20250;&#21464;&#25104;&#65306;</p>
<p style="line-height: 1.50;">CODE:</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">&lt;?php</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">$sql = "SELECT *</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; FROM &nbsp; users</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; WHERE &nbsp;username = '''</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; AND &nbsp; &nbsp;password = 'a029d0df84eb5549c641e04a9ef389e5'";</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">?&gt;</p>
<p style="line-height: 1.50;">&#24403;&#35813;&#35821;&#21477;&#21457;&#36865;&#21040;MySQL&#21518;&#65292;&#31995;&#32479;&#23601;&#20250;&#26174;&#31034;&#22914;&#19979;&#38169;&#35823;&#20449;&#24687;&#65306;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">You have an error in your SQL syntax. Check the manual that corresponds to your</p>
<p style="line-height: 1.50;">MySQL server version for the right syntax to use near 'WHERE username = ''' AND</p>
<p style="line-height: 1.50;">password = 'a029d0df84eb55</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &#19981;&#36153;&#21561;&#28784;&#20043;&#21147;&#65292;&#25915;&#20987;&#32773;&#24050;&#32463;&#30693;&#36947;&#20102;&#20004;&#20010;&#23383;&#27573;&#21517;(username&#21644;password)&#20197;&#21450;&#20182;&#20204;&#20986;&#29616;&#22312;&#26597;&#35810;&#20013;&#30340;&#39034;&#24207;&#12290;&#38500;&#27492;&#20197;&#22806;&#65292;&#25915;&#20987;&#32773;&#36824;&#30693;&#36947;&#20102;&#25968;&#25454;&#27809;&#26377;&#27491;&#30830;&#36827;&#34892;&#36807;&#28388;&#65288;&#31243;&#24207;&#27809;&#26377;&#25552;&#31034;&#38750;&#27861;&#29992;&#25143;&#21517;&#65289;&#21644;&#36716;&#20041;&#65288;&#20986;&#29616;&#20102;&#25968;&#25454;&#24211;&#38169;&#35823;&#65289;&#65292;&#21516;&#26102;&#25972;&#20010;WHERE&#26465;&#20214;&#30340;&#26684;&#24335;&#20063;&#26292;&#38706;&#20102;&#65292;&#36825;&#26679;&#65292;&#25915;&#20987;&#32773;&#23601;&#21487;&#20197;&#23581;&#35797;&#25805;&#32437;&#31526;&#21512;&#26597;&#35810;&#30340;&#35760;&#24405;&#20102;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &#22312;&#36825;&#19968;&#28857;&#19978;&#65292;&#25915;&#20987;&#32773;&#26377;&#24456;&#22810;&#36873;&#25321;&#12290;&#19968;&#26159;&#23581;&#35797;&#22635;&#20837;&#19968;&#20010;&#29305;&#27530;&#30340;&#29992;&#25143;&#21517;&#65292;&#20197;&#20351;&#26597;&#35810;&#26080;&#35770;&#29992;&#25143;&#21517;&#23494;&#30721;&#26159;&#21542;&#31526;&#21512;&#65292;&#37117;&#33021;&#24471;&#21040;&#21305;&#37197;&#65306;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">myuser' or 'foo' = 'foo' --</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &#20551;&#23450;&#23558;mypass&#20316;&#20026;&#23494;&#30721;&#65292;&#25972;&#20010;&#26597;&#35810;&#23601;&#20250;&#21464;&#25104;&#65306;</p>
<p style="line-height: 1.50;">CODE:</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">&lt;?php</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">$sql = "SELECT *</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; FROM &nbsp; users</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; WHERE &nbsp;username = 'myuser' or 'foo' = 'foo' --</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; AND &nbsp; &nbsp;password = 'a029d0df84eb5549c641e04a9ef389e5'";</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">?&gt;</p>
<p style="line-height: 1.50;">&#30001;&#20110;&#20013;&#38388;&#25554;&#20837;&#20102;&#19968;&#20010;SQL&#27880;&#37322;&#26631;&#35760;&#65292;&#25152;&#20197;&#26597;&#35810;&#35821;&#21477;&#20250;&#22312;&#27492;&#20013;&#26029;&#12290;&#36825;&#23601;&#20801;&#35768;&#20102;&#19968;&#20010;&#25915;&#20987;&#32773;&#22312;&#19981;&#30693;&#36947;&#20219;&#20309;&#21512;&#27861;&#29992;&#25143;&#21517;&#21644;&#23494;&#30721;&#30340;&#24773;&#20917;&#19979;&#30331;&#24405;&#12290;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &#22914;&#26524;&#30693;&#36947;&#21512;&#27861;&#30340;&#29992;&#25143;&#21517;&#65292;&#25915;&#20987;&#32773;&#23601;&#21487;&#20197;&#35813;&#29992;&#25143;(&#22914;chris)&#36523;&#20221;&#30331;&#24405;&#65306;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">chris' --</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &#21482;&#35201;chris&#26159;&#21512;&#27861;&#30340;&#29992;&#25143;&#21517;&#65292;&#25915;&#20987;&#32773;&#23601;&#21487;&#20197;&#25511;&#21046;&#35813;&#24080;&#21495;&#12290;&#21407;&#22240;&#26159;&#26597;&#35810;&#21464;&#25104;&#20102;&#19979;&#38754;&#30340;&#26679;&#23376;&#65306;</p>
<p style="line-height: 1.50;">CODE:</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">&lt;?php</p>
<p style="line-height: 1.50;">$sql = "SELECT *</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; FROM &nbsp; users</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; WHERE &nbsp;username = 'chris' --</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; AND &nbsp; &nbsp;password = 'a029d0df84eb5549c641e04a9ef389e5'";</p>
<p style="line-height: 1.50;">?&gt;</p>
<p style="line-height: 1.50;">&#24184;&#36816;&#30340;&#26159;&#65292;SQL&#27880;&#20837;&#26159;&#24456;&#23481;&#26131;&#36991;&#20813;&#30340;&#12290;&#27491;&#22914;&#31532;&#19968;&#31456;&#25152;&#25552;&#21450;&#30340;&#65292;&#20320;&#24517;&#39035;&#22362;&#25345;&#36807;&#28388;&#36755;&#20837;&#21644;&#36716;&#20041;&#36755;&#20986;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &#34429;&#28982;&#20004;&#20010;&#27493;&#39588;&#37117;&#19981;&#33021;&#30465;&#30053;&#65292;&#20294;&#21482;&#35201;&#23454;&#29616;&#20854;&#20013;&#30340;&#19968;&#20010;&#23601;&#33021;&#28040;&#38500;&#22823;&#22810;&#25968;&#30340;SQL&#27880;&#20837;&#39118;&#38505;&#12290;&#22914;&#26524;&#20320;&#21482;&#26159;&#36807;&#28388;&#36755;&#20837;&#32780;&#27809;&#26377;&#36716;&#20041;&#36755;&#20986;&#65292;&#20320;&#24456;&#21487;&#33021;&#20250;&#36935;&#21040;&#25968;&#25454;&#24211;&#38169;&#35823;&#65288;&#21512;&#27861;&#30340;&#25968;&#25454;&#20063;&#21487;&#33021;&#24433;&#21709;SQL&#26597;&#35810;&#30340;&#27491;&#30830;&#26684;&#24335;&#65289;&#65292;&#20294;&#36825;&#20063;&#19981;&#21487;&#38752;&#65292;&#21512;&#27861;&#30340;&#25968;&#25454;&#36824;&#21487;&#33021;&#25913;&#21464;SQL&#35821;&#21477;&#30340;&#34892;&#20026;&#12290;&#21478;&#19968;&#26041;&#38754;&#65292;&#22914;&#26524;&#20320;&#36716;&#20041;&#20102;&#36755;&#20986;&#65292;&#32780;&#27809;&#26377;&#36807;&#28388;&#36755;&#20837;&#65292;&#23601;&#33021;&#20445;&#35777;&#25968;&#25454;&#19981;&#20250;&#24433;&#21709;SQL&#35821;&#21477;&#30340;&#26684;&#24335;&#65292;&#21516;&#26102;&#20063;&#38450;&#27490;&#20102;&#22810;&#31181;&#24120;&#35265;SQL&#27880;&#20837;&#25915;&#20987;&#30340;&#26041;&#27861;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &#24403;&#28982;&#65292;&#36824;&#26159;&#35201;&#22362;&#25345;&#21516;&#26102;&#20351;&#29992;&#36825;&#20004;&#20010;&#27493;&#39588;&#12290;&#36807;&#28388;&#36755;&#20837;&#30340;&#26041;&#24335;&#23436;&#20840;&#21462;&#20915;&#20110;&#36755;&#20837;&#25968;&#25454;&#30340;&#31867;&#22411;&#65288;&#35265;&#31532;&#19968;&#31456;&#30340;&#31034;&#20363;&#65289;&#65292;&#20294;&#36716;&#20041;&#29992;&#20110;&#21521;&#25968;&#25454;&#24211;&#21457;&#36865;&#30340;&#36755;&#20986;&#25968;&#25454;&#21482;&#35201;&#20351;&#29992;&#21516;&#19968;&#20010;&#20989;&#25968;&#21363;&#21487;&#12290;&#23545;&#20110;MySQL&#29992;&#25143;&#65292;&#21487;&#20197;&#20351;&#29992;&#20989;&#25968;mysql_real_escape_string( )&#65306;</p>
<p style="line-height: 1.50;">CODE:</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">&lt;?php</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">$clean = array();</p>
<p style="line-height: 1.50;">$mysql = array();</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">$clean['last_name'] = "O'Reilly";</p>
<p style="line-height: 1.50;">$mysql['last_name'] = mysql_real_escape_string($clean['last_name']);</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">$sql = "INSERT</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; INTO &nbsp; user (last_name)</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; VALUES ('{$mysql['last_name']}')";</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">?&gt;</p>
<p style="line-height: 1.50;">&#23613;&#37327;&#20351;&#29992;&#20026;&#20320;&#30340;&#25968;&#25454;&#24211;&#35774;&#35745;&#30340;&#36716;&#20041;&#20989;&#25968;&#12290;&#22914;&#26524;&#27809;&#26377;&#65292;&#20351;&#29992;&#20989;&#25968;addslashes( )&#26159;&#26368;&#32456;&#30340;&#27604;&#36739;&#22909;&#30340;&#26041;&#27861;&#12290;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &#24403;&#25152;&#26377;&#29992;&#20110;&#24314;&#31435;&#19968;&#20010;SQL&#35821;&#21477;&#30340;&#25968;&#25454;&#34987;&#27491;&#30830;&#36807;&#28388;&#21644;&#36716;&#20041;&#26102;&#65292;&#23454;&#38469;&#19978;&#20063;&#23601;&#36991;&#20813;&#20102;SQL&#27880;&#20837;&#30340;&#39118;&#38505;&#12290;</p>
<p style="line-height: 1.50;">CODE:</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">&#22914;&#26524;&#20320;&#27491;&#22312;&#20351;&#29992;&#25903;&#25345;&#21442;&#25968;&#21270;&#26597;&#35810;&#35821;&#21477;&#21644;&#21344;&#20301;&#31526;&#30340;&#25968;&#25454;&#24211;&#25805;&#20316;&#31867;&#65288;&#22914;PEAR::DB, PDO&#31561;&#65289;&#65292;&#20320;&#23601;&#20250;&#22810;&#24471;&#21040;&#19968;&#23618;&#20445;&#25252;&#12290;&#35265;&#19979;&#38754;&#30340;&#20351;&#29992;PEAR::DB&#30340;&#20363;&#23376;&#65306;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">CODE:</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">&lt;?php</p>
<p style="line-height: 1.50;">$sql = 'INSERT</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; INTO &nbsp; user (last_name)</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; VALUES (?)'; </p>
<p style="line-height: 1.50;">$dbh-&gt;query($sql, array($clean['last_name']));</p>
<p style="line-height: 1.50;">?&gt;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">CODE:</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">&#30001;&#20110;&#22312;&#19978;&#20363;&#20013;&#25968;&#25454;&#19981;&#33021;&#30452;&#25509;&#24433;&#21709;&#26597;&#35810;&#35821;&#21477;&#30340;&#26684;&#24335;&#65292;SQL&#27880;&#20837;&#30340;&#39118;&#38505;&#23601;&#38477;&#20302;&#20102;&#12290;PEAR::DB&#20250;&#33258;&#21160;&#26681;&#25454;&#20320;&#30340;&#25968;&#25454;&#24211;&#30340;&#35201;&#27714;&#36827;&#34892;&#36716;&#20041;&#65292;&#25152;&#20197;&#20320;&#21482;&#38656;&#35201;&#36807;&#28388;&#36755;&#20986;&#21363;&#21487;&#12290;</p>
<p style="line-height: 1.50;">&#22914;&#26524;&#20320;&#27491;&#22312;&#20351;&#29992;&#21442;&#25968;&#21270;&#26597;&#35810;&#35821;&#21477;&#65292;&#36755;&#20837;&#30340;&#20869;&#23481;&#23601;&#21482;&#20250;&#20316;&#20026;&#25968;&#25454;&#26469;&#22788;&#29702;&#12290;&#36825;&#26679;&#23601;&#27809;&#26377;&#24517;&#35201;&#36827;&#34892;&#36716;&#20041;&#20102;&#65292;&#23613;&#31649;&#20320;&#21487;&#33021;&#35748;&#20026;&#36825;&#26159;&#24517;&#35201;&#30340;&#19968;&#27493;&#65288;&#22914;&#26524;&#20320;&#24076;&#26395;&#22362;&#25345;&#36716;&#20041;&#36755;&#20986;&#20064;&#24815;&#30340;&#35805;&#65289;&#12290;&#23454;&#38469;&#19978;&#65292;&#36825;&#26102;&#26159;&#21542;&#36716;&#20041;&#22522;&#26412;&#19978;&#19981;&#20250;&#20135;&#29983;&#24433;&#21709;&#65292;&#22240;&#20026;&#36825;&#26102;&#27809;&#26377;&#29305;&#27530;&#23383;&#31526;&#38656;&#35201;&#36716;&#25442;&#12290;&#22312;&#38450;&#27490;SQL&#27880;&#20837;&#36825;&#19968;&#28857;&#19978;&#65292;&#21442;&#25968;&#21270;&#26597;&#35810;&#35821;&#21477;&#20026;&#20320;&#30340;&#31243;&#24207;&#25552;&#20379;&#20102;&#24378;&#22823;&#30340;&#20445;&#25252;&#12290;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &#35793;&#27880;&#65306;&#20851;&#20110;SQL&#27880;&#20837;&#65292;&#19981;&#24471;&#19981;&#35828;&#30340;&#26159;&#29616;&#22312;&#22823;&#22810;&#34394;&#25311;&#20027;&#26426;&#37117;&#20250;&#25226;magic_quotes_gpc&#36873;&#39033;&#25171;&#24320;&#65292;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#25152;&#26377;&#30340;&#23458;&#25143;&#31471;GET&#21644;POST&#30340;&#25968;&#25454;&#37117;&#20250;&#33258;&#21160;&#36827;&#34892;addslashes&#22788;&#29702;&#65292;&#25152;&#20197;&#27492;&#26102;&#23545;&#23383;&#31526;&#20018;&#20540;&#30340;SQL&#27880;&#20837;&#26159;&#19981;&#21487;&#34892;&#30340;&#65292;&#20294;&#35201;&#38450;&#27490;&#23545;&#25968;&#23383;&#20540;&#30340;SQL&#27880;&#20837;&#65292;&#22914;&#29992;intval()&#31561;&#20989;&#25968;&#36827;&#34892;&#22788;&#29702;&#12290;&#20294;&#22914;&#26524;&#20320;&#32534;&#20889;&#30340;&#26159;&#36890;&#29992;&#36719;&#20214;&#65292;&#21017;&#38656;&#35201;&#35835;&#21462;&#26381;&#21153;&#22120;&#30340;magic_quotes_gpc&#21518;&#36827;&#34892;&#30456;&#24212;&#22788;&#29702;&#12290;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<hr noshade size=1 ><p style="line-height: 1.50;">&nbsp;</p>

</td></tr></table>

</body>
</html>
