<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>


   <title>4.4. &#20250;&#35805;&#21163;&#25345;</title>
   <meta name="generator" content="Help &amp; Manual" />
   <meta name="keywords" content="" />
   <meta http-equiv="Content-Type" content="text/html; charset=gb2312" />
   <meta http-equiv="Content-Style-Type" content="text/css" />
   <link type="text/css" href="default.css" rel="stylesheet" />
</head>
<body style="margin: 0px 0px 0px 0px; background: #FFFFFF;">


<table width="100%" border="0" cellspacing="0" cellpadding="5" bgcolor="#649CCC">
  <tr valign="middle">
    <td align="left">
      <p class="p_Heading1"><span class="f_Heading1">4.4. &#20250;&#35805;&#21163;&#25345;</span></p>

    </td>
    <td align="right">
     <span style="font-size: 9pt">
     <a href="introduction.htm">Top</a>&nbsp;
     <a href="new_item31.htm">Previous</a>&nbsp;
     <a href="new_item33.htm">Next</a>
     </span>
    </td>
  </tr>
</table>


<!-- Placeholder for topic body. -->
<table width="100%" border="0" cellspacing="0" cellpadding="5"><tr valign="top"><td align="left">
<p style="line-height: 1.50;">4.4. &#20250;&#35805;&#21163;&#25345;</p>
<p style="line-height: 1.50;">  &nbsp; &#26368;&#24120;&#35265;&#30340;&#38024;&#23545;&#20250;&#35805;&#30340;&#25915;&#20987;&#25163;&#27573;&#26159;&#20250;&#35805;&#21163;&#25345;&#12290;&#23427;&#26159;&#25152;&#26377;&#25915;&#20987;&#32773;&#21487;&#20197;&#29992;&#26469;&#35775;&#38382;&#20854;&#23427;&#20154;&#30340;&#20250;&#35805;&#30340;&#25163;&#27573;&#30340;&#24635;&#31216;&#12290;&#25152;&#26377;&#36825;&#20123;&#25163;&#27573;&#30340;&#31532;&#19968;&#27493;&#37117;&#26159;&#21462;&#24471;&#19968;&#20010;&#21512;&#27861;&#30340;&#20250;&#35805;&#26631;&#35782;&#26469;&#20266;&#35013;&#25104;&#21512;&#27861;&#29992;&#25143;&#65292;&#22240;&#27492;&#20445;&#35777;&#20250;&#35805;&#26631;&#35782;&#19981;&#34987;&#27844;&#38706;&#38750;&#24120;&#37325;&#35201;&#12290;&#21069;&#38754;&#20960;&#33410;&#20013;&#20851;&#20110;&#20250;&#35805;&#26292;&#38706;&#21644;&#22266;&#23450;&#30340;&#30693;&#35782;&#33021;&#24110;&#21161;&#20320;&#20445;&#35777;&#20250;&#35805;&#26631;&#35782;&#21482;&#26377;&#26381;&#21153;&#22120;&#21450;&#21512;&#27861;&#29992;&#25143;&#25165;&#33021;&#30693;&#36947;&#12290;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &#28145;&#24230;&#38450;&#33539;&#21407;&#21017;&#65288;&#35265;&#31532;&#19968;&#31456;&#65289;&#21487;&#20197;&#29992;&#22312;&#20250;&#35805;&#19978;&#65292;&#24403;&#20250;&#35805;&#26631;&#35782;&#19981;&#24184;&#34987;&#25915;&#20987;&#32773;&#30693;&#36947;&#30340;&#24773;&#20917;&#19979;&#65292;&#19968;&#20123;&#19981;&#36215;&#30524;&#30340;&#23433;&#20840;&#25514;&#26045;&#20063;&#20250;&#25552;&#20379;&#19968;&#20123;&#20445;&#25252;&#12290;&#20316;&#20026;&#19968;&#20010;&#20851;&#24515;&#23433;&#20840;&#30340;&#24320;&#21457;&#32773;&#65292;&#20320;&#30340;&#30446;&#26631;&#24212;&#35813;&#26159;&#20351;&#21069;&#36848;&#30340;&#20266;&#35013;&#36807;&#31243;&#21464;&#24471;&#26356;&#22797;&#26434;&#12290;&#35760;&#20303;&#26080;&#35770;&#22810;&#23567;&#30340;&#38556;&#30861;&#65292;&#37117;&#20250;&#20197;&#20320;&#30340;&#24212;&#29992;&#25552;&#20379;&#20445;&#25252;&#12290;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &#25226;&#20266;&#35013;&#36807;&#31243;&#21464;&#24471;&#26356;&#22797;&#26434;&#30340;&#20851;&#38190;&#26159;&#21152;&#24378;&#39564;&#35777;&#12290;&#20250;&#35805;&#26631;&#35782;&#26159;&#39564;&#35777;&#30340;&#39318;&#35201;&#26041;&#27861;&#65292;&#21516;&#26102;&#20320;&#21487;&#20197;&#29992;&#20854;&#23427;&#25968;&#25454;&#26469;&#34917;&#20805;&#23427;&#12290;&#20320;&#21487;&#20197;&#29992;&#30340;&#25152;&#26377;&#25968;&#25454;&#21482;&#26159;&#22312;&#27599;&#20010;HTTP&#35831;&#27714;&#20013;&#30340;&#25968;&#25454;&#65306;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; GET / HTTP/1.1</p>
<p style="line-height: 1.50;">  &nbsp; Host: example.org</p>
<p style="line-height: 1.50;">  &nbsp; User-Agent: Firefox/1.0</p>
<p style="line-height: 1.50;">  &nbsp; Accept: text/html, image/png, image/jpeg, image/gif, */*</p>
<p style="line-height: 1.50;">  &nbsp; Cookie: PHPSESSID=1234</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &#20320;&#24212;&#35813;&#24847;&#35782;&#21040;&#35831;&#27714;&#30340;&#19968;&#33268;&#24615;&#65292;&#24182;&#25226;&#19981;&#19968;&#33268;&#30340;&#34892;&#20026;&#35748;&#20026;&#26159;&#21487;&#30097;&#34892;&#20026;&#12290;&#20363;&#22914;&#65292;&#34429;&#28982;User-Agent(&#21457;&#20986;&#26412;&#35831;&#27714;&#30340;&#27983;&#35272;&#22120;&#31867;&#22411;)&#22836;&#37096;&#26159;&#21487;&#36873;&#30340;&#65292;&#20294;&#26159;&#21482;&#35201;&#26159;&#21457;&#20986;&#35813;&#22836;&#37096;&#30340;&#27983;&#35272;&#22120;&#36890;&#24120;&#37117;&#19981;&#20250;&#21464;&#21270;&#23427;&#30340;&#20540;&#12290;&#22914;&#26524;&#20320;&#19968;&#20010;&#25317;&#26377;1234&#30340;&#20250;&#35805;&#26631;&#35782;&#30340;&#29992;&#25143;&#22312;&#30331;&#24405;&#21518;&#19968;&#30452;&#29992;Mozilla Firfox&#27983;&#35272;&#22120;&#65292;&#31361;&#28982;&#36716;&#25442;&#25104;&#20102;IE&#65292;&#36825;&#23601;&#27604;&#36739;&#21487;&#30097;&#20102;&#12290;&#20363;&#22914;&#65292;&#27492;&#26102;&#20320;&#21487;&#20197;&#29992;&#35201;&#27714;&#36755;&#20837;&#23494;&#30721;&#26041;&#24335;&#26469;&#20943;&#36731;&#39118;&#38505;&#65292;&#21516;&#26102;&#22312;&#35823;&#25253;&#26102;&#65292;&#36825;&#20063;&#23545;&#21512;&#27861;&#29992;&#25143;&#20135;&#29983;&#30340;&#20914;&#20987;&#20063;&#27604;&#36739;&#23567;&#12290;&#20320;&#21487;&#20197;&#29992;&#19979;&#38754;&#30340;&#20195;&#30721;&#26469;&#26816;&#27979;User-Agent&#30340;&#19968;&#33268;&#24615;&#65306;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &lt;?php</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; session_start();</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; if (isset($_SESSION['HTTP_USER_AGENT']))</p>
<p style="line-height: 1.50;">  &nbsp; {</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; if ($_SESSION['HTTP_USER_AGENT'] != md5($_SERVER['HTTP_USER_AGENT']))</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; {</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; /* Prompt for password */</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; exit;</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; }</p>
<p style="line-height: 1.50;">  &nbsp; }</p>
<p style="line-height: 1.50;">  &nbsp; else</p>
<p style="line-height: 1.50;">  &nbsp; {</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; $_SESSION['HTTP_USER_AGENT'] = md5($_SERVER['HTTP_USER_AGENT']);</p>
<p style="line-height: 1.50;">  &nbsp; }</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; ?&gt;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &#25105;&#35266;&#23519;&#36807;&#65292;&#22312;&#26576;&#20123;&#29256;&#26412;&#30340;IE&#27983;&#35272;&#22120;&#20013;&#65292;&#29992;&#25143;&#27491;&#24120;&#35775;&#38382;&#19968;&#20010;&#32593;&#39029;&#21644;&#21047;&#26032;&#19968;&#20010;&#32593;&#39029;&#26102;&#21457;&#20986;&#30340;Accept&#22836;&#37096;&#20449;&#24687;&#19981;&#21516;&#65292;&#22240;&#27492;Accept&#22836;&#37096;&#19981;&#33021;&#29992;&#26469;&#21028;&#26029;&#19968;&#33268;&#24615;&#12290;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &#30830;&#20445;User-Agent&#22836;&#37096;&#20449;&#24687;&#19968;&#33268;&#30340;&#30830;&#26159;&#26377;&#25928;&#30340;&#65292;&#20294;&#22914;&#26524;&#20250;&#35805;&#26631;&#35782;&#36890;&#36807;cookie&#20256;&#36882;&#65288;&#25512;&#33616;&#26041;&#24335;&#65289;&#65292;&#26377;&#36947;&#29702;&#35748;&#20026;&#65292;&#22914;&#26524;&#25915;&#20987;&#32773;&#33021;&#21462;&#24471;&#20250;&#35805;&#26631;&#35782;&#65292;&#20182;&#21516;&#26102;&#20063;&#33021;&#21462;&#24471;&#20854;&#23427;HTTP&#22836;&#37096;&#12290;&#30001;&#20110;cookie&#26292;&#38706;&#19982;&#27983;&#35272;&#22120;&#28431;&#27934;&#25110;&#36328;&#31449;&#33050;&#26412;&#28431;&#27934;&#30456;&#20851;&#65292;&#21463;&#23475;&#32773;&#38656;&#35201;&#35775;&#38382;&#25915;&#20987;&#32773;&#30340;&#32593;&#31449;&#24182;&#26292;&#38706;&#25152;&#26377;&#22836;&#37096;&#20449;&#24687;&#12290;&#25152;&#26377;&#25915;&#20987;&#32773;&#35201;&#20570;&#30340;&#21482;&#26159;&#37325;&#24314;&#22836;&#37096;&#20197;&#38450;&#27490;&#20219;&#20309;&#23545;&#22836;&#37096;&#20449;&#24687;&#19968;&#33268;&#24615;&#30340;&#26816;&#26597;&#12290;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &#27604;&#36739;&#22909;&#30340;&#26041;&#27861;&#26159;&#20135;&#29983;&#22312;URL&#20013;&#20256;&#36882;&#19968;&#20010;&#26631;&#35760;&#65292;&#21487;&#20197;&#35748;&#20026;&#36825;&#26159;&#31532;&#20108;&#31181;&#39564;&#35777;&#30340;&#24418;&#24335;&#65288;&#34429;&#28982;&#26356;&#24369;&#65289;&#12290;&#20351;&#29992;&#36825;&#20010;&#26041;&#27861;&#38656;&#35201;&#36827;&#34892;&#19968;&#20123;&#32534;&#31243;&#24037;&#20316;&#65292;PHP&#20013;&#27809;&#26377;&#30456;&#24212;&#30340;&#21151;&#33021;&#12290;&#20363;&#22914;&#65292;&#20551;&#35774;&#26631;&#35760;&#20445;&#23384;&#22312;$token&#20013;&#65292;&#20320;&#38656;&#35201;&#25226;&#23427;&#21253;&#21547;&#22312;&#25152;&#26377;&#20320;&#30340;&#24212;&#29992;&#30340;&#20869;&#37096;&#38142;&#25509;&#20013;&#65306;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &lt;?php</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; $url = array();</p>
<p style="line-height: 1.50;">  &nbsp; $html = array();</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; $url['token'] = rawurlencode($token);</p>
<p style="line-height: 1.50;">  &nbsp; $html['token'] = htmlentities($url['token'], ENT_QUOTES, 'UTF-8');</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; ?&gt;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &lt;a href="index.php?token=&lt;?php echo $html['token']; ?&gt;"&gt;Click Here&lt;/a&gt;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &#20026;&#20102;&#26356;&#26041;&#20415;&#22320;&#31649;&#29702;&#36825;&#20010;&#20256;&#36882;&#36807;&#31243;&#65292;&#20320;&#21487;&#33021;&#20250;&#25226;&#25972;&#20010;&#35831;&#27714;&#20018;&#25918;&#22312;&#19968;&#20010;&#21464;&#37327;&#20013;&#12290;&#20320;&#21487;&#20197;&#25226;&#36825;&#20010;&#21464;&#37327;&#38468;&#21152;&#21040;&#25152;&#26377;&#38142;&#25509;&#21518;&#38754;&#65292;&#36825;&#26679;&#21363;&#20415;&#20320;&#19968;&#24320;&#22987;&#27809;&#26377;&#20351;&#29992;&#35813;&#25216;&#24039;&#65292;&#20170;&#21518;&#36824;&#26159;&#21487;&#20197;&#24456;&#26041;&#20415;&#22320;&#23545;&#20320;&#30340;&#20195;&#30721;&#20316;&#20986;&#21464;&#21270;&#12290;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &#35813;&#26631;&#35760;&#38656;&#35201;&#21253;&#21547;&#19981;&#21487;&#39044;&#27979;&#30340;&#20869;&#23481;&#65292;&#21363;&#20415;&#26159;&#22312;&#25915;&#20987;&#32773;&#30693;&#36947;&#20102;&#21463;&#23475;&#32773;&#27983;&#35272;&#22120;&#21457;&#20986;&#30340;HTTP&#22836;&#37096;&#30340;&#20840;&#37096;&#20449;&#24687;&#20063;&#19981;&#34892;&#12290;&#19968;&#31181;&#26041;&#27861;&#26159;&#29983;&#25104;&#19968;&#20010;&#38543;&#26426;&#20018;&#20316;&#20026;&#26631;&#35760;&#65306;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">&lt;?php</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; $string = $_SERVER['HTTP_USER_AGENT'];</p>
<p style="line-height: 1.50;">  &nbsp; $string .= 'SHIFLETT';</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; $token = md5($string);</p>
<p style="line-height: 1.50;">  &nbsp; $_SESSION['token'] = $token;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; ?&gt;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &#24403;&#20320;&#20351;&#29992;&#38543;&#26426;&#20018;&#26102;&#65288;&#22914;SHIFLETT&#65289;&#65292;&#23545;&#23427;&#36827;&#34892;&#39044;&#27979;&#26159;&#19981;&#29616;&#23454;&#30340;&#12290;&#27492;&#26102;&#65292;&#25429;&#33719;&#26631;&#35760;&#23558;&#27604;&#39044;&#27979;&#26631;&#35760;&#26356;&#20026;&#26041;&#20415;&#65292;&#36890;&#36807;&#22312;URL&#20013;&#20256;&#36882;&#26631;&#35760;&#21644;&#22312;cookie&#20013;&#20256;&#36882;&#20250;&#35805;&#26631;&#35782;&#65292;&#25915;&#20987;&#26102;&#38656;&#35201;&#21516;&#26102;&#25235;&#21462;&#23427;&#20204;&#20108;&#32773;&#12290;&#36825;&#26679;&#38500;&#38750;&#25915;&#20987;&#32773;&#33021;&#22815;&#23519;&#30475;&#21463;&#23475;&#32773;&#21457;&#24448;&#20320;&#30340;&#24212;&#29992;&#25152;&#26377;&#30340;HTTP&#35831;&#27714;&#21407;&#22987;&#20449;&#24687;&#25165;&#21487;&#20197;&#65292;&#22240;&#20026;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#25152;&#26377;&#20869;&#23481;&#37117;&#26292;&#38706;&#20102;&#12290;&#36825;&#31181;&#25915;&#20987;&#26041;&#24335;&#23454;&#29616;&#36215;&#26469;&#38750;&#24120;&#22256;&#38590;&#65288;&#25152;&#20197;&#24456;&#32597;&#35265;&#65289;&#65292;&#35201;&#38450;&#27490;&#23427;&#38656;&#35201;&#20351;&#29992;SSL&#12290;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &#26377;&#19987;&#23478;&#35686;&#21578;&#19981;&#35201;&#20381;&#36182;&#20110;&#26816;&#26597;User-Agent&#30340;&#19968;&#33268;&#24615;&#12290;&#36825;&#26159;&#22240;&#20026;&#26381;&#21153;&#22120;&#32676;&#38598;&#20013;&#30340;HTTP&#20195;&#29702;&#26381;&#21153;&#22120;&#20250;&#23545;User-Agent&#36827;&#34892;&#32534;&#36753;&#65292;&#32780;&#26412;&#32676;&#38598;&#20013;&#30340;&#22810;&#20010;&#20195;&#29702;&#26381;&#21153;&#22120;&#22312;&#32534;&#36753;&#35813;&#20540;&#26102;&#21487;&#33021;&#20250;&#19981;&#19968;&#33268;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &#22914;&#26524;&#20320;&#19981;&#24076;&#26395;&#20381;&#36182;&#20110;&#26816;&#26597;User-Agent&#30340;&#19968;&#33268;&#24615;&#12290;&#20320;&#21487;&#20197;&#29983;&#25104;&#19968;&#20010;&#38543;&#26426;&#30340;&#26631;&#35760;&#65306;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &lt;?php</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; $token = md5(uniqid(rand(), TRUE));</p>
<p style="line-height: 1.50;">  &nbsp; $_SESSION['token'] = $token;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; ?&gt;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &#36825;&#19968;&#26041;&#27861;&#30340;&#23433;&#20840;&#24615;&#34429;&#28982;&#26159;&#24369;&#19968;&#20123;&#65292;&#20294;&#23427;&#26356;&#21487;&#38752;&#12290;&#19978;&#38754;&#30340;&#20004;&#20010;&#26041;&#27861;&#37117;&#23545;&#38450;&#27490;&#20250;&#35805;&#21163;&#25345;&#25552;&#20379;&#20102;&#24378;&#26377;&#21147;&#30340;&#25163;&#27573;&#12290;&#20320;&#38656;&#35201;&#20570;&#30340;&#26159;&#22312;&#23433;&#20840;&#24615;&#21644;&#21487;&#38752;&#24615;&#20043;&#38388;&#20316;&#20986;&#24179;&#34913;&#12290;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<hr noshade size=1 ><p style="line-height: 1.50;">&nbsp;</p>

</td></tr></table>

</body>
</html>
