<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>


   <title>&#31532;&#22235;&#31456; &#20250;&#35805;&#19982; Cookies</title>
   <meta name="generator" content="Help &amp; Manual" />
   <meta name="keywords" content="" />
   <meta http-equiv="Content-Type" content="text/html; charset=gb2312" />
   <meta http-equiv="Content-Style-Type" content="text/css" />
   <link type="text/css" href="default.css" rel="stylesheet" />
</head>
<body style="margin: 0px 0px 0px 0px; background: #FFFFFF;">


<table width="100%" border="0" cellspacing="0" cellpadding="5" bgcolor="#649CCC">
  <tr valign="middle">
    <td align="left">
      <p class="p_Heading1"><span class="f_Heading1">&#31532;&#22235;&#31456; &#20250;&#35805;&#19982; Cookies</span></p>

    </td>
    <td align="right">
     <span style="font-size: 9pt">
     <a href="introduction.htm">Top</a>&nbsp;
     <a href="new_item27.htm">Previous</a>&nbsp;
     <a href="new_item29.htm">Next</a>
     </span>
    </td>
  </tr>
</table>


<!-- Placeholder for topic body. -->
<table width="100%" border="0" cellspacing="0" cellpadding="5"><tr valign="top"><td align="left">
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&#31532;&#22235;&#31456; &#20250;&#35805;&#19982; Cookies</p>
<p style="line-height: 1.50;">  &nbsp;&#26412;&#31456;&#20027;&#35201;&#35752;&#35770;&#20250;&#35805;&#21644;&#26377;&#29366;&#24577;&#30340;Web&#24212;&#29992;&#30340;&#20869;&#22312;&#39118;&#38505;&#12290;&#20320;&#20250;&#39318;&#20808;&#23398;&#20064;&#29366;&#24577;&#12289;cookies&#12289;&#19982;&#20250;&#35805;&#65307;&#28982;&#21518;&#25105;&#20250;&#35752;&#35770;&#20851;&#20110;cookie&#30423;&#31363;&#12289;&#20250;&#35805;&#25968;&#25454;&#26292;&#38706;&#12289;&#20250;&#35805;&#22266;&#23450;&#12289;&#21450;&#20250;&#35805;&#21163;&#25345;&#30340;&#38382;&#39064;&#21450;&#38450;&#33539;&#23427;&#20204;&#30340;&#26041;&#27861;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &#27491;&#22914;&#22823;&#23478;&#30693;&#36947;&#30340;&#65292;HTTP&#26159;&#19968;&#31181;&#26080;&#29366;&#24577;&#30340;&#21327;&#35758;&#12290;&#36825;&#35828;&#26126;&#20102;&#20004;&#20010;HTTP&#35831;&#27714;&#20043;&#38388;&#32570;&#20047;&#32852;&#31995;&#12290;&#30001;&#20110;&#21327;&#35758;&#20013;&#26410;&#25552;&#20379;&#20219;&#20309;&#35753;&#23458;&#25143;&#31471;&#26631;&#35782;&#33258;&#24049;&#30340;&#26041;&#27861;&#65292;&#22240;&#27492;&#26381;&#21153;&#22120;&#20063;&#23601;&#26080;&#27861;&#21306;&#20998;&#23458;&#25143;&#31471;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &#34429;&#28982;HTTP&#26080;&#29366;&#24577;&#30340;&#29305;&#24615;&#36824;&#26159;&#26377;&#19968;&#20123;&#22909;&#22788;&#65292;&#27605;&#31455;&#32500;&#25252;&#29366;&#24577;&#26159;&#27604;&#36739;&#40635;&#28902;&#30340;&#65292;&#20294;&#26159;&#23427;&#21521;&#38656;&#35201;&#24320;&#21457;&#26377;&#29366;&#24577;&#30340;Web&#24212;&#29992;&#30340;&#24320;&#21457;&#20154;&#21592;&#25552;&#20986;&#20102;&#21069;&#25152;&#26410;&#26377;&#30340;&#25361;&#25112;&#12290;&#30001;&#20110;&#26080;&#27861;&#26631;&#35782;&#23458;&#25143;&#31471;&#65292;&#23601;&#19981;&#21487;&#33021;&#30830;&#35748;&#29992;&#25143;&#26159;&#21542;&#24050;&#30331;&#24405;&#65292;&#22312;&#36141;&#29289;&#36710;&#20013;&#21152;&#20837;&#21830;&#21697;&#65292;&#25110;&#32773;&#26159;&#38656;&#35201;&#27880;&#20876;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &#19968;&#20010;&#26368;&#21021;&#30001;&#32593;&#26223;&#20844;&#21496;&#26500;&#24605;&#30340;&#36229;&#24378;&#35299;&#20915;&#26041;&#26696;&#35806;&#29983;&#20102;&#65292;&#23427;&#23601;&#26159;&#34987;&#21629;&#21517;&#20026;cookies&#30340;&#19968;&#31181;&#29366;&#24577;&#31649;&#29702;&#26426;&#21046;&#12290;Cookies&#26159;&#23545;HTTP&#21327;&#35758;&#30340;&#25193;&#20805;&#12290;&#26356;&#30830;&#20999;&#22320;&#35828;&#65292;&#23427;&#20204;&#30001;&#20004;&#20010;HTTP&#22836;&#37096;&#32452;&#25104;&#65306;Set-Cookie&#21709;&#24212;&#22836;&#37096;&#21644;Cookie&#35831;&#27714;&#22836;&#37096;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &#24403;&#23458;&#25143;&#31471;&#21457;&#20986;&#23545;&#19968;&#20010;&#29305;&#23450;URL&#30340;&#35831;&#27714;&#26102;&#65292;&#26381;&#21153;&#22120;&#20250;&#22312;&#21709;&#24212;&#26102;&#36873;&#25321;&#21253;&#21547;&#19968;&#20010;Set-Cookie&#22836;&#37096;&#12290;&#23427;&#35201;&#27714;&#23458;&#25143;&#31471;&#22312;&#19979;&#38754;&#30340;&#35831;&#27714;&#20013;&#21253;&#21547;&#19968;&#20010;&#30456;&#23601;&#30340;Cookie&#22836;&#37096;&#12290;&#22270;4-1&#35828;&#26126;&#20102;&#36825;&#20010;&#22522;&#26412;&#30340;&#20132;&#20114;&#36807;&#31243;&#12290;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">&#22270;4-1. &#20004;&#20010;HTTP&#20107;&#21153;&#38388;Cookie&#30340;&#23436;&#25972;&#20132;&#20114;&#36807;&#31243;</p>
<p style="text-align: justify;"><img src="embim1.png" width="534" height="202" vspace="1" hspace="1" border="0" alt=""></p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &#22914;&#26524;&#20320;&#26681;&#25454;&#36825;&#20010;&#22522;&#26412;&#27010;&#24565;&#22312;&#27599;&#19968;&#20010;&#35831;&#27714;&#20013;&#21253;&#21547;&#21516;&#19968;&#20010;&#21807;&#19968;&#26631;&#35782;&#30721;&#65288;&#22312;cookie&#22836;&#37096;&#20013;&#65289;&#65292;&#20320;&#23601;&#33021;&#21807;&#19968;&#26631;&#35782;&#23458;&#25143;&#31471;&#20174;&#32780;&#25226;&#23427;&#21457;&#20986;&#30340;&#25152;&#26377;&#35831;&#27714;&#32852;&#31995;&#36215;&#26469;&#12290;&#36825;&#23601;&#26159;&#29366;&#24577;&#25152;&#35201;&#27714;&#30340;&#65292;&#21516;&#26102;&#20063;&#26159;&#36825;&#19968;&#26426;&#21046;&#30340;&#20027;&#35201;&#24212;&#29992;&#12290;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">&#23567;&#25552;&#31034;</p>
<p style="line-height: 1.50;">&#36804;&#20170;&#20026;&#27490;&#65292;&#26368;&#22909;&#30340;cookies&#20351;&#29992;&#25351;&#21335;&#20381;&#28982;&#26159;&#32593;&#26223;&#20844;&#21496;&#25552;&#20379;&#30340;&#35268;&#33539;&#65292;&#32593;&#22336;&#26159;&#65306;http://wp.netscape.com/newsref/std/cookie_spec.html &#12290;&#23427;&#26159;&#26368;&#31867;&#20284;&#21644;&#25509;&#36817;&#20110;&#20840;&#34892;&#19994;&#25903;&#25345;&#30340;&#26631;&#20934;&#12290;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &#22522;&#20110;&#20250;&#35805;&#31649;&#29702;&#30340;&#27010;&#24565;&#65292;&#21487;&#20197;&#36890;&#36807;&#31649;&#29702;&#27599;&#19968;&#20010;&#23458;&#25143;&#31471;&#30340;&#21508;&#33258;&#25968;&#25454;&#26469;&#31649;&#29702;&#29366;&#24577;&#12290;&#25968;&#25454;&#34987;&#23384;&#20648;&#22312;&#20250;&#35805;&#23384;&#20648;&#21306;&#20013;&#65292;&#36890;&#36807;&#27599;&#19968;&#27425;&#35831;&#27714;&#36827;&#34892;&#26356;&#26032;&#12290;&#30001;&#20110;&#20250;&#35805;&#35760;&#24405;&#22312;&#23384;&#20648;&#26102;&#26377;&#21807;&#19968;&#30340;&#26631;&#35782;&#65292;&#22240;&#27492;&#23427;&#36890;&#24120;&#34987;&#31216;&#20026;&#20250;&#35805;&#26631;&#35782;&#12290;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &#22914;&#26524;&#20320;&#20351;&#29992;PHP&#20869;&#24314;&#30340;&#20250;&#35805;&#26426;&#21046;&#65292;&#25152;&#26377;&#30340;&#36825;&#20123;&#22797;&#26434;&#36807;&#31243;&#37117;&#20250;&#30001;PHP&#20026;&#20320;&#22788;&#29702;&#12290;&#24403; &nbsp; &#20320;&#35843;&#29992;&#20989;&#25968;session_start()&#26102;&#65292;PHP&#39318;&#20808;&#35201;&#30830;&#35748;&#22312;&#26412;&#27425;&#35831;&#27714;&#20013;&#26159;&#21542;&#21253;&#21547;&#20250;&#35805;&#26631;&#35782;&#12290;&#22914;&#26524;&#26377;&#30340;&#35805;&#65292;PHP&#23601;&#20250;&#35835;&#21462;&#35813;&#20250;&#35805;&#25968;&#25454;&#24182;&#36890;&#36807;$_SESSION&#36229;&#32423;&#20844;&#29992;&#25968;&#32452;&#25552;&#20379;&#32473;&#20320;&#12290;&#22914;&#26524;&#19981;&#23384;&#22312;&#65292;PHP&#20250;&#29983;&#25104;&#19968;&#20010;&#20250;&#35805;&#26631;&#35782;&#24182;&#22312;&#20250;&#35805;&#23384;&#20648;&#21306;&#24314;&#31435;&#19968;&#20010;&#26032;&#35760;&#24405;&#12290;PHP&#36824;&#20250;&#22788;&#29702;&#20250;&#35805;&#26631;&#35782;&#30340;&#20256;&#36882;&#24182;&#22312;&#27599;&#19968;&#20010;&#35831;&#27714;&#26102;&#26356;&#26032;&#20250;&#35805;&#23384;&#20648;&#21306;&#12290;&#22270;4-2&#28436;&#31034;&#20102;&#36825;&#20010;&#36807;&#31243;&#12290;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &#34429;&#28982;&#36825;&#24456;&#31616;&#20415;&#26377;&#25928;&#65292;&#20294;&#26368;&#37325;&#35201;&#30340;&#36824;&#26159;&#35201;&#24847;&#35782;&#21040;&#36825;&#24182;&#19981;&#26159;&#19968;&#20010;&#23436;&#25972;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#22240;&#20026;&#22312;PHP&#30340;&#20250;&#35805;&#26426;&#21046;&#20013;&#27809;&#26377;&#20869;&#24314;&#30340;&#23433;&#20840;&#22788;&#29702;&#12290;&#38500;&#27492;&#20043;&#22806;&#65292;&#30001;&#20110;&#20250;&#35805;&#26631;&#35782;&#26159;&#23436;&#20840;&#38543;&#26426;&#20135;&#29983;&#30340;&#65292;&#22240;&#27492;&#26159;&#19981;&#21487;&#39044;&#27979;&#30340;&#12290;&#20320;&#24517;&#39035;&#33258;&#34892;&#24314;&#31435;&#23433;&#20840;&#26426;&#21046;&#20197;&#38450;&#27490;&#25152;&#26377;&#20854;&#23427;&#30340;&#20250;&#35805;&#25915;&#20987;&#25163;&#27573;&#12290;&#22312;&#26412;&#31456;&#20013;&#65292;&#25105;&#20250;&#25552;&#20986;&#19968;&#20123;&#38382;&#39064;&#65292;&#24182;&#25552;&#20379;&#30456;&#24212;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<hr noshade size=1 ><p style="line-height: 1.50;">&nbsp;</p>

</td></tr></table>

</body>
</html>
