<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>


   <title>7.3. &#37325;&#25773;&#25915;&#20987;</title>
   <meta name="generator" content="Help &amp; Manual" />
   <meta name="keywords" content="" />
   <meta http-equiv="Content-Type" content="text/html; charset=gb2312" />
   <meta http-equiv="Content-Style-Type" content="text/css" />
   <link type="text/css" href="default.css" rel="stylesheet" />
</head>
<body style="margin: 0px 0px 0px 0px; background: #FFFFFF;">


<table width="100%" border="0" cellspacing="0" cellpadding="5" bgcolor="#649CCC">
  <tr valign="middle">
    <td align="left">
      <p class="p_Heading1"><span class="f_Heading1">7.3. &#37325;&#25773;&#25915;&#20987;</span></p>

    </td>
    <td align="right">
     <span style="font-size: 9pt">
     <a href="introduction.htm">Top</a>&nbsp;
     <a href="new_item44.htm">Previous</a>&nbsp;
     <a href="new_item46.htm">Next</a>
     </span>
    </td>
  </tr>
</table>


<!-- Placeholder for topic body. -->
<table width="100%" border="0" cellspacing="0" cellpadding="5"><tr valign="top"><td align="left">
<p style="line-height: 1.50;">7.3. &#37325;&#25773;&#25915;&#20987;</p>
<p style="line-height: 1.50;">  &nbsp; &#37325;&#25773;&#25915;&#20987;&#65292;&#26377;&#26102;&#31216;&#20026;&#28436;&#31034;&#25915;&#20987;&#65292;&#21363;&#25915;&#20987;&#32773;&#37325;&#29616;&#20197;&#21069;&#21512;&#27861;&#29992;&#25143;&#21521;&#26381;&#21153;&#22120;&#25152;&#21457;&#36865;&#30340;&#25968;&#25454;&#20197;&#33719;&#21462;&#35775;&#38382;&#26435;&#25110;&#20854;&#23427;&#20998;&#37197;&#32473;&#35813;&#29992;&#25143;&#30340;&#26435;&#38480;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &#19982;&#23494;&#30721;&#21957;&#25506;&#19968;&#26679;&#65292;&#38450;&#27490;&#37325;&#25773;&#25915;&#20987;&#20063;&#38656;&#35201;&#20320;&#24847;&#35782;&#21040;&#25968;&#25454;&#30340;&#26292;&#38706;&#12290;&#20026;&#38450;&#27490;&#37325;&#25773;&#25915;&#20987;&#65292;&#20320;&#38656;&#35201;&#21152;&#22823;&#25915;&#20987;&#32773;&#33719;&#21462;&#20219;&#20309;&#29992;&#20110;&#21462;&#24471;&#21463;&#38480;&#36164;&#28304;&#30340;&#35775;&#38382;&#26435;&#38480;&#30340;&#25968;&#25454;&#30340;&#38590;&#24230;&#12290;&#36825;&#20027;&#35201;&#35201;&#27714;&#20570;&#21040;&#36991;&#20813;&#20197;&#19979;&#20570;&#27861;&#65306;</p>
<p style="line-height: 1.50;">  &nbsp; &#35774;&#23450;&#21463;&#20445;&#25252;&#36164;&#28304;&#27704;&#20037;&#35775;&#38382;&#26435;&#30340;&#25968;&#25454;&#30340;&#20351;&#29992;&#65307;</p>
<p style="line-height: 1.50;">&#35774;&#23450;&#21463;&#20445;&#25252;&#36164;&#28304;&#35775;&#38382;&#26435;&#30340;&#25968;&#25454;&#30340;&#26292;&#38706;&#65288;&#29978;&#33267;&#26159;&#21482;&#25552;&#20379;&#20020;&#26102;&#35775;&#38382;&#26435;&#30340;&#25968;&#25454;&#65289;&#65307;</p>
<p style="line-height: 1.50;">  &nbsp; &#36825;&#26679;&#65292;&#20320;&#24212;&#35813;&#21482;&#20351;&#29992;&#35774;&#23450;&#21463;&#20445;&#25252;&#36164;&#28304;&#20020;&#26102;&#35775;&#38382;&#26435;&#30340;&#25968;&#25454;&#65292;&#21516;&#26102;&#20320;&#36824;&#35201;&#23613;&#21147;&#36991;&#20813;&#35813;&#25968;&#25454;&#27844;&#38706;&#12290;&#36825;&#20123;&#34429;&#21482;&#26159;&#19968;&#33324;&#30340;&#25351;&#23548;&#21407;&#21017;&#65292;&#20294;&#23427;&#20204;&#33021;&#20026;&#20320;&#30340;&#36816;&#20316;&#26426;&#21046;&#25552;&#20379;&#25351;&#23548;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &#31532;&#19968;&#20010;&#21407;&#21017;&#25454;&#25105;&#25152;&#30693;&#65292;&#36829;&#21453;&#23427;&#30340;&#39057;&#29575;&#24050;&#36798;&#21040;&#20102;&#20196;&#20154;&#24656;&#24598;&#30340;&#31243;&#24230;&#12290;&#24456;&#22810;&#24320;&#21457;&#20154;&#21592;&#21482;&#27880;&#24847;&#20445;&#25252;&#25935;&#24863;&#25968;&#25454;&#26292;&#38706;&#65292;&#32780;&#24573;&#35270;&#20102;&#29992;&#20110;&#35774;&#23450;&#21463;&#20445;&#25252;&#36164;&#28304;&#27704;&#20037;&#35775;&#38382;&#26435;&#30340;&#25968;&#25454;&#22312;&#20351;&#29992;&#26102;&#24341;&#21457;&#30340;&#39118;&#38505;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &#20363;&#22914;&#65292;&#32771;&#34385;&#19968;&#19979;&#29992;&#26412;&#22320;&#33050;&#26412;&#35745;&#31639;&#39564;&#35777;&#34920;&#21333;&#23494;&#30721;&#30340;hash&#20540;&#30340;&#24773;&#20917;&#12290;&#36825;&#26679;&#23494;&#30721;&#30340;&#26126;&#25991;&#19981;&#20250;&#26292;&#38706;&#65292;&#26292;&#38706;&#30340;&#21482;&#26159;&#23427;&#30340;hash&#20540;&#12290;&#36825;&#23601;&#20445;&#25252;&#20102;&#29992;&#25143;&#30340;&#21407;&#22987;&#23494;&#30721;&#12290;&#36825;&#20010;&#27969;&#31243;&#30340;&#20027;&#35201;&#38382;&#39064;&#26159;&#37325;&#25773;&#28431;&#27934;&#20381;&#28982;&#22914;&#25925;&#8212;&#8212;&#25915;&#20987;&#32773;&#21487;&#20197;&#31616;&#21333;&#30340;&#37325;&#25773;&#19968;&#27425;&#21512;&#27861;&#30340;&#39564;&#35777;&#36807;&#31243;&#21363;&#21487;&#36890;&#36807;&#39564;&#35777;&#65292;&#21482;&#35201;&#29992;&#25143;&#23494;&#30721;&#26159;&#19968;&#33268;&#30340;&#65292;&#39564;&#35777;&#36807;&#31243;&#23601;&#20250;&#25104;&#21151;&#12290;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">&#26356;&#23433;&#20840;&#30340;&#36816;&#34892;&#26041;&#26696;&#12289;MD5&#30340;JavaScript&#28304;&#25991;&#20214;&#20197;&#21450;&#20854;&#23427;&#31639;&#27861;&#65292;&#35831;&#30475;http://pajhome.org.uk/crypt/md5/&#12290;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &#31867;&#20284;&#20110;&#23545;&#31532;&#19968;&#21407;&#21017;&#30340;&#36829;&#21453;&#26159;&#25351;&#23450;&#19968;&#20010;cookie&#20197;&#25552;&#20379;&#23545;&#26576;&#19968;&#36164;&#28304;&#30340;&#27704;&#20037;&#35775;&#38382;&#26435;&#12290;&#20363;&#22914;&#65292;&#35831;&#32771;&#34385;&#19979;&#38754;&#30340;&#36890;&#36807;&#35774;&#23450;cookie&#36816;&#34892;&#30340;&#19968;&#20010;&#27704;&#20037;&#35775;&#38382;&#26426;&#21046;&#30340;&#23581;&#35797;&#65306;</p>
<p style="line-height: 1.50;">CODE:</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">  &nbsp; &lt;?php</p>
<p style="line-height: 1.50;">  &nbsp; $auth = $username . md5($password);</p>
<p style="line-height: 1.50;">  &nbsp; setcookie('auth', $cookie);</p>
<p style="line-height: 1.50;">  &nbsp; ?&gt;</p>
<p style="line-height: 1.50;">&#22914;&#26524;&#19968;&#20010;&#26410;&#39564;&#35777;&#29992;&#25143;&#25552;&#20379;&#20102;&#19968;&#20010;&#39564;&#35777;cookie&#65292;&#31243;&#24207;&#20250;&#26816;&#26597;&#22312;cookie&#20013;&#30340;&#23494;&#30721;&#30340;hash&#20540;&#19982;&#23384;&#22312;&#25968;&#25454;&#24211;&#20013;&#30340;&#23494;&#30721;&#30340;hash&#26159;&#21542;&#21305;&#37197;&#12290;&#22914;&#26524;&#21305;&#37197;&#65292;&#21017;&#29992;&#25143;&#39564;&#35777;&#36890;&#36807;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &#26412;&#27969;&#31243;&#20013;&#30340;&#38382;&#39064;&#26159;&#35813;&#39564;&#35777;cookie&#30340;&#26292;&#38706;&#26159;&#19968;&#20010;&#38750;&#24120;&#22823;&#30340;&#39118;&#38505;&#12290;&#22914;&#26524;&#23427;&#34987;&#25429;&#33719;&#30340;&#35805;&#65292;&#25915;&#20987;&#32773;&#23601;&#33719;&#24471;&#20102;&#27704;&#20037;&#35775;&#38382;&#26435;&#12290;&#23613;&#31649;&#21512;&#27861;&#29992;&#25143;&#30340;cookie&#21487;&#33021;&#20250;&#36807;&#26399;&#65292;&#20294;&#25915;&#20987;&#32773;&#21487;&#20197;&#27599;&#27425;&#37117;&#25552;&#20379;cookie&#20197;&#20379;&#39564;&#35777;&#12290;&#35831;&#30475;&#22270;7-2&#20013;&#23545;&#36825;&#31181;&#24773;&#24418;&#30340;&#22270;&#31034;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &#19968;&#20010;&#26356;&#22909;&#30340;&#27704;&#20037;&#30331;&#24405;&#26041;&#26696;&#26159;&#21482;&#20351;&#29992;&#35774;&#23450;&#20020;&#26102;&#35775;&#38382;&#26435;&#30340;&#25968;&#25454;&#65292;&#36825;&#20063;&#26159;&#19979;&#19968;&#33410;&#30340;&#20027;&#39064;&#12290;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<hr noshade size=1 ><p style="line-height: 1.50;">&nbsp;</p>

</td></tr></table>

</body>
</html>
