<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>


   <title>1.3.2. &#36319;&#36394;&#25968;&#25454;</title>
   <meta name="generator" content="Help &amp; Manual" />
   <meta name="keywords" content="" />
   <meta http-equiv="Content-Type" content="text/html; charset=gb2312" />
   <meta http-equiv="Content-Style-Type" content="text/css" />
   <link type="text/css" href="default.css" rel="stylesheet" />
</head>
<body style="margin: 0px 0px 0px 0px; background: #FFFFFF;">


<table width="100%" border="0" cellspacing="0" cellpadding="5" bgcolor="#649CCC">
  <tr valign="middle">
    <td align="left">
      <p class="p_Heading1"><span class="f_Heading1">1.3.2. &#36319;&#36394;&#25968;&#25454;</span></p>

    </td>
    <td align="right">
     <span style="font-size: 9pt">
     <a href="introduction.htm">Top</a>&nbsp;
     <a href="new_item12.htm">Previous</a>&nbsp;
     <a href="new_item14.htm">Next</a>
     </span>
    </td>
  </tr>
</table>


<!-- Placeholder for topic body. -->
<table width="100%" border="0" cellspacing="0" cellpadding="5"><tr valign="top"><td align="left">
<p style="line-height: 1.50;">1.3.2. &#36319;&#36394;&#25968;&#25454;</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; &#20316;&#20026;&#19968;&#20010;&#26377;&#23433;&#20840;&#24847;&#35782;&#30340;&#24320;&#21457;&#32773;&#65292;&#26368;&#37325;&#35201;&#30340;&#19968;&#20214;&#20107;&#23601;&#26159;&#38543;&#26102;&#36319;&#36394;&#25968;&#25454;&#12290;&#19981;&#21482;&#26159;&#35201;&#30693;&#36947;&#23427;&#26159;&#20160;&#20040;&#21644;&#23427;&#22312;&#21738;&#37324;&#65292;&#36824;&#35201;&#30693;&#36947;&#23427;&#20174;&#21738;&#37324;&#26469;&#65292;&#35201;&#21040;&#21738;&#37324;&#21435;&#12290;&#26377;&#26102;&#20505;&#35201;&#20570;&#21040;&#36825;&#20123;&#26159;&#22256;&#38590;&#30340;&#65292;&#29305;&#21035;&#26159;&#24403;&#20320;&#23545;WEB&#30340;&#36816;&#20570;&#21407;&#29702;&#27809;&#26377;&#28145;&#20837;&#29702;&#35299;&#26102;&#12290;&#36825;&#20063;&#23601;&#26159;&#20026;&#20160;&#20040;&#23613;&#31649;&#26377;&#20123;&#24320;&#21457;&#32773;&#22312;&#20854;&#23427;&#24320;&#21457;&#29615;&#22659;&#20013;&#24456;&#26377;&#32463;&#39564;&#65292;&#20294;&#20182;&#23545;WEB&#19981;&#26159;&#24456;&#26377;&#32463;&#39564;&#26102;&#65292;&#32463;&#24120;&#20250;&#29359;&#38169;&#24182;&#21046;&#36896;&#23433;&#20840;&#28431;&#27934;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; &#22823;&#22810;&#25968;&#20154;&#22312;&#35835;&#21462;EMAIL&#26102;&#65292;&#19968;&#33324;&#19981;&#20250;&#34987;&#39064;&#20026;"Re: Hello"&#20043;&#31867;&#30340;&#22403;&#22334;&#37038;&#20214;&#25152;&#27450;&#39575;&#65292;&#22240;&#20026;&#20182;&#20204;&#30693;&#36947;&#65292;&#36825;&#20010;&#30475;&#36215;&#26469;&#20687;&#22238;&#22797;&#30340;&#20027;&#39064;&#26159;&#33021;&#34987;&#20266;&#36896;&#30340;&#12290;&#22240;&#27492;&#65292;&#36825;&#23553;&#37038;&#20214;&#19981;&#19968;&#23450;&#26159;&#23545;&#21069;&#19968;&#23553;&#20027;&#39064;&#20026;"Hello."&#30340;&#37038;&#20214;&#30340;&#22238;&#22797;&#12290;&#31616;&#32780;&#35328;&#20043;&#65292;&#20154;&#20204;&#30693;&#36947;&#19981;&#33021;&#23545;&#36825;&#20010;&#20027;&#39064;&#19981;&#33021;&#22826;&#20449;&#20219;&#12290;&#20294;&#26159;&#24456;&#23569;&#26377;&#20154;&#24847;&#35782;&#21040;&#21457;&#20214;&#20154;&#22320;&#22336;&#20063;&#33021;&#34987;&#20266;&#36896;&#65292;&#20182;&#20204;&#38169;&#35823;&#22320;&#35748;&#20026;&#23427;&#33021;&#21487;&#38752;&#22320;&#26174;&#31034;&#36825;&#20010;EMAIL&#30340;&#26469;&#28304;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; Web&#20063;&#38750;&#24120;&#31867;&#20284;&#65292;&#25105;&#24819;&#25945;&#32473;&#22823;&#23478;&#30340;&#20854;&#20013;&#19968;&#28857;&#26159;&#22914;&#20309;&#21306;&#20998;&#21487;&#20449;&#30340;&#21644;&#19981;&#21487;&#20449;&#30340;&#25968;&#25454;&#12290;&#20570;&#21040;&#36825;&#19968;&#28857;&#24120;&#24120;&#26159;&#19981;&#23481;&#26131;&#30340;&#65292;&#30450;&#30446;&#30340;&#29468;&#27979;&#24182;&#19981;&#26159;&#21150;&#27861;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; PHP&#36890;&#36807;&#36229;&#32423;&#20840;&#23616;&#25968;&#32452;&#22914;$_GET, $_POST, &#21450;$_COOKIE&#28165;&#26970;&#22320;&#34920;&#31034;&#20102;&#29992;&#25143;&#25968;&#25454;&#30340;&#26469;&#28304;&#12290;&#19968;&#20010;&#20005;&#26684;&#30340;&#21629;&#21517;&#20307;&#31995;&#33021;&#20445;&#35777;&#20320;&#22312;&#31243;&#24207;&#20195;&#30721;&#30340;&#20219;&#20309;&#37096;&#20998;&#30693;&#36947;&#25152;&#26377;&#25968;&#25454;&#30340;&#26469;&#28304;&#65292;&#36825;&#20063;&#26159;&#25105;&#19968;&#30452;&#25152;&#31034;&#33539;&#21644;&#24378;&#35843;&#30340;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; &#30693;&#36947;&#25968;&#25454;&#22312;&#21738;&#37324;&#36827;&#20837;&#20320;&#30340;&#31243;&#24207;&#26159;&#26497;&#20026;&#37325;&#35201;&#30340;&#65292;&#21516;&#26102;&#30693;&#36947;&#25968;&#25454;&#22312;&#21738;&#37324;&#31163;&#24320;&#20320;&#30340;&#31243;&#24207;&#20063;&#24456;&#37325;&#35201;&#12290;&#20363;&#22914;&#65292;&#24403;&#20320;&#20351;&#29992;echo&#25351;&#20196;&#26102;&#65292;&#20320;&#26159;&#22312;&#21521;&#23458;&#25143;&#31471;&#21457;&#36865;&#25968;&#25454;&#65307;&#24403;&#20320;&#20351;&#29992;mysql_query&#26102;&#65292;&#20320;&#26159;&#22312;&#21521;MySQL&#25968;&#25454;&#24211;&#21457;&#36865;&#25968;&#25454;&#65288;&#23613;&#31649;&#20320;&#30340;&#30446;&#30340;&#21487;&#33021;&#26159;&#21462;&#25968;&#25454;&#65289;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; &#22312;&#25105;&#23457;&#26680;PHP&#20195;&#30721;&#26159;&#21542;&#26377;&#23433;&#20840;&#28431;&#27934;&#26102;&#65292;&#25105;&#20027;&#35201;&#26816;&#26597;&#20195;&#30721;&#20013;&#19982;&#22806;&#37096;&#31995;&#32479;&#20132;&#20114;&#30340;&#37096;&#20998;&#12290;&#36825;&#37096;&#20998;&#20195;&#30721;&#24456;&#26377;&#21487;&#33021;&#21253;&#21547;&#23433;&#20840;&#28431;&#27934;&#65292;&#22240;&#27492;&#65292;&#22312;&#24320;&#21457;&#19982;&#20195;&#30721;&#26816;&#26597;&#26102;&#24517;&#39035;&#35201;&#21152;&#20197;&#29305;&#21035;&#20180;&#32454;&#30340;&#27880;&#24847;&#12290;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<hr noshade size=1 ><p style="line-height: 1.50;">&nbsp;</p>

</td></tr></table>

</body>
</html>
