<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>


   <title>&#31532;&#19971;&#31456; &#39564;&#35777;&#19982;&#25480;&#26435;</title>
   <meta name="generator" content="Help &amp; Manual" />
   <meta name="keywords" content="" />
   <meta http-equiv="Content-Type" content="text/html; charset=gb2312" />
   <meta http-equiv="Content-Style-Type" content="text/css" />
   <link type="text/css" href="default.css" rel="stylesheet" />
</head>
<body style="margin: 0px 0px 0px 0px; background: #FFFFFF;">


<table width="100%" border="0" cellspacing="0" cellpadding="5" bgcolor="#649CCC">
  <tr valign="middle">
    <td align="left">
      <p class="p_Heading1"><span class="f_Heading1">&#31532;&#19971;&#31456; &#39564;&#35777;&#19982;&#25480;&#26435;</span></p>

    </td>
    <td align="right">
     <span style="font-size: 9pt">
     <a href="introduction.htm">Top</a>&nbsp;
     <a href="new_item41.htm">Previous</a>&nbsp;
     <a href="new_item43.htm">Next</a>
     </span>
    </td>
  </tr>
</table>


<!-- Placeholder for topic body. -->
<table width="100%" border="0" cellspacing="0" cellpadding="5"><tr valign="top"><td align="left">
<p style="line-height: 1.50;">  &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&#31532;&#19971;&#31456; &#39564;&#35777;&#19982;&#25480;&#26435;</p>
<p style="line-height: 1.50;">  &nbsp; &#24456;&#22810;Web&#24212;&#29992;&#34987;&#20854;&#31967;&#31957;&#30340;&#36523;&#20221;&#39564;&#35777;&#19982;&#25480;&#26435;&#26426;&#21046;&#25152;&#22256;&#25200;&#12290;&#26412;&#31456;&#20027;&#35201;&#35752;&#35770;&#30456;&#20851;&#36825;&#20123;&#26426;&#21046;&#30340;&#28431;&#27934;&#65292;&#20256;&#25480;&#19968;&#20123;&#24110;&#21161;&#20320;&#19981;&#29359;&#36890;&#30149;&#30340;&#26041;&#27861;&#12290;&#25105;&#23558;&#36890;&#36807;&#19968;&#20123;&#20363;&#23376;&#36827;&#19968;&#27493;&#35828;&#26126;&#36825;&#20123;&#26041;&#27861;&#65292;&#20294;&#35831;&#27880;&#24847;&#19981;&#35201;&#25226;&#36825;&#20123;&#31034;&#20363;&#19982;&#20854;&#19978;&#19979;&#25991;&#21106;&#35010;&#24320;&#26469;&#30475;&#65292;&#29702;&#35299;&#20854;&#20013;&#21253;&#21547;&#30340;&#21407;&#21017;&#21644;&#26041;&#27861;&#26159;&#24456;&#37325;&#35201;&#30340;&#12290;&#21482;&#26377;&#21040;&#37027;&#20010;&#26102;&#20505;&#20320;&#25165;&#33021;&#23545;&#23427;&#20204;&#36827;&#34892;&#27491;&#30830;&#36816;&#29992;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &#36890;&#36807;&#39564;&#35777;&#25105;&#20204;&#21487;&#20197;&#30830;&#23450;&#19968;&#20010;&#29992;&#25143;&#30340;&#36523;&#20221;&#12290;&#20856;&#22411;&#30340;&#20570;&#27861;&#26159;&#31616;&#21333;&#22320;&#20351;&#29992;&#29992;&#25143;&#21517;&#21644;&#23494;&#30721;&#36827;&#34892;&#26816;&#26597;&#12290;&#36825;&#26679;&#25105;&#20204;&#23601;&#33021;&#30830;&#23450;&#30331;&#24405;&#29992;&#25143;&#26159;&#19968;&#20010;&#25480;&#26435;&#29992;&#25143;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &#36523;&#20221;&#39564;&#35777;&#65292;&#24120;&#34987;&#31216;&#20026;&#35775;&#38382;&#25511;&#21046;&#65292;&#26159;&#19968;&#31181;&#20320;&#33021;&#29992;&#26469;&#20445;&#25252;&#23545;&#21463;&#38480;&#36164;&#28304;&#30340;&#35775;&#38382;&#21450;&#30830;&#35748;&#19968;&#20010;&#29992;&#25143;&#26159;&#21542;&#26377;&#26435;&#35775;&#38382;&#29305;&#23450;&#36164;&#28304;&#30340;&#26041;&#27861;&#12290;&#20363;&#22914;&#65292;&#24456;&#22810;WEB&#24212;&#29992;&#20250;&#26377;&#21482;&#23545;&#25480;&#26435;&#29992;&#25143;&#24320;&#25918;&#30340;&#36164;&#28304;&#12289;&#21482;&#23545;&#31995;&#32479;&#31649;&#29702;&#21592;&#24320;&#25918;&#30340;&#36164;&#28304;&#20197;&#21450;&#23545;&#25152;&#26377;&#29992;&#25143;&#24320;&#25918;&#30340;&#36164;&#28304;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &#20135;&#29983;&#35775;&#38382;&#25511;&#21046;&#28431;&#27934;&#30340;&#19968;&#20010;&#20027;&#35201;&#21407;&#22240;&#26159;&#31895;&#24515;&#22823;&#24847;&#8212;&#8212;&#22312;Web&#24212;&#29992;&#20013;&#36825;&#19968;&#37096;&#20998;&#31243;&#24207;&#26159;&#26368;&#23569;&#34987;&#20851;&#24515;&#21644;&#27880;&#24847;&#30340;&#12290;&#22312;&#24320;&#21457;&#20013;&#31649;&#29702;&#21151;&#33021;&#21644;&#35775;&#38382;&#25511;&#21046;&#24120;&#24120;&#26159;&#26368;&#21518;&#32771;&#34385;&#30340;&#65292;&#32780;&#19988;&#19968;&#33324;&#26159;&#20174;&#25480;&#26435;&#29992;&#25143;&#30340;&#20986;&#21457;&#28857;&#21435;&#32771;&#34385;&#21644;&#32534;&#20889;&#65292;&#24182;&#27809;&#26377;&#32771;&#34385;&#25915;&#20987;&#32773;&#21487;&#33021;&#20250;&#20351;&#29992;&#30340;&#25163;&#27573;&#12290;&#23545;&#25480;&#26435;&#29992;&#25143;&#30340;&#20449;&#20219;&#36828;&#36828;&#39640;&#36807;&#21311;&#21517;&#29992;&#25143;&#65292;&#20294;&#26159;&#22914;&#26524;&#20320;&#30340;&#31649;&#29702;&#21151;&#33021;&#26159;&#33021;&#36890;&#36807;URL&#30452;&#25509;&#20844;&#24320;&#35775;&#38382;&#30340;&#35805;&#65292;&#23601;&#20250;&#25104;&#20026;&#25915;&#20987;&#32773;&#38047;&#29233;&#30340;&#30446;&#26631;&#12290;&#30095;&#24573;&#26159;&#20320;&#39318;&#35201;&#30340;&#22823;&#25932;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &#20026;&#36798;&#21040;&#23433;&#20840;&#30340;&#30446;&#30340;&#65292;&#38656;&#35201;&#22312;&#35774;&#35745;&#26102;&#23601;&#32508;&#21512;&#32771;&#34385;&#35775;&#38382;&#25511;&#21046;&#12290;&#23427;&#19981;&#24212;&#21482;&#26159;&#19968;&#20010;&#29616;&#26377;&#24212;&#29992;&#30340;&#38376;&#38377;&#65292;&#23613;&#31649;&#26377;&#26102;&#21487;&#33021;&#26159;&#36825;&#26679;&#30340;&#65292;&#20294;&#35813;&#27969;&#31243;&#26159;&#38750;&#24120;&#23481;&#26131;&#21457;&#29983;&#38169;&#35823;&#30340;&#65292;&#21516;&#26102;&#35775;&#38382;&#25511;&#21046;&#20013;&#30340;&#38169;&#35823;&#24517;&#28982;&#23548;&#33268;&#23433;&#20840;&#28431;&#27934;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &#35775;&#38382;&#25511;&#21046;&#36824;&#38656;&#35201;&#19968;&#20010;&#21487;&#38752;&#30340;&#35782;&#21035;&#26426;&#21046;&#12290;&#27605;&#31455;&#65292;&#22914;&#26524;&#19968;&#20010;&#25915;&#20987;&#32773;&#33021;&#20266;&#35013;&#25104;&#19968;&#20010;&#21512;&#27861;&#29992;&#25143;&#65292;&#25152;&#26377;&#30340;&#22522;&#20110;&#29992;&#25143;&#35782;&#21035;&#30340;&#35775;&#38382;&#25511;&#21046;&#26159;&#26080;&#25928;&#30340;&#12290;&#22240;&#27492;&#65292;&#20320;&#35201;&#32771;&#34385;&#21040;&#25915;&#20987;&#30340;&#24773;&#20917;&#65292;&#20363;&#22914;&#20250;&#35805;&#21163;&#25345;&#12290;&#20851;&#20110;&#20250;&#35805;&#30456;&#20851;&#30340;&#25915;&#20987;&#25163;&#27573;&#35831;&#21442;&#35265;&#31532;&#22235;&#31456;&#12290;</p>
<p style="line-height: 1.50;">  &nbsp; &#26412;&#31456;&#28041;&#21450;&#30456;&#20851;&#39564;&#35777;&#19982;&#25480;&#26435;&#20013;&#36890;&#24120;&#38656;&#35201;&#20851;&#27880;&#30340;&#22235;&#20010;&#26041;&#38754;&#65306;&#26292;&#21147;&#25915;&#20987;&#65292;&#23494;&#30721;&#21957;&#25506;&#65292;&#37325;&#25773;&#25915;&#20987;&#20197;&#21450;&#27704;&#20037;&#30331;&#24405;&#12290;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<p style="line-height: 1.50;">&nbsp;</p>
<hr noshade size=1 ><p style="line-height: 1.50;">&nbsp;</p>

</td></tr></table>

</body>
</html>
